acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
		if (subbandTripletCnt)
		{
			//if any preferred channel triplet exists
			RTPRINT(FIOCTL, (IOCTL_BT_HCICMD|IOCTL_BT_LOGO), ("There are %d sub band triplet exists, ", subbandTripletCnt));
		 	if (firstRemoteLegalChnlInTriplet == 0)
		 	{
		 		//no legal channel is found, reject the connection.
				RTPRINT(FIOCTL, (IOCTL_BT_HCICMD|IOCTL_BT_LOGO), ("no legal channel is found!!\n"));
		 	}
			else
			{
				// Remote Legal channel is found but not match to local
				//(wifi connection exists), so reject the connection.
				RTPRINT(FIOCTL, (IOCTL_BT_HCICMD|IOCTL_BT_LOGO), ("Remote Legal channel is found but not match to local(wifi connection exists)!!\n"));
			}
			pBtMgnt->CheckChnlIsSuit = _FALSE;
		}
		else
		{
			// There are not any preferred channel triplet exists
			// Use current legal channel as the bt channel.
			RTPRINT(FIOCTL, (IOCTL_BT_HCICMD|IOCTL_BT_LOGO), ("No sub band triplet exists!!\n"));
		}
		pBtMgnt->BTChannel = localchnl;
		RTPRINT(FIOCTL, (IOCTL_BT_HCICMD|IOCTL_BT_LOGO), ("Local channel (%d) is selected!!\n", pBtMgnt->BTChannel));
	}
}


//Success:return _TRUE
//Fail:return _FALSE
u8 bthci_GetAssocInfo(PADAPTER padapter, u8 EntryNum)
{
//	PMGNT_INFO pMgntInfo = &padapter->MgntInfo;
	PBT30Info		pBTInfo;
	PBT_HCI_INFO	pBtHciInfo;
	u8	tempBuf[256];
	u8	i = 0;
	u8	BaseMemoryShift = 0;
	u16	TotalLen = 0;

	PAMP_ASSOC_STRUCTURE	pAmpAsoc;


	RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("GetAssocInfo start\n"));

	pBTInfo = GET_BT_INFO(padapter);
	pBtHciInfo = &pBTInfo->BtHciInfo;

	if (pBTInfo->BtAsocEntry[EntryNum].AmpAsocCmdData.LenSoFar == 0)
	{

		if (pBTInfo->BtAsocEntry[EntryNum].AmpAsocCmdData.AMPAssocRemLen < (MAX_AMP_ASSOC_FRAG_LEN))
			TotalLen = pBTInfo->BtAsocEntry[EntryNum].AmpAsocCmdData.AMPAssocRemLen;
		else if (pBTInfo->BtAsocEntry[EntryNum].AmpAsocCmdData.AMPAssocRemLen == (MAX_AMP_ASSOC_FRAG_LEN))
			TotalLen = MAX_AMP_ASSOC_FRAG_LEN;
	}
	else if (pBTInfo->BtAsocEntry[EntryNum].AmpAsocCmdData.LenSoFar > 0)
		TotalLen = pBTInfo->BtAsocEntry[EntryNum].AmpAsocCmdData.LenSoFar;

	while ((pBTInfo->BtAsocEntry[EntryNum].AmpAsocCmdData.LenSoFar >= BaseMemoryShift) || TotalLen > BaseMemoryShift)
	{
		RTPRINT(FIOCTL, IOCTL_BT_HCICMD_DETAIL, ("GetAssocInfo, TotalLen=%d, BaseMemoryShift=%d\n",TotalLen,BaseMemoryShift));
		_rtw_memcpy(tempBuf,
			(u8*)pBTInfo->BtAsocEntry[EntryNum].AmpAsocCmdData.AMPAssocfragment+BaseMemoryShift,
			TotalLen-BaseMemoryShift);
		RTPRINT_DATA(FIOCTL, IOCTL_BT_HCICMD_DETAIL, "GetAssocInfo :\n",
			tempBuf, TotalLen-BaseMemoryShift);

#if 0
		AmpAsoc[i].TypeID=*((u8 *)(tempBuf));
		AmpAsoc[i].Length=*((u16 *)(((u8 *)(tempBuf))+1));
		_rtw_memcpy(AmpAsoc[i].Data, ((u8 *)(tempBuf))+3, AmpAsoc[i].Length);
		BaseMemoryShift=BaseMemoryShift+3+AmpAsoc[i].Length;
#else
		pAmpAsoc = (PAMP_ASSOC_STRUCTURE)tempBuf;
		pAmpAsoc->Length = EF2Byte(pAmpAsoc->Length);
		BaseMemoryShift += 3 + pAmpAsoc->Length;
#endif

		RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("TypeID = 0x%x, ", pAmpAsoc->TypeID));
		RTPRINT_DATA(FIOCTL, IOCTL_BT_HCICMD, "Hex Data: \n", pAmpAsoc->Data, pAmpAsoc->Length);
		switch (pAmpAsoc->TypeID)
		{
			case AMP_MAC_ADDR:
				{
					RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("==> AMP_MAC_ADDR\n"));
					if (pAmpAsoc->Length > 6)
					{
						return _FALSE;
					}

					_rtw_memcpy(pBTInfo->BtAsocEntry[EntryNum].BTRemoteMACAddr, pAmpAsoc->Data,6);
					RTPRINT_ADDR(FIOCTL, IOCTL_BT_HCICMD, ("Remote Mac address \n"), pBTInfo->BtAsocEntry[EntryNum].BTRemoteMACAddr);
					break;
				}

			case AMP_PREFERRED_CHANNEL_LIST:
				{
					RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("==> AMP_PREFERRED_CHANNEL_LIST\n"));
					pBtHciInfo->BtPreChnlListLen=pAmpAsoc->Length;
					_rtw_memcpy(pBtHciInfo->BTPreChnllist,
						pAmpAsoc->Data,
						pBtHciInfo->BtPreChnlListLen);
					RTPRINT_DATA(FIOCTL, IOCTL_BT_HCICMD, "Preferred channel list : \n", pBtHciInfo->BTPreChnllist, pBtHciInfo->BtPreChnlListLen);
					bthci_DecideBTChannel(padapter,EntryNum);
					break;
				}

			case AMP_CONNECTED_CHANNEL:
				{
					RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("==> AMP_CONNECTED_CHANNEL\n"));
					pBtHciInfo->BTConnectChnlListLen=pAmpAsoc->Length;
					_rtw_memcpy(pBtHciInfo->BTConnectChnllist,
						pAmpAsoc->Data,
						pBtHciInfo->BTConnectChnlListLen);
					break;

				}

			case AMP_80211_PAL_CAP_LIST:
				{

					RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("==> AMP_80211_PAL_CAP_LIST\n"));
					pBTInfo->BtAsocEntry[EntryNum].BTCapability=*(u32 *)(pAmpAsoc->Data);
					if (pBTInfo->BtAsocEntry[EntryNum].BTCapability && 0x00000001)
					{
						// TODO:

						//Signifies PAL capable of utilizing received activity reports.
					}
					if (pBTInfo->BtAsocEntry[EntryNum].BTCapability && 0x00000002)
					{
						// TODO:
						//Signifies PAL is capable of utilizing scheduling information received in an activity reports.
					}
					break;
				}

			case AMP_80211_PAL_VISION:
				{
					pBtHciInfo->BTPalVersion=*(u8 *)(pAmpAsoc->Data);
					pBtHciInfo->BTPalCompanyID=*(u16 *)(((u8 *)(pAmpAsoc->Data))+1);
					pBtHciInfo->BTPalsubversion=*(u16 *)(((u8 *)(pAmpAsoc->Data))+3);
					RTPRINT(FIOCTL, (IOCTL_BT_HCICMD|IOCTL_BT_LOGO), ("==> AMP_80211_PAL_VISION PalVersion  0x%x, PalCompanyID  0x%x, Palsubversion 0x%x\n",
					pBtHciInfo->BTPalVersion,
					pBtHciInfo->BTPalCompanyID,
					pBtHciInfo->BTPalsubversion));
					break;
				}

			default:
					RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("==> Unsupport TypeID !!\n"));
				break;
		}
		i++;
	}
	RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("GetAssocInfo end\n"));

	return _TRUE;
}

u8 bthci_AddEntry(PADAPTER padapter)
{
	PBT30Info		pBTInfo;
	PBT_MGNT		pBtMgnt;
	u8			i;


	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;

	for (i = 0; i < MAX_BT_ASOC_ENTRY_NUM; i++)
	{
		if (pBTInfo->BtAsocEntry[i].bUsed == _FALSE)
		{
			pBTInfo->BtAsocEntry[i].bUsed = _TRUE;
			pBtMgnt->CurrentConnectEntryNum = i;
			break;
		}
	}

	if (i == MAX_BT_ASOC_ENTRY_NUM)
	{
		RTPRINT(FIOCTL, IOCTL_STATE, ("bthci_AddEntry(), Add entry fail!!\n"));
		return _FALSE;
	}
	return _TRUE;
}

u8 bthci_DiscardTxPackets(PADAPTER padapter, u16 LLH)
{
#if 0
	u8 flushOccured = _FALSE;
#if (SENDTXMEHTOD == 0 || SENDTXMEHTOD == 2)
//	PADAPTER		padapter = GetDefaultAdapter(padapter);
	PRT_TX_LOCAL_BUFFER	 pLocalBuffer;
	PPACKET_IRP_ACL_DATA pACLData;

	RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("bthci_DiscardTxPackets() ==>\n"));

	PlatformAcquireSpinLock(padapter, RT_BTData_SPINLOCK);
	while(!RTIsListEmpty(&padapter->BTDataTxQueue))
	{
		pLocalBuffer = (PRT_TX_LOCAL_BUFFER)RTRemoveHeadListWithCnt(&padapter->BTDataTxQueue, &padapter->NumTxBTDataBlock);
		if (pLocalBuffer)
		{
			pACLData = (PPACKET_IRP_ACL_DATA)pLocalBuffer->Buffer.VirtualAddress;
			if (pACLData->Handle == LLH)
				flushOccured = _TRUE;
			RTInsertTailListWithCnt(&padapter->BTDataIdleQueue, &pLocalBuffer->List, &padapter->NumIdleBTDataBlock);
		}
	}
	PlatformReleaseSpinLock(padapter, RT_BTData_SPINLOCK);
#endif
	RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("bthci_DiscardTxPackets() <==\n"));
	return flushOccured;
#else
	return _FALSE;
#endif
}

u8
bthci_CheckLogLinkBehavior(
	PADAPTER 					padapter,
	HCI_FLOW_SPEC			TxFlowSpec
	)
{
	u8	ID = TxFlowSpec.Identifier;
	u8	ServiceType = TxFlowSpec.ServiceType;
	u16	MaxSDUSize = TxFlowSpec.MaximumSDUSize;
	u32	SDUInterArrivatime = TxFlowSpec.SDUInterArrivalTime;
	u8	match = _FALSE;

	switch (ID)
	{
		case 1:
		{
			if (ServiceType == BT_LL_BE)
			{
				match = _TRUE;
				RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  TX best effort flowspec\n"));
			}
			else if ((ServiceType == BT_LL_GU) && (MaxSDUSize == 0xffff))
			{
				match = _TRUE;
				RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  RX guaranteed latency flowspec\n"));
			}
			else if ((ServiceType == BT_LL_GU) && (MaxSDUSize == 2500))
			{
				RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  RX guaranteed Large latency flowspec\n"));
			}
			break;
		}
		case 2:
		{
			if (ServiceType == BT_LL_BE)
			{
				match = _TRUE;
				RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  RX best effort flowspec\n"));

