acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
	pAssoStrc->TypeID = AMP_80211_PAL_CAP_LIST;
	pAssoStrc->Length = 0x04;

	pAssoStrc->Data[0] = 0x00;
	pAssoStrc->Data[1] = 0x00;

	RTPRINT_DATA(FIOCTL, IOCTL_BT_HCICMD_DETAIL, ("PALCapabilities : \n"), pAssoStrc, pAssoStrc->Length+3);
	RTPRINT(FIOCTL, IOCTL_BT_LOGO, ("PALCapabilities \n"));

	RTPRINT(FIOCTL, IOCTL_BT_LOGO, (" TypeID = 0x%x,\n Length = 0x%x,\n Content =0x0000\n",
		pAssoStrc->TypeID,
		pAssoStrc->Length));

	return (pAssoStrc->Length+3);
}

u16
bthci_AssocPreferredChannelList(
	PADAPTER		padapter,
	void	*pbuf,
	u8		EntryNum
	)
{
//	PMGNT_INFO pMgntInfo = &padapter->MgntInfo;
	PBT30Info				pBTInfo;
//	PRT_DOT11D_INFO pDot11dInfo;
	PAMP_ASSOC_STRUCTURE	pAssoStrc;
	PAMP_PREF_CHNL_REGULATORY pReg;
	PCHNL_TXPOWER_TRIPLE pTripleIE, pTriple;
	char	ctrString[3] = {'X', 'X', 'X'};
	u32	len = 0;
	u8	i=0, NumTriples=0, preferredChnl;


	pBTInfo = GET_BT_INFO(padapter);
//	pDot11dInfo = GET_DOT11D_INFO(pMgntInfo);
	pAssoStrc = (PAMP_ASSOC_STRUCTURE)pbuf;
	pReg = (PAMP_PREF_CHNL_REGULATORY)&pAssoStrc->Data[3];

	preferredChnl = bthci_GetLocalChannel(padapter);
	pAssoStrc->TypeID = AMP_PREFERRED_CHANNEL_LIST;
#if 0//cosa temp remove
	// When 802.11d is enabled and learned from beacon
	if (	(pDot11dInfo->bEnabled) &&
		(pDot11dInfo->State == DOT11D_STATE_LEARNED)	)
	{
		//Country String
		_rtw_memcpy(&pAssoStrc->Data[0], &pDot11dInfo->CountryIeBuf[0], 3);
		pReg->reXId = 201;
		pReg->regulatoryClass = 254;	// should parse beacon frame
		pReg->coverageClass = 0;
		len += 6;
		pTriple=(PCHNL_TXPOWER_TRIPLE)&pAssoStrc->Data[len];
		pTripleIE = (PCHNL_TXPOWER_TRIPLE)(&pDot11dInfo->CountryIeBuf[3]);

		NumTriples = (pDot11dInfo->CountryIeLen-3)/3;// skip 3-byte country string.
		for (i=0; i<NumTriples; i++)
		{
			if (	(preferredChnl > pTripleIE->FirstChnl) &&
				(preferredChnl <= (pTripleIE->FirstChnl+pTripleIE->NumChnls-1)))
			{
				// ex: preferred=10, first=3, num=9, from ch3~ch11
				// that should be divided to 2~3 groups
				// (1) first=10, num=1, ch10
				// (2) first=3, num=7, from ch3~ch9
				// (3) first=11, num=1, ch11

				// (1) group 1, preferred channel
				pTriple->FirstChnl = preferredChnl;
				pTriple->NumChnls = 1;
				pTriple->MaxTxPowerInDbm = pTripleIE->MaxTxPowerInDbm;
				len += 3;
				pTriple = (PCHNL_TXPOWER_TRIPLE)((u8*)pTriple + 3);

				// (2) group 2, first chnl~preferred-1
				pTriple->FirstChnl = pTripleIE->FirstChnl;
				pTriple->NumChnls = preferredChnl-pTriple->FirstChnl;
				pTriple->MaxTxPowerInDbm = pTripleIE->MaxTxPowerInDbm;
				len += 3;
				pTriple = (PCHNL_TXPOWER_TRIPLE)((u8*)pTriple + 3);

				if (preferredChnl < (pTripleIE->FirstChnl+pTripleIE->NumChnls-1))
				{
					// (3) group 3, preferred+1~last
					pTriple->FirstChnl = preferredChnl+1;
					pTriple->NumChnls = pTripleIE->FirstChnl+pTripleIE->NumChnls-1-preferredChnl;
					pTriple->MaxTxPowerInDbm = pTripleIE->MaxTxPowerInDbm;
					len += 3;
					pTriple = (PCHNL_TXPOWER_TRIPLE)((u8*)pTriple + 3);
				}
			}
			else
			{
				pTriple->FirstChnl = pTripleIE->FirstChnl;
				pTriple->NumChnls = pTripleIE->NumChnls;
				pTriple->MaxTxPowerInDbm = pTripleIE->MaxTxPowerInDbm;
				len += 3;
				pTriple = (PCHNL_TXPOWER_TRIPLE)((u8*)pTriple + 3);
			}
			pTripleIE = (PCHNL_TXPOWER_TRIPLE)((u8*)pTripleIE + 3);
		}
	}
	else
#endif
	{
		// locale unknown
		_rtw_memcpy(&pAssoStrc->Data[0], &ctrString[0], 3);
		pReg->reXId = 201;
		pReg->regulatoryClass = 254;
		pReg->coverageClass = 0;
		len += 6;
		RTPRINT(FIOCTL, (IOCTL_BT_HCICMD | IOCTL_BT_LOGO), ("PREFERRED_CHNL_LIST\n"));
		RTPRINT(FIOCTL, (IOCTL_BT_HCICMD | IOCTL_BT_LOGO), ("XXX, 201,254,0\n"));
		// at the following, chnl 1~11 should be contained
		pTriple = (PCHNL_TXPOWER_TRIPLE)&pAssoStrc->Data[len];

		// (1) if any wifi or bt HS connection exists
		if ((pBTInfo->BtAsocEntry[EntryNum].AMPRole == AMP_BTAP_CREATOR) ||
#if 0
			pMgntInfo->mAssoc ||
			pMgntInfo->mIbss ||
			IsExtAPModeExist(padapter)) ||
#else
			(check_fwstate(&padapter->mlmepriv, WIFI_ASOC_STATE|WIFI_ADHOC_STATE|WIFI_ADHOC_MASTER_STATE|WIFI_AP_STATE) == _TRUE) ||
#endif
			BTHCI_HsConnectionEstablished(padapter))
		{
			pTriple->FirstChnl = preferredChnl;
			pTriple->NumChnls = 1;
			pTriple->MaxTxPowerInDbm = 20;
			len += 3;
			RTPRINT(FIOCTL, (IOCTL_BT_HCICMD | IOCTL_BT_LOGO), ("First Channel = %d, Channel Num = %d, MaxDbm = %d\n",
				pTriple->FirstChnl,
				pTriple->NumChnls,
				pTriple->MaxTxPowerInDbm));

			//pTriple = (PCHNL_TXPOWER_TRIPLE)((u8*)pTriple + 3);
		}
#if 0
		// If we are responder, we can fill all the channel list.
		if (pBTInfo->BtAsocEntry[EntryNum].AMPRole!=AMP_BTAP_CREATOR)
		{
			//
			// When Wifi connection exists, channel should be choosed to the current one.
			// 1. Infra, connect to an AP
			// 2. IBSS, fixed channel
			//
			if (!pMgntInfo->mAssoc &&
				(padapter->MgntInfo.Regdot11networktype != RT_JOIN_NETWORKTYPE_ADHOC ))
			{
				// (2) group 2, chnl 1~preferred-1
				if (preferredChnl > 1 && preferredChnl<15)
				{
					pTriple->FirstChnl = 1;
					pTriple->NumChnls = preferredChnl-1;
					pTriple->MaxTxPowerInDbm = 20;
					len += 3;
					RTPRINT(FIOCTL, (IOCTL_BT_HCICMD | IOCTL_BT_LOGO), ("First Channel = %d, Channel Num = %d, MaxDbm = %d\n",
						pTriple->FirstChnl,
						pTriple->NumChnls,
						pTriple->MaxTxPowerInDbm));
					pTriple = (PCHNL_TXPOWER_TRIPLE)((u8*)pTriple + 3);

				}
				// (3) group 3, preferred+1~chnl 11
				if (preferredChnl < 11)
				{
					pTriple->FirstChnl = preferredChnl+1;
					pTriple->NumChnls = 11-preferredChnl;
					pTriple->MaxTxPowerInDbm = 20;
					len += 3;
					//pTriple = (PCHNL_TXPOWER_TRIPLE)((u8*)pTriple + 3);

					RTPRINT(FIOCTL, (IOCTL_BT_HCICMD | IOCTL_BT_LOGO), ("First Channel = %d, Channel Num = %d, MaxDbm = %d\n",
						pTriple->FirstChnl,
						pTriple->NumChnls,
						pTriple->MaxTxPowerInDbm));
				}
			}
		}
#endif
	}
	pAssoStrc->Length = (u16)len;
	RTPRINT_DATA(FIOCTL, IOCTL_BT_HCICMD, ("AssocPreferredChannelList : \n"), pAssoStrc, pAssoStrc->Length+3);

	return (pAssoStrc->Length+3);
}

