acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
	if (OCF == HCI_CREATE_PHYSICAL_LINK)
	{
		BTHCI_SM_WITH_INFO(padapter, HCI_STATE_DISCONNECTED, STATE_CMD_CREATE_PHY_LINK, EntryNum);
	}
	else if (OCF == HCI_ACCEPT_PHYSICAL_LINK)
	{
		BTHCI_SM_WITH_INFO(padapter, HCI_STATE_DISCONNECTED, STATE_CMD_ACCEPT_PHY_LINK, EntryNum);
	}

	return status;
}

void
bthci_BuildLogicalLink(
	PADAPTER						padapter,
	PPACKET_IRP_HCICMD_DATA		pHciCmd,
	u16						OCF
	)
{
	HCI_STATUS status = HCI_STATUS_SUCCESS;
//	PMGNT_INFO pMgntInfo = &padapter->MgntInfo;
	PBT30Info	pBTinfo = GET_BT_INFO(padapter);
	PBT_MGNT	pBtMgnt = &pBTinfo->BtMgnt;
	u8	PhyLinkHandle, EntryNum;
	static u16 AssignLogHandle = 1;

	HCI_FLOW_SPEC	TxFlowSpec;
	HCI_FLOW_SPEC	RxFlowSpec;
	u32	MaxSDUSize, ArriveTime, Bandwidth;

	PhyLinkHandle = *((u8*)pHciCmd->Data);

	EntryNum = bthci_GetCurrentEntryNum(padapter, PhyLinkHandle);

	_rtw_memcpy(&TxFlowSpec,
		&pHciCmd->Data[1], sizeof(HCI_FLOW_SPEC));
	_rtw_memcpy(&RxFlowSpec,
		&pHciCmd->Data[17], sizeof(HCI_FLOW_SPEC));

#if 0	//for logo special test case only
		if (i==0)
		{
			bthci_SelectFlowType(padapter,BT_TX_BE_FS,BT_RX_BE_FS,&TxFlowSpec,&RxFlowSpec);
			i=1;
		}
		else if (i==1)
		{
			bthci_SelectFlowType(padapter,BT_TX_GU_FS,BT_RX_GU_FS,&TxFlowSpec,&RxFlowSpec);
			i=0;
		}
#endif

	MaxSDUSize = TxFlowSpec.MaximumSDUSize;
	ArriveTime = TxFlowSpec.SDUInterArrivalTime;

	if (bthci_CheckLogLinkBehavior(padapter, TxFlowSpec)&& bthci_CheckLogLinkBehavior(padapter, RxFlowSpec))
	{
		Bandwidth = BTTOTALBANDWIDTH;
	}
	else if (MaxSDUSize==0xffff && ArriveTime==0xffffffff)
	{
		Bandwidth = BTTOTALBANDWIDTH;
	}
	else
	{
		Bandwidth = MaxSDUSize*8*1000/(ArriveTime+244);
	}

#if 0
	RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("BuildLogicalLink, PhyLinkHandle = 0x%x, MaximumSDUSize = 0x%lx, SDUInterArrivalTime = 0x%lx, Bandwidth=0x%lx\n",
		PhyLinkHandle, MaxSDUSize,ArriveTime, Bandwidth));
#else
	RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("BuildLogicalLink, PhyLinkHandle=0x%x, MaximumSDUSize=0x%x, SDUInterArrivalTime=0x%x, Bandwidth=0x%x\n",
		PhyLinkHandle, MaxSDUSize, ArriveTime, Bandwidth));
#endif

	if (EntryNum == 0xff)
	{
		RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("Invalid Physical Link handle = 0x%x, status=HCI_STATUS_UNKNOW_CONNECT_ID, return\n", PhyLinkHandle));
		status = HCI_STATUS_UNKNOW_CONNECT_ID;

		//When we receive Create/Accept logical link command, we should send command status event first.
		bthci_EventCommandStatus(padapter,
			OGF_LINK_CONTROL_COMMANDS,
			OCF,
			status);
		return;
	}

	if (pBtMgnt->bLogLinkInProgress == _FALSE)
	{
		if (bthci_PhyLinkConnectionInProgress(padapter, PhyLinkHandle))
		{
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("Physical link connection in progress, status=HCI_STATUS_CMD_DISALLOW, return\n"));
			status = HCI_STATUS_CMD_DISALLOW;

			pBtMgnt->bPhyLinkInProgressStartLL = _TRUE;
			//When we receive Create/Accept logical link command, we should send command status event first.
			bthci_EventCommandStatus(padapter,
				OGF_LINK_CONTROL_COMMANDS,
				OCF,
				status);

			return;
		}

		if (Bandwidth > BTTOTALBANDWIDTH)//BTTOTALBANDWIDTH
		{
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("status=HCI_STATUS_QOS_REJECT, Bandwidth=0x%x, return\n", Bandwidth));
			status = HCI_STATUS_QOS_REJECT;

			//When we receive Create/Accept logical link command, we should send command status event first.
			bthci_EventCommandStatus(padapter,
				OGF_LINK_CONTROL_COMMANDS,
				OCF,
				status);
		}
		else
		{
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("status=HCI_STATUS_SUCCESS\n"));
			status = HCI_STATUS_SUCCESS;

			//When we receive Create/Accept logical link command, we should send command status event first.
			bthci_EventCommandStatus(padapter,
				OGF_LINK_CONTROL_COMMANDS,
				OCF,
				status);

#if 0// special logo test case only
			bthci_FakeCommand(padapter, OGF_LINK_CONTROL_COMMANDS, HCI_LOGICAL_LINK_CANCEL);
#endif
		}

		if (pBTinfo->BtAsocEntry[EntryNum].BtCurrentState != HCI_STATE_CONNECTED)
		{
			bthci_EventLogicalLinkComplete(padapter,
				HCI_STATUS_CMD_DISALLOW, 0, 0, 0,EntryNum);
		}
		else
		{
			u8 i, find=0;

			pBtMgnt->bLogLinkInProgress = _TRUE;

			// find an unused logical link index and copy the data
			for (i=0; i<MAX_LOGICAL_LINK_NUM; i++)
			{
				if (pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[i].BtLogLinkhandle == 0)
				{
					HCI_STATUS LogCompEventstatus = HCI_STATUS_SUCCESS;

					pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[i].BtPhyLinkhandle = *((u8*)pHciCmd->Data);
					pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[i].BtLogLinkhandle = AssignLogHandle;
					RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("BuildLogicalLink, EntryNum = %d, physical link handle = 0x%x, logical link handle = 0x%x\n",
						EntryNum, pBTinfo->BtAsocEntry[EntryNum].PhyLinkCmdData.BtPhyLinkhandle,
								  pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[i].BtLogLinkhandle));
					_rtw_memcpy(&pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[i].Tx_Flow_Spec,
						&TxFlowSpec, sizeof(HCI_FLOW_SPEC));
					_rtw_memcpy(&pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[i].Rx_Flow_Spec,
						&RxFlowSpec, sizeof(HCI_FLOW_SPEC));

					pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[i].bLLCompleteEventIsSet=_FALSE;

					if (pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[i].bLLCancelCMDIsSetandComplete)
					{
						LogCompEventstatus = HCI_STATUS_UNKNOW_CONNECT_ID;
					}
					bthci_EventLogicalLinkComplete(padapter,
						LogCompEventstatus,
						pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[i].BtPhyLinkhandle,
						pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[i].BtLogLinkhandle, i,EntryNum);

					pBTinfo->BtAsocEntry[EntryNum].LogLinkCmdData[i].bLLCompleteEventIsSet = _TRUE;

					find = 1;
					pBtMgnt->BtCurrentLogLinkhandle = AssignLogHandle;
					AssignLogHandle++;
					break;
				}
			}

			if (!find)
			{
				bthci_EventLogicalLinkComplete(padapter,
					HCI_STATUS_CONNECT_RJT_LIMIT_RESOURCE, 0, 0, 0,EntryNum);
			}
			pBtMgnt->bLogLinkInProgress = _FALSE;
		}
	}
	else
	{
		bthci_EventLogicalLinkComplete(padapter,
			HCI_STATUS_CONTROLLER_BUSY, 0, 0, 0,EntryNum);
	}

#if 0// special logo test case only
	bthci_FakeCommand(padapter, OGF_LINK_CONTROL_COMMANDS, HCI_LOGICAL_LINK_CANCEL);
#endif
}

void
bthci_StartBeaconAndConnect(
	PADAPTER 	padapter,
	PPACKET_IRP_HCICMD_DATA		pHciCmd,
	u8		CurrentAssocNum
	)
{
//	PMGNT_INFO pMgntInfo = &padapter->MgntInfo;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

	RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("StartBeaconAndConnect, CurrentAssocNum=%d, AMPRole=%d\n",
		CurrentAssocNum,
		pBTInfo->BtAsocEntry[CurrentAssocNum].AMPRole));

	if (pBtMgnt->CheckChnlIsSuit == _FALSE)
	{
		bthci_EventPhysicalLinkComplete(padapter, HCI_STATUS_CONNECT_REJ_NOT_SUIT_CHNL_FOUND, CurrentAssocNum, INVALID_PL_HANDLE);
		bthci_RemoveEntryByEntryNum(padapter, CurrentAssocNum);
		return;
	}

	{
		if (pBTInfo->BtAsocEntry[CurrentAssocNum].AMPRole == AMP_BTAP_CREATOR)
		{
			rsprintf((char*)pBTInfo->BtAsocEntry[CurrentAssocNum].BTSsidBuf,32,"AMP-%02x-%02x-%02x-%02x-%02x-%02x",
#if 0
			padapter->PermanentAddress[0],
			padapter->PermanentAddress[1],
			padapter->PermanentAddress[2],
			padapter->PermanentAddress[3],
			padapter->PermanentAddress[4],
			padapter->PermanentAddress[5]);
#else
			padapter->eeprompriv.mac_addr[0],
			padapter->eeprompriv.mac_addr[1],
			padapter->eeprompriv.mac_addr[2],
			padapter->eeprompriv.mac_addr[3],
			padapter->eeprompriv.mac_addr[4],
			padapter->eeprompriv.mac_addr[5]);
#endif
		}
		else if (pBTInfo->BtAsocEntry[CurrentAssocNum].AMPRole == AMP_BTAP_JOINER)
		{
			rsprintf((char*)pBTInfo->BtAsocEntry[CurrentAssocNum].BTSsidBuf,32,"AMP-%02x-%02x-%02x-%02x-%02x-%02x",
			pBTInfo->BtAsocEntry[CurrentAssocNum].BTRemoteMACAddr[0],
			pBTInfo->BtAsocEntry[CurrentAssocNum].BTRemoteMACAddr[1],
			pBTInfo->BtAsocEntry[CurrentAssocNum].BTRemoteMACAddr[2],
			pBTInfo->BtAsocEntry[CurrentAssocNum].BTRemoteMACAddr[3],
			pBTInfo->BtAsocEntry[CurrentAssocNum].BTRemoteMACAddr[4],
			pBTInfo->BtAsocEntry[CurrentAssocNum].BTRemoteMACAddr[5]);
		}

		FillOctetString(pBTInfo->BtAsocEntry[CurrentAssocNum].BTSsid, pBTInfo->BtAsocEntry[CurrentAssocNum].BTSsidBuf, 21);
		pBTInfo->BtAsocEntry[CurrentAssocNum].BTSsid.Length = 21;

		//To avoid set the start ap or connect twice, or the original connection will be disconnected.
		if (!pBtMgnt->bBTConnectInProgress)
		{
			pBtMgnt->bBTConnectInProgress=_TRUE;
			RTPRINT(FIOCTL, IOCTL_STATE, ("[BT Flag], BT Connect in progress ON!!\n"));
			BTHCI_SM_WITH_INFO(padapter,HCI_STATE_STARTING,STATE_CMD_MAC_START_COMPLETE,CurrentAssocNum);

#if 0	//for logo special test case only
			bthci_BuildLogicalLink(padapter, pHciCmd, HCI_CREATE_LOGICAL_LINK);
#endif

			// 20100325 Joseph: Check RF ON/OFF.
			// If RF OFF, it reschedule connecting operation after 50ms.
			if (!bthci_CheckRfStateBeforeConnect(padapter))
				return;

			if (pBTInfo->BtAsocEntry[CurrentAssocNum].AMPRole == AMP_BTAP_CREATOR)
			{
//				BTPKT_StartBeacon(padapter, CurrentAssocNum); // not implement yet
				BTHCI_SM_WITH_INFO(padapter,HCI_STATE_CONNECTING,STATE_CMD_MAC_CONNECT_COMPLETE,CurrentAssocNum);
			}
			else if (pBTInfo->BtAsocEntry[CurrentAssocNum].AMPRole == AMP_BTAP_JOINER)
			{
				bthci_ResponderStartToScan(padapter);
 			}
		}
		RT_PRINT_STR(_module_rtl871x_mlme_c_, _drv_notice_, "StartBeaconAndConnect, SSID:\n", pBTInfo->BtAsocEntry[pBtMgnt->CurrentConnectEntryNum].BTSsid.Octet, pBTInfo->BtAsocEntry[pBtMgnt->CurrentConnectEntryNum].BTSsid.Length);
	}
}

void bthci_ResetBtMgnt(PBT_MGNT pBtMgnt)
{
	pBtMgnt->BtOperationOn = _FALSE;
	pBtMgnt->bBTConnectInProgress = _FALSE;
	pBtMgnt->bLogLinkInProgress = _FALSE;
	pBtMgnt->bPhyLinkInProgress = _FALSE;
	pBtMgnt->bPhyLinkInProgressStartLL = _FALSE;
	pBtMgnt->DisconnectEntryNum = 0xff;
	pBtMgnt->bStartSendSupervisionPkt = _FALSE;
	pBtMgnt->JoinerNeedSendAuth = _FALSE;
	pBtMgnt->CurrentBTConnectionCnt = 0;
	pBtMgnt->BTCurrentConnectType = BT_DISCONNECT;
	pBtMgnt->BTReceiveConnectPkt = BT_DISCONNECT;
	pBtMgnt->BTAuthCount = 0;
	pBtMgnt->btLogoTest = 0;
}

