acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
		bthci_IndicateEvent(padapter, PPacketIrpEvent, len+2);
	}

	return status;
}

HCI_STATUS
bthci_CmdWIFIConnectionStatus(
	PADAPTER 	padapter,
	PPACKET_IRP_HCICMD_DATA		pHciCmd
	)
{
	HCI_STATUS status = HCI_STATUS_SUCCESS;
//	PMGNT_INFO pMgntInfo = &padapter->MgntInfo;
	PADAPTER pDefaultAdapter = GetDefaultAdapter(padapter);
//	PADAPTER pExtAdapter = NULL;
//	PMGNT_INFO pExtMgntInfo = NULL;
	u8		connectStatus = HCI_WIFI_NOT_CONNECTED;

#if 0
	// Default port, connect to any
	if (pMgntInfo->bMediaConnect)
		connectStatus = HCI_WIFI_CONNECTED;
	if (pMgntInfo->mIbss)
		connectStatus = HCI_WIFI_CONNECTED;

	// AP mode, if any station associated
	if (padapter->MgntInfo.NdisVersion >= RT_NDIS_VERSION_6_20)
	{
		if (IsAPModeExist(padapter))
		{
			pExtAdapter = GetFirstExtAdapter(padapter);
			if (pExtAdapter == NULL) pExtAdapter = pDefaultAdapter;

			pExtMgntInfo = &pExtAdapter->MgntInfo;
			if (AsocEntry_AnyStationAssociated(pExtMgntInfo))
				connectStatus = HCI_WIFI_CONNECTED;
		}
		else
		{
			if (AsocEntry_AnyStationAssociated(pMgntInfo))
				connectStatus = HCI_WIFI_CONNECTED;
		}
	}
	else
	{
		if (AsocEntry_AnyStationAssociated(pMgntInfo))
			connectStatus = HCI_WIFI_CONNECTED;
	}

	if (connectStatus == HCI_WIFI_NOT_CONNECTED)
	{
		if (!MgntRoamingInProgress(pMgntInfo) &&
			!MgntIsLinkInProgress(pMgntInfo) &&
			!MgntScanInProgress(pMgntInfo))
		{
			connectStatus = HCI_WIFI_CONNECT_IN_PROGRESS;
		}
	}
#else
	if (check_fwstate(&padapter->mlmepriv, WIFI_AP_STATE) == _TRUE) {
		if (padapter->stapriv.asoc_sta_count >= 3)
			connectStatus = HCI_WIFI_CONNECTED;
		else
			connectStatus = HCI_WIFI_NOT_CONNECTED;
	}
	else if (check_fwstate(&padapter->mlmepriv, WIFI_ADHOC_STATE|WIFI_ADHOC_MASTER_STATE|WIFI_ASOC_STATE) == _TRUE)
		connectStatus = HCI_WIFI_CONNECTED;
	else if (check_fwstate(&padapter->mlmepriv, WIFI_UNDER_LINKING) == _TRUE)
		connectStatus = HCI_WIFI_CONNECT_IN_PROGRESS;
	else
		connectStatus = HCI_WIFI_NOT_CONNECTED;
#endif

	{
		u8 localBuf[8] = "";
		u8 *pRetPar;
		u8 len = 0;
		PPACKET_IRP_HCIEVENT_DATA PPacketIrpEvent;

		PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(&localBuf[0]);

		len += bthci_CommandCompleteHeader(&localBuf[0],
			OGF_EXTENSION,
			HCI_WIFI_CONNECTION_STATUS,
			status);

		// Return parameters starts from here
		pRetPar = &PPacketIrpEvent->Data[len];
		pRetPar[0] = status;			//status
		pRetPar[1] = connectStatus;	//connect status
		len += 2;
		PPacketIrpEvent->Length = len;

		bthci_IndicateEvent(padapter, PPacketIrpEvent, len+2);
	}

	return status;
}

HCI_STATUS
bthci_CmdEnableDeviceUnderTestMode(
	PADAPTER 	padapter,
	PPACKET_IRP_HCICMD_DATA		pHciCmd
	)
{
	HCI_STATUS status = HCI_STATUS_SUCCESS;
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_HCI_INFO		pBtHciInfo = &pBTInfo->BtHciInfo;

	pBtHciInfo->bInTestMode = _TRUE;
	pBtHciInfo->bTestIsEnd = _FALSE;

	//send command complete event here when all data are received.
	{
		u8 localBuf[6] = "";
		u8 *pRetPar;
		u8 len = 0;
		PPACKET_IRP_HCIEVENT_DATA PPacketIrpEvent;

		PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(&localBuf[0]);

		len += bthci_CommandCompleteHeader(&localBuf[0],
			OGF_TESTING_COMMANDS,
			HCI_ENABLE_DEVICE_UNDER_TEST_MODE,
			status);

		// Return parameters starts from here
		pRetPar = &PPacketIrpEvent->Data[len];
		pRetPar[0] = status;		//status
		len += 1;
		PPacketIrpEvent->Length = len;

		bthci_IndicateEvent(padapter, PPacketIrpEvent, len+2);
	}

	return status;
}

HCI_STATUS
bthci_CmdAMPTestEnd(
	PADAPTER 	padapter,
	PPACKET_IRP_HCICMD_DATA		pHciCmd
	)
{
	HCI_STATUS status = HCI_STATUS_SUCCESS;
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_HCI_INFO		pBtHciInfo = &pBTInfo->BtHciInfo;
	u8		bFilterOutNonAssociatedBSSID = _TRUE;

	if (!pBtHciInfo->bInTestMode)
	{
		RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Not in Test mode, return status=HCI_STATUS_CMD_DISALLOW\n"));
		status = HCI_STATUS_CMD_DISALLOW;
		return status;
	}

	pBtHciInfo->bTestIsEnd=_TRUE;

	PlatformCancelTimer(padapter,&pBTInfo->BTTestSendPacketTimer);

	rtw_hal_set_hwreg(padapter, HW_VAR_CHECK_BSSID, (u8*)(&bFilterOutNonAssociatedBSSID));


	//send command complete event here when all data are received.
	{
		u8	localBuf[4] = "";
		PPACKET_IRP_HCIEVENT_DATA PPacketIrpEvent;

		RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("AMP Test End Event \n"));
		PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(&localBuf[0]);
		PPacketIrpEvent->EventCode=HCI_EVENT_AMP_TEST_END;
		PPacketIrpEvent->Length=2;

		PPacketIrpEvent->Data[0] = status;
		PPacketIrpEvent->Data[1] = pBtHciInfo->TestScenario;

		bthci_IndicateEvent(padapter, PPacketIrpEvent, 4);
	}

	bthci_EventAMPReceiverReport(padapter,0x01);

	return status;
}

HCI_STATUS
bthci_CmdAMPTestCommand(
	PADAPTER 	padapter,
	PPACKET_IRP_HCICMD_DATA		pHciCmd
	)
{
	HCI_STATUS status = HCI_STATUS_SUCCESS;
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_HCI_INFO		pBtHciInfo = &pBTInfo->BtHciInfo;

	if (!pBtHciInfo->bInTestMode)
	{
		RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Not in Test mode, return status=HCI_STATUS_CMD_DISALLOW\n"));
		status = HCI_STATUS_CMD_DISALLOW;
		return status;
	}


	pBtHciInfo->TestScenario=*((u8*)pHciCmd->Data);

	if (pBtHciInfo->TestScenario == 0x01)
	{
		RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("TX Single Test \n"));
	}
	else if (pBtHciInfo->TestScenario == 0x02)
	{
		RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Receive Frame Test \n"));
	}
	else
	{
		RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("No Such Test !!!!!!!!!!!!!!!!!! \n"));
	}


	if (pBtHciInfo->bTestIsEnd)
	{
		u8	localBuf[5] = "";
		PPACKET_IRP_HCIEVENT_DATA PPacketIrpEvent;


		RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("AMP Test End Event \n"));
		PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)(&localBuf[0]);
		PPacketIrpEvent->EventCode=HCI_EVENT_AMP_TEST_END;
		PPacketIrpEvent->Length=2;

		PPacketIrpEvent->Data[0] = status;
		PPacketIrpEvent->Data[1] = pBtHciInfo->TestScenario ;

		bthci_IndicateEvent(padapter, PPacketIrpEvent, 4);

		//Return to Idel state with RX and TX off.

