acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
			if (pBtMgnt->bBTConnectInProgress)
			{
				bthci_EventPhysicalLinkComplete(padapter, HCI_STATUS_CONTROLLER_BUSY, INVALID_ENTRY_NUM, pBtMgnt->BtCurrentPhyLinkhandle);
				bthci_RemoveEntryByEntryNum(padapter, EntryNum);
				return;
			}

			if (StateCmd == STATE_CMD_CREATE_PHY_LINK)
			{
				pBTInfo->BtAsocEntry[EntryNum].AMPRole = AMP_BTAP_CREATOR;
			}
			else
			{
				pBTInfo->BtAsocEntry[EntryNum].AMPRole = AMP_BTAP_JOINER;
			}

			// 1. MAC not yet in selected channel
#if 0
			while ((MgntRoamingInProgress(pMgntInfo)) ||
				(MgntIsLinkInProgress(pMgntInfo))||
				(MgntScanInProgress(pMgntInfo)))
#else
			while (check_fwstate(&padapter->mlmepriv, WIFI_ASOC_STATE|WIFI_SITE_MONITOR) == _TRUE)
#endif
			{
				RTPRINT(FIOCTL, IOCTL_STATE, ("Scan/Roaming/Wifi Link is in Progress, wait 200 ms\n"));
				rtw_mdelay_os(200);
			}
			// 2. MAC already in selected channel
			{
				RTPRINT(FIOCTL, IOCTL_STATE, ("Channel is Ready\n"));
				PlatformSetTimer(padapter, &pBTInfo->BTHCIJoinTimeoutTimer, pBtHciInfo->ConnAcceptTimeout);

				pBTInfo->BtAsocEntry[EntryNum].bNeedPhysLinkCompleteEvent = _TRUE;
			}
			break;
		}

		case STATE_CMD_DISCONNECT_PHY_LINK:
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_DISCONNECT_PHY_LINK\n"));

			PlatformCancelTimer(padapter,&pBTInfo->BTHCIJoinTimeoutTimer);

			bthci_EventDisconnectPhyLinkComplete(padapter,
			HCI_STATUS_SUCCESS,
			pBTInfo->BtAsocEntry[EntryNum].PhyLinkDisconnectReason,
			EntryNum);

			if (pBTInfo->BtAsocEntry[EntryNum].bNeedPhysLinkCompleteEvent)
			{
				bthci_EventPhysicalLinkComplete(padapter,
					HCI_STATUS_UNKNOW_CONNECT_ID,
					EntryNum, INVALID_PL_HANDLE);
			}

			if (pBtMgnt->bBTConnectInProgress)
			{
				pBtMgnt->bBTConnectInProgress = _FALSE;
				RTPRINT(FIOCTL, IOCTL_STATE, ("[BT Flag], BT Connect in progress OFF!!\n"));
			}
			BTHCI_SM_WITH_INFO(padapter, HCI_STATE_DISCONNECTED, STATE_CMD_ENTER_STATE, EntryNum);
			bthci_RemoveEntryByEntryNum(padapter,EntryNum);
			break;
		}

		case STATE_CMD_ENTER_STATE:
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_ENTER_STATE\n"));
			break;
		}

		default:
			RTPRINT(FIOCTL, IOCTL_STATE, ("State command(%d) is Wrong !!!\n", StateCmd));
			break;
	}
}

void
bthci_UseFakeData(
	PADAPTER 	padapter,
	PPACKET_IRP_HCICMD_DATA		pHciCmd
	)
{
	if (pHciCmd->OGF == OGF_LINK_CONTROL_COMMANDS && pHciCmd->OCF == HCI_CREATE_LOGICAL_LINK)
	{
		PHCI_FLOW_SPEC	pTxFlowSpec = (PHCI_FLOW_SPEC)&pHciCmd->Data[1];
		PHCI_FLOW_SPEC	pRxFlowSpec = (PHCI_FLOW_SPEC)&pHciCmd->Data[17];
		bthci_SelectFlowType(padapter, BT_TX_BE_FS, BT_RX_BE_FS, pTxFlowSpec, pRxFlowSpec);
		//bthci_SelectFlowType(padapter, BT_TX_be_FS, BT_RX_GU_FS, pTxFlowSpec, pRxFlowSpec);
	}
	else if (pHciCmd->OGF == OGF_LINK_CONTROL_COMMANDS && pHciCmd->OCF == HCI_FLOW_SPEC_MODIFY)
	{
		PHCI_FLOW_SPEC	pTxFlowSpec = (PHCI_FLOW_SPEC)&pHciCmd->Data[2];
		PHCI_FLOW_SPEC	pRxFlowSpec = (PHCI_FLOW_SPEC)&pHciCmd->Data[18];
		//bthci_SelectFlowType(padapter, BT_TX_BE_FS, BT_RX_BE_FS, pTxFlowSpec, pRxFlowSpec);
		bthci_SelectFlowType(padapter, BT_TX_BE_AGG_FS, BT_RX_BE_AGG_FS, pTxFlowSpec, pRxFlowSpec);
	}
}

void bthci_TimerCallbackHCICmd(PRT_TIMER pTimer)
{
#if (BT_THREAD == 0)
//	PADAPTER		padapter = (PADAPTER)pTimer->padapter;
	PADAPTER		padapter = (PADAPTER)pTimer;
	PBT30Info		pBTinfo = GET_BT_INFO(padapter);

	RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("bthci_TimerCallbackHCICmd() ==>\n"));

	PlatformScheduleWorkItem(&pBTinfo->HCICmdWorkItem);

	RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("bthci_TimerCallbackHCICmd() <==\n"));
#endif
}

void bthci_TimerCallbackSendAclData(PRT_TIMER pTimer)
{
#if (SENDTXMEHTOD == 0)
//	PADAPTER		padapter = (PADAPTER)pTimer->padapter;
	PADAPTER		padapter = (PADAPTER)pTimer;
	PBT30Info		pBTinfo = GET_BT_INFO(padapter);

	RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("HCIAclDataTimerCallback() ==>\n"));
	if (padapter->bDriverIsGoingToUnload)
	{
		return;
	}
	PlatformScheduleWorkItem(&pBTinfo->HCISendACLDataWorkItem);
	RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("HCIAclDataTimerCallback() <==\n"));
#endif
}

void bthci_TimerCallbackDiscardAclData(PRT_TIMER pTimer)
{
//	PADAPTER		padapter = (PADAPTER)pTimer->padapter;
	PADAPTER		padapter = (PADAPTER)pTimer;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_HCI_INFO		pBtHciInfo = &pBTInfo->BtHciInfo;

	RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("bthci_TimerCallbackDiscardAclData() ==>\n"));

	RTPRINT(FIOCTL, (IOCTL_CALLBACK_FUN|IOCTL_BT_LOGO), ("Flush Timeout ==>\n"));
	if (bthci_DiscardTxPackets(padapter, pBtHciInfo->FLTO_LLH))
	{
		bthci_EventFlushOccurred(padapter, pBtHciInfo->FLTO_LLH);
	}
	RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("bthci_TimerCallbackDiscardAclData() <==\n"));
}

void bthci_TimerCallbackPsDisable(PRT_TIMER pTimer)
{
//	PADAPTER		padapter = (PADAPTER)pTimer->padapter;
	PADAPTER		padapter = (PADAPTER)pTimer;
	PBT30Info		pBTinfo = GET_BT_INFO(padapter);

	RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("bthci_TimerCallbackPsDisable() ==>\n"));

	PlatformScheduleWorkItem(&(pBTinfo->BTPsDisableWorkItem));

	RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("bthci_TimerCallbackPsDisable() <==\n"));
}

void bthci_TimerCallbackJoinTimeout(PRT_TIMER pTimer)
{
//	PADAPTER		padapter = (PADAPTER)pTimer->padapter;
	PADAPTER		padapter = (PADAPTER)pTimer;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	u8			CurrentEntry = pBtMgnt->CurrentConnectEntryNum;

	RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("bthci_TimerCallbackJoinTimeout() ==> Current State %x\n",pBTInfo->BtAsocEntry[CurrentEntry].BtCurrentState));

	if (pBTInfo->BtAsocEntry[CurrentEntry].BtCurrentState == HCI_STATE_STARTING)
	{
		bthci_StateStarting(padapter, STATE_CMD_CONNECT_ACCEPT_TIMEOUT,CurrentEntry);
	}
	else if (pBTInfo->BtAsocEntry[CurrentEntry].BtCurrentState == HCI_STATE_CONNECTING)
	{
		bthci_StateConnecting(padapter, STATE_CMD_CONNECT_ACCEPT_TIMEOUT,CurrentEntry);
	}
	else if (pBTInfo->BtAsocEntry[CurrentEntry].BtCurrentState == HCI_STATE_AUTHENTICATING)
	{
		bthci_StateAuth(padapter, STATE_CMD_CONNECT_ACCEPT_TIMEOUT,CurrentEntry);
	}
	else
	{
		RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("bthci_TimerCallbackJoinTimeout() <== No Such state!!!\n"));
	}

