acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
	RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("bthci_TimerCallbackJoinTimeout() <==\n"));
}

void bthci_TimerCallbackSendTestPacket(PRT_TIMER pTimer)
{
//	PADAPTER		padapter = (PADAPTER)pTimer->padapter;
	PADAPTER		padapter = (PADAPTER)pTimer;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_HCI_INFO		pBtHciInfo = &pBTInfo->BtHciInfo;

	RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("bthci_TimerCallbackSendTestPacket() \n"));
	if (pBtHciInfo->bTestIsEnd || !pBtHciInfo->bInTestMode)
	{
		RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("bthci_TimerCallbackSendTestPacket() <==bTestIsEnd\n"));
		return;
	}

//	BTPKT_SendTestPacket(padapter); // not porting yet
	PlatformSetTimer(padapter, &pBTInfo->BTTestSendPacketTimer, 50);
	RTPRINT(FIOCTL, IOCTL_CALLBACK_FUN, ("bthci_TimerCallbackSendTestPacket() <==\n"));
}

void bthci_TimerCallbackBTSupervisionPacket(PRT_TIMER pTimer)
{
#if 0 // not porting yet
//	PADAPTER		padapter = (PADAPTER)pTimer->padapter;
	PADAPTER		padapter = (PADAPTER)pTimer;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	u8			i;
	u8			isQosdata = _TRUE;
	int				EntryTimer=5000;
	u32			EntryTOCnt = 0;
	int				callBackTimer=1000;


	if (pBTInfo->BTBeaconTmrOn)
	{
		RTPRINT(FIOCTL, IOCTL_STATE, ("[BT] stop beacon timer\n"));
		pBTInfo->BTBeaconTmrOn = _FALSE;
		PlatformCancelTimer(padapter, &(pBTInfo->BTBeaconTimer));
	}

	for (i=0; i<MAX_BT_ASOC_ENTRY_NUM; i++)
	{
		if (pBTInfo->BtAsocEntry[i].b4waySuccess)
		{
			if (pBTInfo->BtAsocEntry[i].NoRxPktCnt)
			{
				RTPRINT(FIOCTL, IOCTL_STATE, ("BtAsocEntry[%d].NoRxPktCnt = %ld\n", i, pBTInfo->BtAsocEntry[i].NoRxPktCnt));
			}
			EntryTimer = ((pBTInfo->BtAsocEntry[i].PhyLinkCmdData.LinkSuperversionTimeout*625)/1000);
			EntryTOCnt = (EntryTimer/callBackTimer);
			{
				if (pBtMgnt->bStartSendSupervisionPkt)
				{
					if (pBTInfo->BtAsocEntry[i].BtCurrentState == HCI_STATE_CONNECTED)
					{

						if (pBTInfo->BtAsocEntry[i].NoRxPktCnt >= 4)	// start to send supervision packet
						{
							isQosdata = _FALSE;
							if (pBTInfo->BtAsocEntry[i].AMPRole == AMP_BTAP_JOINER)
							{
								if (pBtMgnt->bssDesc.BssQos.bdQoSMode > QOS_DISABLE)
									isQosdata = _TRUE;
							}
							else if (pBTInfo->BtAsocEntry[i].AMPRole == AMP_BTAP_CREATOR)
							{
								if (pBTInfo->BtAsocEntry[i].bPeerQosSta)
									isQosdata = _TRUE;
							}
							BTPKT_SendLinkSupervisionPacket(padapter, _TRUE, i, isQosdata);
						}

						if (pBTInfo->BtAsocEntry[i].bSendSupervisionPacket)
						{
							if (pBTInfo->BtAsocEntry[i].NoRxPktCnt >= EntryTOCnt)
							{
								pBTInfo->BtAsocEntry[i].PhyLinkDisconnectReason=HCI_STATUS_CONNECT_TIMEOUT;
									RTPRINT(FIOCTL, (IOCTL_STATE|IOCTL_BT_LOGO), ("No Link supervision Packet received within %d Sec !!!!\n",(EntryTimer/1000)));
									RTPRINT(FIOCTL, IOCTL_STATE, ("[BT AMPStatus], set to invalid in bthci_TimerCallbackBTSupervisionPacket()\n"));
									BTHCI_EventAMPStatusChange(padapter, AMP_STATUS_NO_CAPACITY_FOR_BT);
							}
						}
						else
						{
							pBTInfo->BtAsocEntry[i].bSendSupervisionPacket = _TRUE;
						}
					}
				}
			}
			pBTInfo->BtAsocEntry[i].NoRxPktCnt++;
		}
	}

	PlatformSetTimer(padapter, &pBTInfo->BTSupervisionPktTimer, callBackTimer);
#endif
}

void bthci_TimerCallbackBTAuthTimeout(PRT_TIMER pTimer)
{
#if 0 // not porting yet
//	PADAPTER		padapter = (PADAPTER)pTimer->padapter;
	PADAPTER		padapter = (PADAPTER)pTimer;
//	PMGNT_INFO pMgntInfo = &padapter->MgntInfo;
	PBT30Info	pBtInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBtInfo->BtMgnt;
	u8	arSeq, arAlg, AuthStatusCode;
	OCTET_STRING	OurCText;
	u8	arChalng[128];

	switch (pBtMgnt->BTCurrentConnectType)
	{
		case BT_CONNECT_AUTH_REQ:
		{
			RTPRINT(FIOCTL, (IOCTL_STATE|IOCTL_BT_LOGO), ("bthci_TimerCallbackBTAuthTimeout==> BT_CONNECT_AUTH_REQ\n"));
			if (pBtMgnt->BTReceiveConnectPkt! = BT_CONNECT_AUTH_RSP)
			{
				if (pBtMgnt->BTAuthCount < BTMaxAuthCount)
				{
					FillOctetString(OurCText, pMgntInfo->arChalng, 0);

					arAlg = OPEN_SYSTEM;
					AuthStatusCode = StatusCode_success;
					arSeq = 1;
					RTPRINT(FIOCTL, (IOCTL_STATE|IOCTL_BT_LOGO), ("bthci_TimerCallbackBTAuthTimeout==> Re Send Auth Req %d\n", pBtMgnt->BTAuthCount));
					BTPKT_SendAuthenticatePacket(
						padapter,
						pBtInfo->BtAsocEntry[pBtMgnt->CurrentConnectEntryNum].BTRemoteMACAddr, // auStaAddr,
						arAlg, // AuthAlg,
						arSeq, // AuthSeq,
						AuthStatusCode, // AuthStatusCode
						OurCText // AuthChallengetext
						);

					pBtMgnt->BTAuthCount++;

					PlatformSetTimer(padapter, &pBtInfo->BTAuthTimeoutTimer, 200);
				}
				else
				{
					RTPRINT(FIOCTL, (IOCTL_STATE|IOCTL_BT_LOGO), ("bthci_TimerCallbackBTAuthTimeout==> Reach  BTMaxAuthCount\n"));
				}
			}

			break;
		}
		case BT_CONNECT_AUTH_RSP:
		{
			RTPRINT(FIOCTL, (IOCTL_STATE|IOCTL_BT_LOGO), ("bthci_TimerCallbackBTAuthTimeout==> BT_CONNECT_AUTH_RSP\n"));
			if (pBtMgnt->BTReceiveConnectPkt != BT_CONNECT_ASOC_REQ)
			{
				if (pBtMgnt->BTAuthCount < BTMaxAuthCount)
				{
					OurCText.Length = 0;
					OurCText.Octet = arChalng;

					arAlg = OPEN_SYSTEM;

					AuthStatusCode = StatusCode_success;
					// Send auth frame.
					BTPKT_SendAuthenticatePacket(
						padapter,
						pBtInfo->BtAsocEntry[pBtMgnt->CurrentConnectEntryNum].BTRemoteMACAddr, // auStaAddr,
						arAlg, // AuthAlg,
						2, // AuthSeq,
						AuthStatusCode, // AuthStatusCode
						OurCText // AuthChallengetext
						);

					pBtMgnt->BTAuthCount++;
				}
				else
				{
					RTPRINT(FIOCTL, (IOCTL_STATE|IOCTL_BT_LOGO), ("bthci_TimerCallbackBTAuthTimeout==> Reach  BTMaxAuthCount\n"));
				}
			}

			break;
		}
		default:
		{
			RTPRINT(FIOCTL, (IOCTL_STATE|IOCTL_BT_LOGO), ("bthci_TimerCallbackBTAuthTimeout==> No Such Connect Type %d  !!!!!!\n", pBtMgnt->BTCurrentConnectType));
			break;
		}
	}
#endif
}

void bthci_TimerCallbackAsocTimeout(PRT_TIMER pTimer)
{
#if 0 // not porting yet
//	PADAPTER		padapter = (PADAPTER)pTimer->padapter;
	PADAPTER		padapter = (PADAPTER)pTimer;
//	PMGNT_INFO pMgntInfo = &padapter->MgntInfo;
	PBT30Info	pBtInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBtInfo->BtMgnt;

	switch (pBtMgnt->BTCurrentConnectType)
	{
		case BT_CONNECT_ASOC_REQ:
		{
			RTPRINT(FIOCTL, (IOCTL_STATE|IOCTL_BT_LOGO), ("bthci_TimerCallbackAsocTimeout==> BT_CONNECT_ASOC_REQ\n"));
			if (pBtMgnt->BTReceiveConnectPkt! = BT_CONNECT_ASOC_RSP)
			{
				if (pBtMgnt->BTAsocCount < BTMaxAsocCount)
				{
					RTPRINT(FIOCTL, (IOCTL_STATE|IOCTL_BT_LOGO), ("bthci_TimerCallbackAsocTimeout==> Re Send Asoc Req %d\n", pBtMgnt->BTAsocCount));
					BTPKT_SendAssociateReq(
						padapter,
						pBtInfo->BtAsocEntry[pBtMgnt->CurrentConnectEntryNum].BTRemoteMACAddr,
						pMgntInfo->mCap,
						ASSOC_REQ_TIMEOUT,
						pBtMgnt->CurrentConnectEntryNum);

					pBtMgnt->BTAsocCount++;

					PlatformSetTimer(padapter, &pBtInfo->BTAsocTimeoutTimer, 200);
				}
				else
				{
					RTPRINT(FIOCTL, (IOCTL_STATE|IOCTL_BT_LOGO), ("bthci_TimerCallbackAsocTimeout==> Reach  BTMaxAuthCount\n"));
				}
			}
			break;
		}
		case BT_CONNECT_ASOC_RSP:
		{
			RTPRINT(FIOCTL, (IOCTL_STATE|IOCTL_BT_LOGO), ("bthci_TimerCallbackAsocTimeout==> BT_CONNECT_ASOC_RSP\n"));
			break;
		}
		default:
		{
			RTPRINT(FIOCTL, (IOCTL_STATE|IOCTL_BT_LOGO), ("bthci_TimerCallbackAsocTimeout==> No Such Connect Type %d  !!!!!!\n", pBtMgnt->BTCurrentConnectType));
			break;
		}
	}
#endif
}

void bthci_TimerCallbackDisconnectPhysicalLink(PRT_TIMER pTimer)
{
//	PADAPTER		padapter = (PADAPTER)pTimer->padapter;
	PADAPTER		padapter = (PADAPTER)pTimer;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

	RT_TRACE(COMP_MLME, DBG_WARNING, ("===>bthci_TimerCallbackDisconnectPhysicalLink\n"));

	if (pBTInfo->BtAsocEntry[pBtMgnt->DisconnectEntryNum].BtCurrentState == HCI_STATE_CONNECTED)
	{
		BTHCI_SM_WITH_INFO(padapter,HCI_STATE_CONNECTED,STATE_CMD_DISCONNECT_PHY_LINK, pBtMgnt->DisconnectEntryNum);
	}

	BTHCI_EventNumOfCompletedDataBlocks(padapter);
	pBtMgnt->DisconnectEntryNum = 0xff;
	RT_TRACE(COMP_MLME, DBG_WARNING, ("<===bthci_TimerCallbackDisconnectPhysicalLink\n"));

