acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
}

u8 bthci_WaitForRfReady(PADAPTER padapter)
{
	u8 bRet = _FALSE;

//	PRT_POWER_SAVE_CONTROL	pPSC = GET_POWER_SAVE_CONTROL(&(padapter->MgntInfo));
	struct pwrctrl_priv *ppwrctrl = &padapter->pwrctrlpriv;
	rt_rf_power_state 			RfState;
	u32						waitcnt = 0;

	while(1)
	{
//		rtw_hal_get_hwreg(padapter, HW_VAR_RF_STATE, (u8*)(&RfState));
		RfState = ppwrctrl->rf_pwrstate;

//		if ((RfState != eRfOn) || (pPSC->bSwRfProcessing))
		if ((RfState != rf_on) || (ppwrctrl->bips_processing))
		{
			rtw_mdelay_os(10);
			if (waitcnt++ >= 200)
			{
//				RT_ASSERT(_FALSE, ("bthci_WaitForRfReady(), wait for RF ON timeout\n"));
				bRet = _FALSE;
				break;
			}
		}
		else
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("bthci_WaitForRfReady(), Rf is on, wait %d times\n", waitcnt));
			bRet = _TRUE;
			break;
		}
	}

	return bRet;
}

void bthci_WorkItemCallbackPsDisable(void *pContext)
{
	PADAPTER		padapter = (PADAPTER)pContext;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	u8			CurrentAssocNum;

	for (CurrentAssocNum=0; CurrentAssocNum<MAX_BT_ASOC_ENTRY_NUM; CurrentAssocNum++)
	{
		if (pBTInfo->BtAsocEntry[CurrentAssocNum].bUsed == _TRUE)
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("WorkItemCallbackPsDisable(): Handle Associate Entry %d\n", CurrentAssocNum));

			if (pBTInfo->BtAsocEntry[CurrentAssocNum].AMPRole == AMP_BTAP_CREATOR)
			{
//				BTPKT_StartBeacon(padapter, CurrentAssocNum); // not porting yet
				BTHCI_SM_WITH_INFO(padapter, HCI_STATE_CONNECTING, STATE_CMD_MAC_CONNECT_COMPLETE, CurrentAssocNum);
			}
			else if (pBTInfo->BtAsocEntry[CurrentAssocNum].AMPRole == AMP_BTAP_JOINER)
			{
				bthci_WaitForRfReady(padapter);
				bthci_ResponderStartToScan(padapter);
			}
		}
	}
}

void bthci_WorkItemCallbackHCICmd(void *pContext)
{
	PlatformProcessHCICommands(pContext);
}

void bthci_WorkItemCallbackSendACLData(void *pContext)
{
#if (SENDTXMEHTOD == 0)
	PADAPTER		padapter = (PADAPTER)pContext;
#if 0 //cosa for special logo test case
	if (acldata_cnt >= 2)
#endif
	PlatformTxBTQueuedPackets(padapter);
#endif
}

void bthci_WorkItemCallbackConnect(void *pContext)
{
	PADAPTER		padapter = (PADAPTER)pContext;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

//	BTPKT_JoinerConnectProcess(padapter, pBtMgnt->CurrentConnectEntryNum); // not porting yet
}

u8 BTHCI_GetConnectEntryNum(PADAPTER padapter)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

	return bthci_GetCurrentEntryNum(padapter, pBtMgnt->BtCurrentPhyLinkhandle);
}

u8 BTHCI_GetCurrentEntryNumByMAC(PADAPTER padapter, u8 *SA)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	u8	i;

	for (i=0; i<MAX_BT_ASOC_ENTRY_NUM; i++)
	{
		if (pBTInfo->BtAsocEntry[i].bUsed == _TRUE)
		{
			if (_rtw_memcmp(pBTInfo->BtAsocEntry[i].BTRemoteMACAddr, SA, 6) == _TRUE)
			{
				return i;
			}
		}
	}
	return 0xFF;
}

void BTHCI_StatusWatchdog(PADAPTER padapter)
{
//	PMGNT_INFO			pMgntInfo = &padapter->MgntInfo;
	struct pwrctrl_priv *ppwrctrl = &padapter->pwrctrlpriv;
	PBT30Info			pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT			pBtMgnt = &pBTInfo->BtMgnt;
	PBT_TRAFFIC			pBtTraffic = &pBTInfo->BtTraffic;
	u8				bRfOff=_FALSE, bTxBusy = _FALSE, bRxBusy = _FALSE;

#if 0	// test only
	u8						testbuf[100]={0};
	PRTK_DBG_CTRL_OIDS			pDbgCtrl;
	PPACKET_IRP_HCICMD_DATA	pHCICMD;
	u32						a,b;
	u16	*					pu2Tmp;

	pDbgCtrl = (PRTK_DBG_CTRL_OIDS)testbuf;
	pDbgCtrl->ctrlType = 0;
	pHCICMD = (PPACKET_IRP_HCICMD_DATA)&pDbgCtrl->CtrlData;
	pHCICMD->OCF = OGF_EXTENSION;
	pHCICMD->OGF = HCI_LINK_STATUS_NOTIFY;
	pHCICMD->Length = 5;
	pHCICMD->Data[0] = 0x1;
	//pu2Tmp =
	*((u16*)&pHCICMD->Data[1]) = 0x0205;
	//*pu2Tmp = 0x0205;
	pHCICMD->Data[3] = 0x3;
	pHCICMD->Data[4] = 0x2;
	pDbgCtrl->ctrlDataLen = pHCICMD->Length+3;
	OIDS_RTKDbgControl(padapter, testbuf, pDbgCtrl->ctrlDataLen+4, &a, &b);
#endif

#if 0
	if ((pMgntInfo->RfOffReason & RF_CHANGE_BY_HW) ||
		(pMgntInfo->RfOffReason & RF_CHANGE_BY_SW))
#else
	if ((ppwrctrl->rfoff_reason & RF_CHANGE_BY_HW) ||
		(ppwrctrl->rfoff_reason & RF_CHANGE_BY_SW))
#endif
		bRfOff = _TRUE;

#if 0
	if (!MgntRoamingInProgress(pMgntInfo) &&
		!MgntIsLinkInProgress(pMgntInfo) &&
		!MgntScanInProgress(pMgntInfo) &&
#else
	if ((check_fwstate(&padapter->mlmepriv, WIFI_REASOC_STATE|WIFI_UNDER_LINKING|WIFI_SITE_MONITOR) == _FALSE) &&
#endif
		!bRfOff)
	{
		static u8 BTwaitcnt=0;
		if (pBtMgnt->BTNeedAMPStatusChg)
		{
			BTwaitcnt++;
			if (BTwaitcnt >= 2)
			{
				BTHCI_EventAMPStatusChange(padapter, AMP_STATUS_FULL_CAPACITY_FOR_BT);
				BTwaitcnt = 0;
			}
		}
	}

	RTPRINT(FIOCTL, IOCTL_BT_TP, ("[BT traffic], TxPktCntInPeriod=%d, TxPktLenInPeriod=%"i64fmt"d\n",
		pBtTraffic->Bt30TrafficStatistics.TxPktCntInPeriod,
		pBtTraffic->Bt30TrafficStatistics.TxPktLenInPeriod));
	RTPRINT(FIOCTL, IOCTL_BT_TP, ("[BT traffic], RxPktCntInPeriod=%d, RxPktLenInPeriod=%"i64fmt"d\n",
		pBtTraffic->Bt30TrafficStatistics.RxPktCntInPeriod,
		pBtTraffic->Bt30TrafficStatistics.RxPktLenInPeriod));
	if (pBtTraffic->Bt30TrafficStatistics.TxPktCntInPeriod > 100 ||
		pBtTraffic->Bt30TrafficStatistics.RxPktCntInPeriod > 100 )
	{
		if (pBtTraffic->Bt30TrafficStatistics.RxPktLenInPeriod > pBtTraffic->Bt30TrafficStatistics.TxPktLenInPeriod)
			bRxBusy = _TRUE;
		else if (pBtTraffic->Bt30TrafficStatistics.TxPktLenInPeriod > pBtTraffic->Bt30TrafficStatistics.RxPktLenInPeriod)
			bTxBusy = _TRUE;
	}

	pBtTraffic->Bt30TrafficStatistics.TxPktCntInPeriod = 0;
	pBtTraffic->Bt30TrafficStatistics.RxPktCntInPeriod = 0;
	pBtTraffic->Bt30TrafficStatistics.TxPktLenInPeriod = 0;
	pBtTraffic->Bt30TrafficStatistics.RxPktLenInPeriod = 0;
	pBtTraffic->Bt30TrafficStatistics.bTxBusyTraffic = bTxBusy;
	pBtTraffic->Bt30TrafficStatistics.bRxBusyTraffic = bRxBusy;
	RTPRINT(FIOCTL, IOCTL_BT_TP, ("[BT traffic], bTxBusyTraffic=%d, bRxBusyTraffic=%d\n",
		pBtTraffic->Bt30TrafficStatistics.bTxBusyTraffic,
		pBtTraffic->Bt30TrafficStatistics.bRxBusyTraffic));
}

void
BTHCI_NotifyRFState(
	PADAPTER				padapter,
	rt_rf_power_state		StateToSet,
	RT_RF_CHANGE_SOURCE	ChangeSource
	)
{
#if 0
	PMGNT_INFO				pMgntInfo = &padapter->MgntInfo;
	RT_RF_CHANGE_SOURCE	RfOffReason = pMgntInfo->RfOffReason;
#else
	struct pwrctrl_priv *ppwrctrl = &padapter->pwrctrlpriv;
	RT_RF_CHANGE_SOURCE	RfOffReason = ppwrctrl->rfoff_reason;
#endif

	RTPRINT(FIOCTL, IOCTL_STATE, ("BTHCI_NotifyRFState(), Old RfOffReason = 0x%x, ChangeSource = 0x%x\n", RfOffReason, ChangeSource));
	if (ChangeSource < RF_CHANGE_BY_HW)
	{
		RTPRINT(FIOCTL, IOCTL_STATE, ("BTHCI_NotifyRFState(), ChangeSource < RF_CHANGE_BY_HW\n"));
		return;
	}

	//
	// When RF is on/off by HW/SW(IPS/LPS not included), we have to notify
	// core stack the AMP_Status
	//

