acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
	// We only have to check RF On/Off by HW/SW
	RfOffReason &= (RF_CHANGE_BY_HW|RF_CHANGE_BY_SW);

	switch (StateToSet)
	{
		case rf_on:
			if (RfOffReason)
			{
				//
				// Previously, HW or SW Rf state is OFF, check if it is turned on by HW/SW
				//
				RfOffReason &= ~ChangeSource;
				if (!RfOffReason)
				{
					// Both HW/SW Rf is turned on
					RTPRINT(FIOCTL, IOCTL_STATE, ("BTHCI_NotifyRFState(), Rf is turned On!\n"));
					BTHCI_EventAMPStatusChange(padapter, AMP_STATUS_FULL_CAPACITY_FOR_BT);
				}
			}
			break;

		case rf_off:
			if (!RfOffReason)
			{
				//
				// Previously, both HW/SW Rf state is ON, check if it is turned off by HW/SW
				//
				RTPRINT(FIOCTL, IOCTL_STATE, ("BTHCI_NotifyRFState(), Rf is turned Off!\n"));
				RTPRINT(FIOCTL, IOCTL_STATE, ("[BT AMPStatus], set to invalid in BTHCI_NotifyRFState()\n"));
				BTHCI_EventAMPStatusChange(padapter, AMP_STATUS_NO_CAPACITY_FOR_BT);
			}
			break;

		default:
			RTPRINT(FIOCTL, IOCTL_STATE, ("Unknown case!! \n"));
			break;
	}
}

void
BTHCI_IndicateAMPStatus(
	PADAPTER			padapter,
	u8				JoinAction,
	u8				channel
	)
{
//	PMGNT_INFO	pMgntInfo = &(padapter->MgntInfo);
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT	pBtMgnt = &pBTInfo->BtMgnt;
	u8		bNeedIndicate = _FALSE;

	RTPRINT(FIOCTL, IOCTL_STATE, ("JoinAction=%d, bssDesc->bdDsParms.ChannelNumber=%d\n",
		JoinAction, channel));

	switch (JoinAction)
	{
		case RT_JOIN_INFRA:
		case RT_JOIN_IBSS:
			//
			// When join infra or ibss, check if bt channel is the current channel,
			// if not, we need to indicate AMPStatus=2
			//
			if (channel != pBtMgnt->BTChannel)
				bNeedIndicate = _TRUE;
			break;
		case RT_START_IBSS:
			//
			// when start IBSS, we need to indicate AMPStatus=2 to
			// reset be hw security
			//
			bNeedIndicate = _TRUE;
			break;
		case RT_NO_ACTION:
			break;
		default:
			break;
	}

	if (bNeedIndicate)
	{
		RTPRINT(FIOCTL, IOCTL_STATE, ("BTHCI_IndicateAMPStatus(), BT channel=%d, bssDesc->bdDsParms.ChannelNumber=%d\n",
			pBtMgnt->BTChannel, channel));

		if (pBtMgnt->BtOperationOn)
		{
			RTPRINT(FIOCTL, IOCTL_STATE, ("[BT AMPStatus], set to invalid in JoinRequest()\n"));
			BTHCI_EventAMPStatusChange(padapter, AMP_STATUS_NO_CAPACITY_FOR_BT);
		}
	}
}

void
BTHCI_EventParse(
	PADAPTER 					padapter,
	void						*pEvntData,
	u32						dataLen
	)
{
	PPACKET_IRP_HCIEVENT_DATA PPacketIrpEvent = (PPACKET_IRP_HCIEVENT_DATA)pEvntData;
	return;

	RTPRINT(FIOCTL, IOCTL_BT_EVENT, ("BT Event Code = 0x%x\n", PPacketIrpEvent->EventCode));
	RTPRINT(FIOCTL, IOCTL_BT_EVENT, ("BT Event Length = 0x%x\n", PPacketIrpEvent->Length));

	switch (PPacketIrpEvent->EventCode)
	{
		case HCI_EVENT_COMMAND_COMPLETE:
			RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("HCI_EVENT_COMMAND_COMPLETE\n"));
			break;
		case HCI_EVENT_COMMAND_STATUS:
			RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("HCI_EVENT_COMMAND_STATUS\n"));
			break;
		default:
			break;
	}
}

u16
BTHCI_GetPhysicalLinkHandle(
	PADAPTER	padapter,
	u8		EntryNum
	)
{
	PBT30Info		pBTinfo = GET_BT_INFO(padapter);
	u16 handle;

	handle = pBTinfo->BtAsocEntry[EntryNum].AmpAsocCmdData.BtPhyLinkhandle;

	return handle;
}

RT_STATUS
BTHCI_IndicateRxData(
	PADAPTER 					padapter,
	void						*pData,
	u32						dataLen,
	u8						EntryNum
	)
{
	RT_STATUS	rt_status;

	rt_status = PlatformIndicateBTACLData(padapter, pData, dataLen, EntryNum);

	return rt_status;
}

void BTHCI_InitializeAllTimer(PADAPTER padapter)
{
	PBT30Info		pBTinfo = GET_BT_INFO(padapter);
	PBT_SECURITY		pBtSec = &pBTinfo->BtSec;

#if (BT_THREAD == 0)
	PlatformInitializeTimer(padapter, &pBTinfo->BTHCICmdTimer, (RT_TIMER_CALL_BACK)bthci_TimerCallbackHCICmd, NULL, "BTHCICmdTimer");
#endif
#if (SENDTXMEHTOD == 0)
	PlatformInitializeTimer(padapter, &pBTinfo->BTHCISendAclDataTimer, (RT_TIMER_CALL_BACK)bthci_TimerCallbackSendAclData, NULL, "BTHCISendAclDataTimer");
#endif
	PlatformInitializeTimer(padapter, &pBTinfo->BTHCIDiscardAclDataTimer, (RT_TIMER_CALL_BACK)bthci_TimerCallbackDiscardAclData, NULL, "BTHCIDiscardAclDataTimer");
	PlatformInitializeTimer(padapter, &pBTinfo->BTHCIJoinTimeoutTimer, (RT_TIMER_CALL_BACK)bthci_TimerCallbackJoinTimeout, NULL, "BTHCIJoinTimeoutTimer");
	PlatformInitializeTimer(padapter, &pBTinfo->BTTestSendPacketTimer, (RT_TIMER_CALL_BACK)bthci_TimerCallbackSendTestPacket, NULL, "BTTestSendPacketTimer");

	PlatformInitializeTimer(padapter, &pBTinfo->BTBeaconTimer, (RT_TIMER_CALL_BACK)BTPKT_TimerCallbackBeacon, NULL, "BTBeaconTimer");
	PlatformInitializeTimer(padapter, &pBtSec->BTWPAAuthTimer, (RT_TIMER_CALL_BACK)BTPKT_TimerCallbackWPAAuth, NULL, "BTWPAAuthTimer");
	PlatformInitializeTimer(padapter, &pBTinfo->BTSupervisionPktTimer, (RT_TIMER_CALL_BACK)bthci_TimerCallbackBTSupervisionPacket, NULL, "BTGeneralPurposeTimer");
	PlatformInitializeTimer(padapter, &pBTinfo->BTDisconnectPhyLinkTimer, (RT_TIMER_CALL_BACK)bthci_TimerCallbackDisconnectPhysicalLink, NULL, "BTDisconnectPhyLinkTimer");
	PlatformInitializeTimer(padapter, &pBTinfo->BTPsDisableTimer, (RT_TIMER_CALL_BACK)bthci_TimerCallbackPsDisable, NULL, "BTPsDisableTimer");
	PlatformInitializeTimer(padapter, &pBTinfo->BTAuthTimeoutTimer, (RT_TIMER_CALL_BACK)bthci_TimerCallbackBTAuthTimeout, NULL, "BTAuthTimeoutTimer");
	PlatformInitializeTimer(padapter, &pBTinfo->BTAsocTimeoutTimer, (RT_TIMER_CALL_BACK)bthci_TimerCallbackAsocTimeout, NULL, "BTAsocTimeoutTimer");
}

void BTHCI_CancelAllTimer(PADAPTER padapter)
{
	PBT30Info		pBTinfo = GET_BT_INFO(padapter);
	PBT_SECURITY		pBtSec = &pBTinfo->BtSec;

	// Note: don't cancel BTHCICmdTimer, if you cancel this timer, there will
	// have posibility to cause irp not completed.
#if (SENDTXMEHTOD == 0)
	PlatformCancelTimer(padapter, &pBTinfo->BTHCISendAclDataTimer);
#endif
	PlatformCancelTimer(padapter, &pBTinfo->BTHCIDiscardAclDataTimer);
	PlatformCancelTimer(padapter, &pBTinfo->BTHCIJoinTimeoutTimer);
	PlatformCancelTimer(padapter, &pBTinfo->BTTestSendPacketTimer);

	PlatformCancelTimer(padapter, &pBTinfo->BTBeaconTimer);
	PlatformCancelTimer(padapter, &pBtSec->BTWPAAuthTimer);
	PlatformCancelTimer(padapter, &pBTinfo->BTSupervisionPktTimer);
	PlatformCancelTimer(padapter, &pBTinfo->BTDisconnectPhyLinkTimer);
	PlatformCancelTimer(padapter, &pBTinfo->BTPsDisableTimer);
	PlatformCancelTimer(padapter, &pBTinfo->BTAuthTimeoutTimer);
	PlatformCancelTimer(padapter, &pBTinfo->BTAsocTimeoutTimer);
}

void BTHCI_ReleaseAllTimer(PADAPTER padapter)
{
	PBT30Info		pBTinfo = GET_BT_INFO(padapter);
	PBT_SECURITY		pBtSec = &pBTinfo->BtSec;

#if (BT_THREAD == 0)
	PlatformReleaseTimer(padapter, &pBTinfo->BTHCICmdTimer);
#endif
#if (SENDTXMEHTOD == 0)
	PlatformReleaseTimer(padapter, &pBTinfo->BTHCISendAclDataTimer);
#endif
	PlatformReleaseTimer(padapter, &pBTinfo->BTHCIDiscardAclDataTimer);
	PlatformReleaseTimer(padapter, &pBTinfo->BTHCIJoinTimeoutTimer);
	PlatformReleaseTimer(padapter, &pBTinfo->BTTestSendPacketTimer);

	PlatformReleaseTimer(padapter, &pBTinfo->BTBeaconTimer);
	PlatformReleaseTimer(padapter, &pBtSec->BTWPAAuthTimer);
	PlatformReleaseTimer(padapter, &pBTinfo->BTSupervisionPktTimer);
	PlatformReleaseTimer(padapter, &pBTinfo->BTDisconnectPhyLinkTimer);
	PlatformReleaseTimer(padapter, &pBTinfo->BTAuthTimeoutTimer);
	PlatformReleaseTimer(padapter, &pBTinfo->BTAsocTimeoutTimer);
	PlatformReleaseTimer(padapter, &pBTinfo->BTPsDisableTimer);
}

void BTHCI_InitializeAllWorkItem(PADAPTER padapter)
{
	PBT30Info		pBTinfo = GET_BT_INFO(padapter);
#if (BT_THREAD == 0)
	PlatformInitializeWorkItem(
		padapter,
		&(pBTinfo->HCICmdWorkItem),
		(RT_WORKITEM_CALL_BACK)bthci_WorkItemCallbackHCICmd,
		(PVOID)padapter,
		"HCICmdWorkItem");
#endif
#if (SENDTXMEHTOD == 0)
	PlatformInitializeWorkItem(
		padapter,
		&(pBTinfo->HCISendACLDataWorkItem),
		(RT_WORKITEM_CALL_BACK)bthci_WorkItemCallbackSendACLData,
		(PVOID)padapter,
		"HCISendACLDataWorkItem");
#endif
	PlatformInitializeWorkItem(
		padapter,
		&(pBTinfo->BTPsDisableWorkItem),
		(RT_WORKITEM_CALL_BACK)bthci_WorkItemCallbackPsDisable,
		(PVOID)padapter,
		"BTPsDisableWorkItem");

	PlatformInitializeWorkItem(
		padapter,
		&(pBTinfo->BTConnectWorkItem),
		(RT_WORKITEM_CALL_BACK)bthci_WorkItemCallbackConnect,
		(PVOID)padapter,
		"BTConnectWorkItem");
}

