acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
void BTHCI_FreeAllWorkItem(PADAPTER padapter)
{
	PBT30Info		pBTinfo = GET_BT_INFO(padapter);
#if (BT_THREAD == 0)
	PlatformFreeWorkItem(&(pBTinfo->HCICmdWorkItem));
#endif
#if (SENDTXMEHTOD == 0)
	PlatformFreeWorkItem(&(pBTinfo->HCISendACLDataWorkItem));
#endif
	PlatformFreeWorkItem(&(pBTinfo->BTPsDisableWorkItem));
	PlatformFreeWorkItem(&(pBTinfo->BTConnectWorkItem));
}

void BTHCI_Reset(PADAPTER padapter)
{
	bthci_CmdReset(padapter, _FALSE);
}

u8 BTHCI_HsConnectionEstablished(PADAPTER padapter)
{
	u8			bBtConnectionExist = _FALSE;
	PBT30Info	pBtinfo = GET_BT_INFO(padapter);
	u8 i;

	for (i=0; i<MAX_BT_ASOC_ENTRY_NUM; i++)
	{
		if (pBtinfo->BtAsocEntry[i].b4waySuccess == _TRUE)
		{
			bBtConnectionExist = _TRUE;
			break;
		}
	}

	RTPRINT(FIOCTL, IOCTL_STATE, (" BTHCI_HsConnectionEstablished(), connection exist = %d\n", bBtConnectionExist));

	return bBtConnectionExist;
}

u8
BTHCI_CheckProfileExist(
	PADAPTER 	padapter,
	BT_TRAFFIC_MODE_PROFILE	Profile
	)
{
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT	pBtMgnt = &pBTInfo->BtMgnt;
	u8		IsPRofile = _FALSE;
	u8		i=0;

	for (i=0; i<pBtMgnt->ExtConfig.NumberOfHandle; i++)
	{
		if (pBtMgnt->ExtConfig.linkInfo[i].TrafficProfile == Profile)
		{
			IsPRofile=_TRUE;
			break;
		}
	}

	return IsPRofile;
}

u8 BTHCI_GetBTCoreSpecByProf(PADAPTER padapter, u8 profile)
{
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT	pBtMgnt = &pBTInfo->BtMgnt;
	u8		btSpec = BT_SPEC_1_2;
	u8		i = 0;

	for (i=0; i<pBtMgnt->ExtConfig.NumberOfHandle; i++)
	{
		if (pBtMgnt->ExtConfig.linkInfo[i].TrafficProfile == profile)
		{
			btSpec = pBtMgnt->ExtConfig.linkInfo[i].BTCoreSpec;
			break;
		}
	}

	return btSpec;
}


void BTHCI_GetProfileNameMoto(PADAPTER padapter)
{
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT	pBtMgnt = &pBTInfo->BtMgnt;
	u8		i = 0;
	u8		InCommingMode = 0,OutGoingMode = 0,ScoMode = 0;


	ScoMode = pBtMgnt->ExtConfig.NumberOfSCO;

	RTPRINT(FBT, BT_TRACE, ("[DM][BT], NumberOfHandle = %d, NumberOfSCO = %d\n",
		pBtMgnt->ExtConfig.NumberOfHandle, pBtMgnt->ExtConfig.NumberOfSCO));

	for (i=0; i<pBtMgnt->ExtConfig.NumberOfHandle; i++)
	{
		InCommingMode=pBtMgnt->ExtConfig.linkInfo[i].IncomingTrafficMode;
		OutGoingMode=pBtMgnt->ExtConfig.linkInfo[i].OutgoingTrafficMode;

		if (ScoMode)
		{
			pBtMgnt->ExtConfig.linkInfo[i].TrafficProfile = BT_PROFILE_SCO;
		}
		else if ((InCommingMode == BT_MOTOR_EXT_BE) && (OutGoingMode == BT_MOTOR_EXT_BE))
		{
			pBtMgnt->ExtConfig.linkInfo[i].TrafficProfile = BT_PROFILE_PAN;
		}
		else if ((InCommingMode == BT_MOTOR_EXT_GULB) && (OutGoingMode == BT_MOTOR_EXT_GULB))
		{
			pBtMgnt->ExtConfig.linkInfo[i].TrafficProfile = BT_PROFILE_A2DP;
		}
		else if ((InCommingMode == BT_MOTOR_EXT_GUL) && (OutGoingMode == BT_MOTOR_EXT_BE))
		{
			pBtMgnt->ExtConfig.linkInfo[i].TrafficProfile = BT_PROFILE_HID;
		}
		else
		{
			pBtMgnt->ExtConfig.linkInfo[i].TrafficProfile = BT_PROFILE_NONE;
		}
	}
}

void BTHCI_UpdateBTProfileRTKToMoto(PADAPTER padapter)
{
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT	pBtMgnt = &pBTInfo->BtMgnt;
	u8		i = 0;

	pBtMgnt->ExtConfig.NumberOfSCO = 0;

	for (i=0; i<pBtMgnt->ExtConfig.NumberOfHandle; i++)
	{
		pBtMgnt->ExtConfig.linkInfo[i].TrafficProfile = BT_PROFILE_NONE;

		if (pBtMgnt->ExtConfig.linkInfo[i].BTProfile == BT_PROFILE_SCO)
		{
			pBtMgnt->ExtConfig.NumberOfSCO++;
		}

		pBtMgnt->ExtConfig.linkInfo[i].TrafficProfile = pBtMgnt->ExtConfig.linkInfo[i].BTProfile;
		switch (pBtMgnt->ExtConfig.linkInfo[i].TrafficProfile)
		{
			case BT_PROFILE_SCO:
				break;
			case BT_PROFILE_PAN:
				pBtMgnt->ExtConfig.linkInfo[i].IncomingTrafficMode = BT_MOTOR_EXT_BE;
				pBtMgnt->ExtConfig.linkInfo[i].OutgoingTrafficMode = BT_MOTOR_EXT_BE;
				break;
			case BT_PROFILE_A2DP:
				pBtMgnt->ExtConfig.linkInfo[i].IncomingTrafficMode = BT_MOTOR_EXT_GULB;
				pBtMgnt->ExtConfig.linkInfo[i].OutgoingTrafficMode = BT_MOTOR_EXT_GULB;
				break;
			case BT_PROFILE_HID:
				pBtMgnt->ExtConfig.linkInfo[i].IncomingTrafficMode = BT_MOTOR_EXT_GUL;
				pBtMgnt->ExtConfig.linkInfo[i].OutgoingTrafficMode = BT_MOTOR_EXT_BE;
				break;
			default:
				break;
		}
	}

	RTPRINT(FBT, BT_TRACE, ("[DM][BT], RTK, NumberOfHandle = %d, NumberOfSCO = %d\n",
		pBtMgnt->ExtConfig.NumberOfHandle, pBtMgnt->ExtConfig.NumberOfSCO));
}

void BTHCI_GetBTRSSI(PADAPTER padapter)
{
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT	pBtMgnt = &pBTInfo->BtMgnt;
	u8		i = 0;

	//return;

	for (i=0; i<pBtMgnt->ExtConfig.NumberOfHandle; i++)
	{
		bthci_EventExtGetBTRSSI(padapter, pBtMgnt->ExtConfig.linkInfo[i].ConnectHandle);
	}
}

void BTHCI_WifiScanNotify(PADAPTER padapter, u8 scanType)
{
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT	pBtMgnt = &pBTInfo->BtMgnt;

	if (pBtMgnt->ExtConfig.bEnableWifiScanNotify)
		bthci_EventExtWifiScanNotify(padapter, scanType);
}

void
BTHCI_StateMachine(
	PADAPTER 					padapter,
	u8					StateToEnter,
	HCI_STATE_WITH_CMD		StateCmd,
	u8					EntryNum
	)
{
	PBT30Info	pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT	pBtMgnt = &pBTInfo->BtMgnt;

	if (EntryNum == 0xff)
	{
		RTPRINT(FIOCTL, IOCTL_STATE, (" StateMachine, error EntryNum=0x%x \n",EntryNum));
		return;
	}
	RTPRINT(FIOCTL, IOCTL_STATE, (" StateMachine, EntryNum = 0x%x, CurrentState = 0x%x, BtNextState = 0x%x,  StateCmd = 0x%x ,StateToEnter = 0x%x\n",
		EntryNum,pBTInfo->BtAsocEntry[EntryNum].BtCurrentState,pBTInfo->BtAsocEntry[EntryNum].BtNextState,StateCmd,StateToEnter));

	if (pBTInfo->BtAsocEntry[EntryNum].BtNextState & StateToEnter)
	{
		pBTInfo->BtAsocEntry[EntryNum].BtCurrentState = StateToEnter;

		switch (StateToEnter)
		{
			case HCI_STATE_STARTING:
				{
					pBTInfo->BtAsocEntry[EntryNum].BtNextState = HCI_STATE_DISCONNECTING | HCI_STATE_CONNECTING;
					bthci_StateStarting(padapter,StateCmd,EntryNum);
					break;
				}
			case HCI_STATE_CONNECTING:
				{
					pBTInfo->BtAsocEntry[EntryNum].BtNextState = HCI_STATE_CONNECTING | HCI_STATE_DISCONNECTING | HCI_STATE_AUTHENTICATING;
					bthci_StateConnecting(padapter,StateCmd,EntryNum);
					break;
				}

			case HCI_STATE_AUTHENTICATING:
				{
					pBTInfo->BtAsocEntry[EntryNum].BtNextState = HCI_STATE_DISCONNECTING | HCI_STATE_CONNECTED;
					bthci_StateAuth(padapter,StateCmd,EntryNum);
					break;
				}

