acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], bPrePsTdmaOn = %d, bCurPsTdmaOn = %d!!\n",
		pBtdm8723->bPrePsTdmaOn, pBtdm8723->bCurPsTdmaOn));
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], prePsTdma = %d, curPsTdma = %d!!\n",
		pBtdm8723->prePsTdma, pBtdm8723->curPsTdma));

	// update pre state
	pBtdm8723->bPrePsTdmaOn = pBtdm8723->bCurPsTdmaOn;
	pBtdm8723->prePsTdma = pBtdm8723->curPsTdma;
}

void _btdm_1AntSetPSTDMA(PADAPTER padapter, u8 bPSEn, u8 smartps, u8 psOption, u8 bTDMAOn, u8 tdmaType)
{
	struct pwrctrl_priv *pwrctrl;
	PHAL_DATA_TYPE pHalData;
	PBTDM_8723A_1ANT pBtdm8723;
	u8 psMode;
	u8 bSwitchPS;


	if ((check_fwstate(&padapter->mlmepriv, WIFI_STATION_STATE) == _FALSE) &&
		(get_fwstate(&padapter->mlmepriv) != WIFI_NULL_STATE))
	{
		btdm_1AntPsTdma(padapter, bTDMAOn, tdmaType);
		return;
	}

#ifdef DIS_PS_RX_BCN
	psOption &= ~BIT(0);
#endif

	RTPRINT(FBT, BT_TRACE,
			("[BTCoex], PS %s Option=%d, TDMA %s type=%d\n",
			 bPSEn==_TRUE?"ENABLE":"DISABLE", psOption,
			 bTDMAOn==_TRUE?"ENABLE":"DISABLE", tdmaType));

	pwrctrl = &padapter->pwrctrlpriv;
	pHalData = GET_HAL_DATA(padapter);
	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;

	if ((pBtdm8723->bWiFiHalt == _TRUE) && (bPSEn == _TRUE))
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], Reject enter LPS when WiFiHalt!\n"));
		return;
	}

	if (bPSEn == _TRUE)
		psMode = PS_MODE_MIN;
	else
	{
		psMode = PS_MODE_ACTIVE;
		psOption = 0;
	}

	if (psMode != pwrctrl->pwr_mode)
		bSwitchPS = _TRUE;
	else if (psMode != PS_MODE_ACTIVE)
	{
		if (psOption != pwrctrl->bcn_ant_mode)
			bSwitchPS = _TRUE;
		else if (smartps != pwrctrl->smart_ps)
			bSwitchPS = _TRUE;
		else
			bSwitchPS = _FALSE;
	}
	else
		bSwitchPS = _FALSE;

	if (_TRUE == bSwitchPS)
	{
		// disable TDMA
		if (pBtdm8723->bCurPsTdmaOn == _TRUE)
		{
			if (bTDMAOn == _FALSE)
				btdm_1AntPsTdma(padapter, _FALSE, tdmaType);
			else
			{
				if ((BT_IsBtDisabled(padapter) == _TRUE) ||
					(pHalData->bt_coexist.halCoex8723.c2hBtInfo == BT_INFO_STATE_NO_CONNECTION) ||
					(pHalData->bt_coexist.halCoex8723.c2hBtInfo == BT_INFO_STATE_CONNECT_IDLE))
				btdm_1AntPsTdma(padapter, _FALSE, 9);
				else
					btdm_1AntPsTdma(padapter, _FALSE, 0);
			}
		}

		// change Power Save State
		btdm_1AntSetPSMode(padapter, bPSEn, smartps, psOption);
	}

	btdm_1AntPsTdma(padapter, bTDMAOn, tdmaType);
}

void btdm_1AntSetPSTDMA(PADAPTER padapter, u8 bPSEn, u8 psOption, u8 bTDMAOn, u8 tdmaType)
{
	_btdm_1AntSetPSTDMA(padapter, bPSEn, 0, psOption, bTDMAOn, tdmaType);
}

void btdm_1AntWifiParaAdjust(PADAPTER padapter, u8 bEnable)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_1ANT	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;

	if (bEnable)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi para adjust enable!!\n"));
		pBtdm8723->curWifiPara = 1;
		if (pBtdm8723->preWifiPara != pBtdm8723->curWifiPara)
		{
			BTDM_SetSwPenaltyTxRateAdaptive(padapter, BT_TX_RATE_ADAPTIVE_LOW_PENALTY);
		}
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi para adjust disable!!\n"));
		pBtdm8723->curWifiPara = 2;
		if (pBtdm8723->preWifiPara != pBtdm8723->curWifiPara)
		{
			BTDM_SetSwPenaltyTxRateAdaptive(padapter, BT_TX_RATE_ADAPTIVE_NORMAL);
		}
	}

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], preWifiPara = %d, curWifiPara = %d!!\n",
		pBtdm8723->preWifiPara, pBtdm8723->curWifiPara));
	pBtdm8723->preWifiPara = pBtdm8723->curWifiPara;
}

void btdm_1AntPtaParaReload(PADAPTER padapter)
{
	// PTA parameter
	rtw_write8(padapter, 0x6cc, 0x0);			// 1-Ant coex
	rtw_write32(padapter, 0x6c8, 0xffff);		// wifi break table
	rtw_write32(padapter, 0x6c4, 0x55555555);	// coex table

	// Antenna switch control parameter
	rtw_write32(padapter, 0x858, 0xaaaaaaaa);
	if (IS_8723A_A_CUT(GET_HAL_DATA(padapter)->VersionID))
	{
		rtw_write32(padapter, 0x870, 0x0);	// SPDT(connected with TRSW) control by hardware PTA
		rtw_write8(padapter, 0x40, 0x24);
	}
	else
	{
		rtw_write8(padapter, 0x40, 0x20);
		rtw_write16(padapter, 0x860, 0x210);	// set antenna at bt side if ANTSW is software control
		rtw_write32(padapter, 0x870, 0x300);	// SPDT(connected with TRSW) control by hardware PTA
		rtw_write32(padapter, 0x874, 0x22804000);	// ANTSW keep by GNT_BT
	}

	// coexistence parameters
	rtw_write8(padapter, 0x778, 0x1);	// enable RTK mode PTA

	// BT don't ignore WLAN_Act
	btdm_SetFwIgnoreWlanAct(padapter, _FALSE);
}

/*
 * Return
 *	1: upgrade (add WiFi duration time)
 *	0: keep
 *	-1: downgrade (add BT duration time)
 */
s8 btdm_1AntTdmaJudgement(PADAPTER padapter, u8 retry)
{
	PHAL_DATA_TYPE		pHalData;
	PBTDM_8723A_1ANT	pBtdm8723;
	static s8 up = 0, dn = 0, m = 1, n = 3, WaitCount= 0;
	s8 ret;


	pHalData = GET_HAL_DATA(padapter);
	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;
	ret = 0;

	if (pBtdm8723->psTdmaMonitorCnt == 0)
	{
		up = 0;
		dn = 0;
		m = 1;
		n = 3;
		WaitCount = 0;
	}
	else
	{
		WaitCount++;
	}

	if (retry == 0)  // no retry in the last 2-second duration
	{
		up++;
		dn--;
		if (dn < 0) dn = 0;

		if (up >= 3*m)
		{
			// retry=0 in consecutive 3m*(2s), add WiFi duration
			ret = 1;

			n = 3;
			up = 0;
			dn = 0;
			WaitCount = 0;
		}
	}
	else if (retry <= 3)  // retry<=3 in the last 2-second duration
	{
		up--;
		dn++;
		if (up < 0) up = 0;

		if (dn == 2)
		{
			// retry<=3 in consecutive 2*(2s), minus WiFi duration (add BT duration)
			ret = -1;

			// record how many time downgrad WiFi duration
			if (WaitCount <= 2)
				m++;
			else
				m = 1;
			// the max number of m is 20
			// the longest time of upgrade WiFi duration is 20*3*2s = 120s
			if (m >= 20) m = 20;

			up = 0;
			dn = 0;
			WaitCount = 0;
		}
	}
	else  // retry count > 3
	{
		// retry>3, minus WiFi duration (add BT duration)
		ret = -1;

		// record how many time downgrad WiFi duration
		if (WaitCount == 1)
			m++;
		else
			m = 1;
		if (m >= 20) m = 20;

		up = 0;
		dn = 0;
		WaitCount = 0;
	}

	return ret;
}

void btdm_1AntTdmaDurationAdjustForACL(PADAPTER padapter)
{
	PHAL_DATA_TYPE		pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_1ANT	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;


