acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], %s\n", __FUNCTION__));
	if (pBtdm8723->psTdmaGlobalCnt != pBtdm8723->psTdmaMonitorCnt)
	{
		pBtdm8723->psTdmaMonitorCnt = 0;
		pBtdm8723->psTdmaGlobalCnt = 0;
	}
	if (pBtdm8723->psTdmaMonitorCnt == 0)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjACL, first time execute!!\n"));
		btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 2);
		pBtdm8723->psTdmaDuAdjType = 2;
	}
	else
	{
		// Now we only have 4 level Ps Tdma,
		// if that's not the following 4 level(will changed by wifi scan, dhcp...),
		// then we have to adjust it back to the previous record one.
		if ((pBtdm8723->curPsTdma != 1) &&
			(pBtdm8723->curPsTdma != 2) &&
			(pBtdm8723->curPsTdma != 9) &&
			(pBtdm8723->curPsTdma != 11))
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], tdma adjust type can only be 1/2/9/11 !!!\n"));
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], the latest adjust type = %d\n", pBtdm8723->psTdmaDuAdjType));

			btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, pBtdm8723->psTdmaDuAdjType);
		}
		else
		{
			s32 judge = 0;

			judge = btdm_1AntTdmaJudgement(padapter, pHalData->bt_coexist.halCoex8723.btRetryCnt);
			if (judge == -1)
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjACL, Upgrade WiFi duration\n"));
				if (pBtdm8723->curPsTdma == 1)
				{
					// Decrease WiFi duration for high BT retry
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 2);
					pBtdm8723->psTdmaDuAdjType = 2;
				}
				else if (pBtdm8723->curPsTdma == 2)
				{
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 9);
					pBtdm8723->psTdmaDuAdjType = 9;
				}
				else if (pBtdm8723->curPsTdma == 9)
				{
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 11);
					pBtdm8723->psTdmaDuAdjType = 11;
				}
			}
			else if (judge == 1)
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjACL, Downgrade WiFi duration!!\n"));

				if (pBtdm8723->curPsTdma == 11)
				{
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 9);
					pBtdm8723->psTdmaDuAdjType = 9;
				}
				else if (pBtdm8723->curPsTdma == 9)
				{
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 2);
					pBtdm8723->psTdmaDuAdjType = 2;
				}
				else if (pBtdm8723->curPsTdma == 2)
				{
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 1);
					pBtdm8723->psTdmaDuAdjType = 1;
				}
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjACL, no need to change\n"));
			}
		}

		RTPRINT(FBT, BT_TRACE, ("[BTCoex], current PS TDMA is %s, type=%d\n",
			(pBtdm8723->bCurPsTdmaOn? "ON":"OFF"), pBtdm8723->curPsTdma));
	}

	pBtdm8723->psTdmaMonitorCnt++;
}

u8 btdm_1AntAdjustbyWiFiRSSI(u8 RSSI_Now, u8 RSSI_Last, u8 RSSI_Th)
{
	u8 type;

	if (RSSI_Now>RSSI_Last)
	{
		if (RSSI_Now > (RSSI_Th + 5))
			type = 26;
		else
			type = 25;
	}
	else
	{
		if (RSSI_Now > RSSI_Th)
			type = 26;
		else
			type = 25;
	}

	return type;
}

void btdm_1AntTdmaDurationAdjustForSCO(PADAPTER padapter)
{
	PHAL_DATA_TYPE pHalData;
	PBTDM_8723A_1ANT pBtdm8723;
	PDM_ODM_T podm;
	pDIG_T pDigTable;
	u8 RSSITh_WiFi, RSSITh12_BT, RSSITh23_BT;
	u8 Type, RSSIOffset;
	u8 RSSI_WiFi_Now, RSSI_BT_Now;


//	RTPRINT(FBT, BT_TRACE, ("[BTCoex], %s\n", __FUNCTION__));
	pHalData = GET_HAL_DATA(padapter);
	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;
	podm = &pHalData->odmpriv;
	pDigTable = &podm->DM_DigTable;
	RSSITh_WiFi = 47;
	RSSITh12_BT = 36;
	RSSITh23_BT = 30;
	RSSIOffset = 22;
	RSSI_WiFi_Now = pDigTable->Rssi_val_min;
	RSSI_BT_Now = pHalData->bt_coexist.halCoex8723.btRssi;

	if (pBtdm8723->psTdmaGlobalCnt != pBtdm8723->psTdmaMonitorCntForSCO)
	{
		pBtdm8723->psTdmaMonitorCntForSCO = 0;
		pBtdm8723->psTdmaGlobalCnt = 0;
	}

	if (pBtdm8723->psTdmaMonitorCntForSCO == 0)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjSCO, first time execute!!\n"));
		pBtdm8723->RSSI_WiFi_Last = 0;
		pBtdm8723->RSSI_BT_Last = 0;
	}
	else
	{
		if ((pBtdm8723->curPsTdma != 23) &&
				(pBtdm8723->curPsTdma != 24) &&
				(pBtdm8723->curPsTdma != 25) &&
				(pBtdm8723->curPsTdma != 26))
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjSCO, tdma adjust type can only be 23/24/25/26 !!!\n"));
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjSCO, the latest adjust type=%d\n", pBtdm8723->psTdmaDuAdjTypeForSCO));

			Type = pBtdm8723->psTdmaDuAdjTypeForSCO;

			goto _exit_1AntTdmaDurationAdjustForSCO;
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjSCO, pre curPsTdma=%d\n", pBtdm8723->curPsTdma));
		}
	}

	switch (pBtdm8723->curPsTdma)
	{
		case 23: //Level-1, WiFi 37ms
			RSSI_BT_Now += 9;  // 22*0.4
			break;
		case 25: //Level-3a, WiFi 5ms
			RSSI_BT_Now += 1;  // 22*0.05
			break;
		case 26: //Level-3b, antenna stays on BT
			RSSI_WiFi_Now += RSSIOffset;
			break;
		default:
		case 24: //Level-2, WiFi 21ms
			RSSI_BT_Now += 4;  // 22*0.2
			break;
	}

	if (!BTDM_IsWifiBusy(padapter)) // WiFi LPS
	{
		Type = btdm_1AntAdjustbyWiFiRSSI(RSSI_WiFi_Now, pBtdm8723->RSSI_WiFi_Last, RSSITh_WiFi);
	}
	else // WiFi busy
	{
		if (RSSI_BT_Now > pBtdm8723->RSSI_BT_Last)
		{
			if (RSSI_BT_Now > RSSITh12_BT + 4)
				Type = 23;
			else if (RSSI_BT_Now > RSSITh23_BT + 4)
				Type = 24;
			else
				Type = btdm_1AntAdjustbyWiFiRSSI(RSSI_WiFi_Now, pBtdm8723->RSSI_WiFi_Last, RSSITh_WiFi);
		}
		else
		{
			if (RSSI_BT_Now > RSSITh12_BT)
				Type = 23;
			else if  (RSSI_BT_Now > RSSITh23_BT)
				Type = 24;
			else
				Type = btdm_1AntAdjustbyWiFiRSSI(RSSI_WiFi_Now, pBtdm8723->RSSI_WiFi_Last, RSSITh_WiFi);
		}
	}

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntTdmaAdjSCO, Type=%d, RSSI_WiFi=%d, RSSI_BT=%d\n",
			Type, RSSI_WiFi_Now, RSSI_BT_Now));

_exit_1AntTdmaDurationAdjustForSCO:

	pBtdm8723->RSSI_WiFi_Last = RSSI_WiFi_Now;
	pBtdm8723->RSSI_BT_Last = RSSI_BT_Now;

	if (Type != pBtdm8723->curPsTdma)
		btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, Type);

	pBtdm8723->psTdmaDuAdjTypeForSCO = Type;

	pBtdm8723->psTdmaMonitorCntForSCO++;
}

void btdm_1AntCoexProcessForWifiConnect(PADAPTER padapter)
{
	struct mlme_priv *pmlmepriv;
	PHAL_DATA_TYPE pHalData;
	PBT_COEXIST_8723A pBtCoex;
	PBTDM_8723A_1ANT pBtdm8723;
	u8 BtState;


	RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntCoexProcessForWifiConnect!!\n"));

