acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
	pmlmepriv = &padapter->mlmepriv;
	pHalData = GET_HAL_DATA(padapter);
	pBtCoex = &pHalData->bt_coexist.halCoex8723;
	pBtdm8723 = &pBtCoex->btdm1Ant;
	BtState = pBtCoex->c2hBtInfo;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], WiFi is %s\n", BTDM_IsWifiBusy(padapter)?"Busy":"IDLE"));
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT is %s\n", BtStateString[BtState]));

	padapter->pwrctrlpriv.btcoex_rfon=_FALSE;
	if ((!BTDM_IsWifiBusy(padapter)) &&
		((BtState == BT_INFO_STATE_NO_CONNECTION) || (BtState == BT_INFO_STATE_CONNECT_IDLE)))
	{
		switch (BtState)
		{
			case BT_INFO_STATE_NO_CONNECTION:
				_btdm_1AntSetPSTDMA(padapter, _TRUE, 2, 3, _FALSE, 9);
				break;
			case BT_INFO_STATE_CONNECT_IDLE:
				_btdm_1AntSetPSTDMA(padapter, _TRUE, 2, 7, _FALSE, 0);
				break;
		}
	}
	else
	{
		u8 val8;

		val8 = rtw_read8(padapter, 0x883);
		val8 &= 0x03;
		if ((BtState == BT_INFO_STATE_SCO_ONLY_BUSY) ||
			(BtState == BT_INFO_STATE_ACL_SCO_BUSY))
		{
			val8 |= 0x60; // 0x880[31:26]=011000
		}
		else
		{
			val8 |= 0xC0; // 0x880[31:26]=110000
		}
		rtw_write8(padapter, 0x883, val8);

		switch (BtState)
		{
			case BT_INFO_STATE_NO_CONNECTION:
				// WiFi is Busy
				btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _TRUE, 5);
				break;
			case BT_INFO_STATE_CONNECT_IDLE:
				// WiFi is Busy
				btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _TRUE, 12);
				break;
			case BT_INFO_STATE_INQ_OR_PAG:
				if (BTDM_IsWifiBusy(padapter) == _TRUE)
				{
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 10);
				}
				else
				{
					btdm_1AntSetPSTDMA(padapter, _TRUE, 3, _FALSE, 9);
				}
				break;
			case BT_INFO_STATE_SCO_ONLY_BUSY:
			case BT_INFO_STATE_ACL_SCO_BUSY:
				btdm_1AntTdmaDurationAdjustForSCO(padapter);
				break;
			case BT_INFO_STATE_ACL_ONLY_BUSY:
				if (pBtCoex->c2hBtProfile == BTINFO_B_HID)
				{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT PROFILE is HID\n"));
					btdm_1AntTdmaDurationAdjustForSCO(padapter);
				}
				else if (pBtCoex->c2hBtProfile == BTINFO_B_FTP)
				{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT PROFILE is FTP\n"));
					padapter->pwrctrlpriv.btcoex_rfon=_TRUE;
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 1);
				}
				else if (pBtCoex->c2hBtProfile == (BTINFO_B_A2DP|BTINFO_B_FTP))
				{
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT PROFILE is A2DP_FTP\n"));
					padapter->pwrctrlpriv.btcoex_rfon=_TRUE;
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 11);
				}
				else
				{
					if (pBtCoex->c2hBtProfile == BTINFO_B_A2DP)
					{
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT PROFILE is A2DP\n"));
						padapter->pwrctrlpriv.btcoex_rfon=_TRUE;
					}
					else
					{
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT PROFILE is UNKNOWN(0x%02X)! Use A2DP Profile\n", pBtCoex->c2hBtProfile));
						padapter->pwrctrlpriv.btcoex_rfon=_TRUE;
					}
					btdm_1AntTdmaDurationAdjustForACL(padapter);
				}
				break;
		}
	}

	pBtdm8723->psTdmaGlobalCnt++;
}

void btdm_1AntBTStateChangeHandler(PADAPTER padapter, BT_STATE_1ANT oldState, BT_STATE_1ANT newState)
{
	if (oldState == newState)
		return;


	RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT state change, %s => %s\n", BtStateString[oldState], BtStateString[newState]));

	if ((oldState <= BT_INFO_STATE_NO_CONNECTION) &&
		(newState > BT_INFO_STATE_NO_CONNECTION))
	{
		btdm_SetFwIgnoreWlanAct(padapter, _FALSE);
	}

	if (oldState == BT_INFO_STATE_ACL_ONLY_BUSY)
	{
		PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
		pHalData->bt_coexist.halCoex8723.btdm1Ant.psTdmaMonitorCnt = 0;
		pHalData->bt_coexist.halCoex8723.btdm1Ant.psTdmaMonitorCntForSCO = 0;
	}

	if ((oldState == BT_INFO_STATE_SCO_ONLY_BUSY) ||
		(oldState == BT_INFO_STATE_ACL_SCO_BUSY))
	{
		PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
		pHalData->bt_coexist.halCoex8723.btdm1Ant.psTdmaMonitorCntForSCO = 0;
	}
}

void btdm_1AntBtCoexistHandler(PADAPTER padapter)
{
	PHAL_DATA_TYPE		pHalData;
	PBT_COEXIST_8723A	pBtCoex8723;
	PBTDM_8723A_1ANT	pBtdm8723;
	u8			u1tmp;


	pHalData = GET_HAL_DATA(padapter);
	pBtCoex8723 = &pHalData->bt_coexist.halCoex8723;
	pBtdm8723 = &pBtCoex8723->btdm1Ant;
	padapter->pwrctrlpriv.btcoex_rfon=_FALSE;
	if (BT_IsBtDisabled(padapter) == _TRUE)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT is disabled\n"));

		if (BTDM_IsWifiConnectionExist(padapter) == _TRUE)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is connected\n"));

			if (BTDM_IsWifiBusy(padapter) == _TRUE)
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Wifi is busy\n"));
				btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _FALSE, 9);
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Wifi is idle\n"));
				_btdm_1AntSetPSTDMA(padapter, _TRUE, 2, 1, _FALSE, 9);
			}
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is disconnected\n"));

			btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _FALSE, 9);
		}
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT is enabled\n"));

		if (BTDM_IsWifiConnectionExist(padapter) == _TRUE)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is connected\n"));

			btdm_1AntWifiParaAdjust(padapter, _TRUE);
			btdm_1AntCoexProcessForWifiConnect(padapter);
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is disconnected\n"));

			// Antenna switch at BT side(0x870 = 0x300, 0x860 = 0x210) after PSTDMA off
			btdm_1AntWifiParaAdjust(padapter, _FALSE);
			btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _FALSE, 0);
		}
	}

	btdm_1AntBTStateChangeHandler(padapter, pBtCoex8723->prec2hBtInfo, pBtCoex8723->c2hBtInfo);
	pBtCoex8723->prec2hBtInfo = pBtCoex8723->c2hBtInfo;
}

void
BTDM_1AntSetWifiRssiThresh(
	PADAPTER	padapter,
	u8		rssiThresh
	)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_1ANT pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;

	pBtdm8723->wifiRssiThresh = rssiThresh;
	DbgPrint("cosa set rssi thresh = %d\n", pBtdm8723->wifiRssiThresh);
}

void BTDM_1AntParaInit(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_1ANT	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;

	// Enable counter statistics
	rtw_write8(padapter, 0x76e, 0x4);
	btdm_1AntPtaParaReload(padapter);

	pBtdm8723->wifiRssiThresh = 48;

	pBtdm8723->bWiFiHalt = _FALSE;
}

void BTDM_1AntForHalt(PADAPTER padapter)
{
	RTPRINT(FBT, BT_TRACE, ("\n[BTCoex], 1Ant for halt\n"));

	GET_HAL_DATA(padapter)->bt_coexist.halCoex8723.btdm1Ant.bWiFiHalt == _TRUE;

	btdm_1AntWifiParaAdjust(padapter, _FALSE);
	btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _FALSE, 0);
}

