acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
void BTDM_1AntLpsLeave(PADAPTER padapter)
{
	RTPRINT(FBT, BT_TRACE, ("\n[BTCoex], 1Ant for LPS Leave\n"));

	// Prevent from entering LPS again
	GET_HAL_DATA(padapter)->bt_coexist.halCoex8723.btdm1Ant.bWiFiHalt == _TRUE;

	btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _FALSE, 8);
//	btdm_1AntPsTdma(padapter, _FALSE, 8);
}

void BTDM_1AntWifiAssociateNotify(PADAPTER padapter, u8 type)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);


	RTPRINT(FBT, BT_TRACE, ("\n[BTCoex], 1Ant for associate, type=%d\n", type));

	if (type)
	{
		if (BT_IsBtDisabled(padapter) == _TRUE)
		{
			btdm_1AntPsTdma(padapter, _FALSE, 9);
		}
		else
		{
			btdm_1AntTSFSwitch(padapter, _TRUE);
			btdm_1AntPsTdma(padapter, _TRUE, 8);	// extend wifi slot
		}
	}
	else
	{
		if (BT_IsBtDisabled(padapter) == _FALSE)
		{
			if (BTDM_IsWifiConnectionExist(padapter) == _FALSE)
			{
				btdm_1AntPsTdma(padapter, _FALSE, 0);
				btdm_1AntTSFSwitch(padapter, _FALSE);
			}
		}

		btdm_1AntBtCoexistHandler(padapter);
	}
}

void BTDM_1AntMediaStatusNotify(PADAPTER padapter, RT_MEDIA_STATUS mstatus)
{
	RTPRINT(FBT, BT_TRACE, ("\n[BTCoex], wifi status change to %s(%s)\n",
			mstatus==RT_MEDIA_CONNECT?"connect":"disconnect",
			BTDM_IsWifiConnectionExist(padapter)==_TRUE?"connect":"disconnect"));

	btdm_1AntBtCoexistHandler(padapter);
}

void BTDM_1AntForDhcp(PADAPTER padapter)
{
	PHAL_DATA_TYPE pHalData;
	u8 u1tmp;


	RTPRINT(FBT, BT_TRACE, ("\n[BTCoex], 1Ant for DHCP\n"));

	pHalData = GET_HAL_DATA(padapter);

	if (BT_IsBtDisabled(padapter) == _TRUE)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1Ant for DHCP, BT is disabled\n"));
		btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _FALSE, 9);
	}
	else
	{
		u8 BtState;
		PBTDM_8723A_1ANT pBtdm8723;

		BtState = pHalData->bt_coexist.halCoex8723.c2hBtInfo;
		pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;

		if (BtState == BT_INFO_STATE_SCO_ONLY_BUSY ||
			BtState == BT_INFO_STATE_ACL_SCO_BUSY)
		{
			PDM_ODM_T podm = &pHalData->odmpriv;
			pDIG_T pDigTable = &podm->DM_DigTable;
			u8 RSSIOffset = 22;
			u8 RSSI_WiFi_Now = pDigTable->Rssi_val_min;

			if (pBtdm8723->curPsTdma == 26)
				RSSI_WiFi_Now = RSSI_WiFi_Now + RSSIOffset;

			RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1Ant for DHCP, BTState is %s, pre curPsTdma=%d, RSSI_WiFi_Now=%d\n", BtStateString[BtState], pBtdm8723->curPsTdma, RSSI_WiFi_Now));
			padapter->pwrctrlpriv.btcoex_rfon=_TRUE;
			if (RSSI_WiFi_Now > 47)
				btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 26);
			else
				btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 18);
		}
		else if (BTDM_IsWifiBusy(padapter) == _TRUE)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1Ant for DHCP, WiFi is Busy\n"));
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], %s\n", BtStateString[BtState]));
			padapter->pwrctrlpriv.btcoex_rfon=_FALSE;
			switch (BtState)
			{
				case BT_INFO_STATE_NO_CONNECTION:
				case BT_INFO_STATE_CONNECT_IDLE:
					btdm_1AntBtCoexistHandler(padapter);
					break;

				case BT_INFO_STATE_ACL_ONLY_BUSY:
					switch (pBtdm8723->curPsTdma)
					{
						case 1:
						case 2:
							RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1Ant for DHCP, Keep PSTDMA type=%d\n", pBtdm8723->curPsTdma));
							break;
						default:
							padapter->pwrctrlpriv.btcoex_rfon=_TRUE;
							btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 16);
							break;
					}
					break;
				case BT_INFO_STATE_SCO_ONLY_BUSY:
				case BT_INFO_STATE_ACL_SCO_BUSY:
					padapter->pwrctrlpriv.btcoex_rfon=_TRUE;
				default:
					btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 18); // extend wifi slot
					break;
			}
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1Ant for DHCP, WiFi is Idle\n"));
			switch (BtState)
			{
				case BT_INFO_STATE_NO_CONNECTION:
				case BT_INFO_STATE_CONNECT_IDLE:

					padapter->pwrctrlpriv.btcoex_rfon=_FALSE;
					break;

				case BT_INFO_STATE_ACL_ONLY_BUSY:
				case BT_INFO_STATE_SCO_ONLY_BUSY:
				case BT_INFO_STATE_ACL_SCO_BUSY:
					padapter->pwrctrlpriv.btcoex_rfon=_TRUE;
				default:
					break;
			}

			btdm_1AntSetPSTDMA(padapter, _TRUE, 1, _TRUE, 18); // extend wifi slot
		}
	}
}

void BTDM_1AntWifiScanNotify(PADAPTER padapter, u8 scanType)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8 u1tmp;


	RTPRINT(FBT, BT_TRACE, ("\n[BTCoex], 1Ant for wifi scan=%d!!\n", scanType));

	if (scanType)
	{
		if (BT_IsBtDisabled(padapter) == _TRUE)
		{
			btdm_1AntSetPSTDMA(padapter, _FALSE, 0, _FALSE, 9);
		}
		else
		{
			if (BTDM_IsWifiConnectionExist(padapter) == _FALSE)
			{
				btdm_1AntTSFSwitch(padapter, _TRUE);
			}

			btdm_1AntPsTdma(padapter, _TRUE, 4); // Antenna control by TDMA
		}

		btdm_NotifyFwScan(padapter, 1);
	}
	else // WiFi_Finish_Scan
	{
		btdm_NotifyFwScan(padapter, 0);

		if (BT_IsBtDisabled(padapter) == _FALSE)
		{
			if (BTDM_IsWifiConnectionExist(padapter) == _FALSE)
			{
				btdm_1AntPsTdma(padapter, _FALSE, 0);
				btdm_1AntTSFSwitch(padapter, _FALSE);
			}
		}

		btdm_1AntBtCoexistHandler(padapter);
	}
}

void BTDM_1AntFwC2hBtInfo8723A(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData;
	PBT30Info		pBTInfo;
	PBT_MGNT		pBtMgnt;
	PBT_COEXIST_8723A pBtCoex;
	u8	u1tmp, btState;


	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;
	pBtCoex = &pHalData->bt_coexist.halCoex8723;

	u1tmp = pBtCoex->c2hBtInfoOriginal;
	// sco BUSY bit is not used on voice over PCM platform
	btState = u1tmp & 0xF;
	pBtCoex->c2hBtProfile = u1tmp & 0xE0;

	// default set bt to idle state.
	pBtMgnt->ExtConfig.bBTBusy = _FALSE;
	pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_IDLE;

	// check BIT2 first ==> check if bt is under inquiry or page scan
	if (btState & BIT(2))
	{
		pBtCoex->bC2hBtInquiryPage = _TRUE;
	}
	else
	{
		pBtCoex->bC2hBtInquiryPage = _FALSE;
	}
	btState &= ~BIT(2);

	if (!(btState & BIT(0)))
	{
		pBtCoex->c2hBtInfo = BT_INFO_STATE_NO_CONNECTION;
	}
	else
	{
		if (btState == 0x1)
		{
			pBtCoex->c2hBtInfo = BT_INFO_STATE_CONNECT_IDLE;
		}
		else if (btState == 0x9)
		{
			pBtCoex->c2hBtInfo = BT_INFO_STATE_ACL_ONLY_BUSY;
			pBtMgnt->ExtConfig.bBTBusy = _TRUE;
		}
		else if (btState == 0x3)
		{
			pBtCoex->c2hBtInfo = BT_INFO_STATE_SCO_ONLY_BUSY;
			pBtMgnt->ExtConfig.bBTBusy = _TRUE;
		}
		else if (btState == 0xb)
		{
			pBtCoex->c2hBtInfo = BT_INFO_STATE_ACL_SCO_BUSY;
			pBtMgnt->ExtConfig.bBTBusy = _TRUE;
		}
		else
		{
			pBtCoex->c2hBtInfo = BT_INFO_STATE_MAX;
		}
		if (_TRUE == pBtMgnt->ExtConfig.bBTBusy)
			pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_IDLE;
	}

	if ((BT_INFO_STATE_NO_CONNECTION == pBtCoex->c2hBtInfo) ||
		(BT_INFO_STATE_CONNECT_IDLE == pBtCoex->c2hBtInfo))
	{
		if (pBtCoex->bC2hBtInquiryPage)
			pBtCoex->c2hBtInfo = BT_INFO_STATE_INQ_OR_PAG;
	}

	RTPRINT(FBT, BT_TRACE, ("[BTC2H], Bt state=%d\n", pBtCoex->c2hBtInfo));

	switch (pBtCoex->c2hBtInfo)
	{
		case BT_INFO_STATE_DISABLED:
			RTPRINT(FBT, BT_TRACE, ("Bt is disabled!!\n"));
			break;
		case BT_INFO_STATE_NO_CONNECTION:
			RTPRINT(FBT, BT_TRACE, ("Bt is disconnected!!\n"));
			break;
		case BT_INFO_STATE_CONNECT_IDLE:
			RTPRINT(FBT, BT_TRACE, ("Bt is connected & idle!!\n"));
			break;
		case BT_INFO_STATE_INQ_OR_PAG:
			RTPRINT(FBT, BT_TRACE, ("Bt is inquirying or paging!!\n"));
			break;
		case BT_INFO_STATE_ACL_ONLY_BUSY:
			RTPRINT(FBT, BT_TRACE, ("Bt is ACL only busy!!\n"));
			break;
		case BT_INFO_STATE_SCO_ONLY_BUSY:
			RTPRINT(FBT, BT_TRACE, ("Bt is SCO only busy!!\n"));
			break;
		case BT_INFO_STATE_ACL_SCO_BUSY:
			RTPRINT(FBT, BT_TRACE, ("Bt is ACL+SCO busy!!\n"));
			break;
		default:
			RTPRINT(FBT, BT_TRACE, ("Undefined!!\n"));
			break;
	}
}

void BTDM_1AntBtCoexist8723A(PADAPTER padapter)
{
	struct mlme_priv *pmlmepriv;
	PHAL_DATA_TYPE	pHalData;
	u32 curr_time, delta_time;


