acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
	pmlmepriv = &padapter->mlmepriv;
	pHalData = GET_HAL_DATA(padapter);

	if (check_fwstate(pmlmepriv, WIFI_SITE_MONITOR) == _TRUE)
	{
		// already done in BTDM_1AntForScan()
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is under scan progress!!\n"));
		return;
	}

	if (check_fwstate(pmlmepriv, WIFI_UNDER_LINKING) == _TRUE)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is under link progress!!\n"));
		return;
	}

	// under DHCP(Special packet)
	curr_time = rtw_get_current_time();
	delta_time = curr_time - padapter->pwrctrlpriv.DelayLPSLastTimeStamp;
	delta_time = rtw_systime_to_ms(delta_time);
	if (delta_time < 500) // 500ms
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is under DHCP progress(%d ms)!!\n", delta_time));
		return;
	}

	BTDM_CheckWiFiState(padapter);

	btdm_1AntBtCoexistHandler(padapter);
}

// ===== End of sync from SD7 driver HAL/BTCoexist/HalBtc87231Ant.c =====
#endif

#ifdef __HALBTC87232ANT_C__ // HAL/BTCoexist/HalBtc87232Ant.c
// ===== Below this line is sync from SD7 driver HAL/BTCoexist/HalBtc87232Ant.c =====

//============================================================
// local function proto type if needed
//============================================================
void btdm_SetBtdm(PADAPTER padapter, PBTDM_8723A_2ANT pBtdm);

//============================================================
// local function start with btdm_
//============================================================
void btdm_BtInqPageMonitor(PADAPTER	padapter)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(padapter);

	if(pHalData->bt_coexist.halCoex8723.bC2hBtInquiryPage)
	{

		// bt inquiry or page is started.
		if(pHalData->bt_coexist.halCoex8723.btInqPageStartTime == 0)
		{
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_INQ_PAGE;
			pHalData->bt_coexist.halCoex8723.btInqPageStartTime = rtw_get_current_time();
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT Inquiry/page is started at time : 0x%"i64fmt"x \n",
			pHalData->bt_coexist.halCoex8723.btInqPageStartTime));
		}
	}
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT Inquiry/page started time : 0x%"i64fmt"x, curTime : 0x%x \n",
		pHalData->bt_coexist.halCoex8723.btInqPageStartTime,  rtw_get_current_time()));

	if(pHalData->bt_coexist.halCoex8723.btInqPageStartTime)
	{
		if((rtw_get_passing_time_ms(pHalData->bt_coexist.halCoex8723.btInqPageStartTime)/1000) >= 10)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT Inquiry/page >= 10sec!!!"));
			pHalData->bt_coexist.halCoex8723.btInqPageStartTime = 0;
			pHalData->bt_coexist.CurrentState &=~ BT_COEX_STATE_BT_INQ_PAGE;
		}
	}
}

u8 btdm_NeedToDecBtPwr(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PADAPTER	pDefaultAdapter = GetDefaultAdapter(padapter);


//	if (MgntLinkStatusQuery(pDefaultAdapter) == RT_MEDIA_CONNECT)
	if (check_fwstate(&pDefaultAdapter->mlmepriv, WIFI_ASOC_STATE) == _TRUE)
	{
		RTPRINT(FBT, BT_TRACE, ("Need to decrease bt power\n"));
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_DEC_BT_POWER;
		return _TRUE;
	}
	pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_DEC_BT_POWER;
	return _FALSE;
}

u8 btdm_IsBadIsolation(PADAPTER padapter)
{
	return _FALSE;
}

void
btdm_SetCoexTable(
	PADAPTER	padapter,
	u32		val0x6c0,
	u32		val0x6c8,
	u8		val0x6cc
	)
{
	RTPRINT(FBT, BT_TRACE, ("set coex table, set 0x6c0=0x%x\n", val0x6c0));
	rtw_write32(padapter, 0x6c0, val0x6c0);

	RTPRINT(FBT, BT_TRACE, ("set coex table, set 0x6c8=0x%x\n", val0x6c8));
	rtw_write32(padapter, 0x6c8, val0x6c8);

	RTPRINT(FBT, BT_TRACE, ("set coex table, set 0x6cc=0x%x\n", val0x6cc));
	rtw_write8(padapter, 0x6cc, val0x6cc);
}

void btdm_SetHwPtaMode(PADAPTER padapter, u8 bMode)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (BT_PTA_MODE_ON == bMode)
	{
		RTPRINT(FBT, BT_TRACE, ("PTA mode on\n"));
		// Enable GPIO 0/1/2/3/8 pins for bt
		rtw_write8(padapter, 0x40, 0x20);
		pHalData->bt_coexist.bHWCoexistAllOff = _FALSE;
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("PTA mode off\n"));
		rtw_write8(padapter, 0x40, 0x0);
	}
}

void
btdm_BtdmStrctureReload(
	PADAPTER		padapter,
	PBTDM_8723A_2ANT	pBtdm
	)
{
	pBtdm->bAllOff = _FALSE;
	pBtdm->bAgcTableEn = _FALSE;
	pBtdm->bAdcBackOffOn = _FALSE;
	pBtdm->b2AntHidEn = _FALSE;
	pBtdm->bLowPenaltyRateAdaptive = _FALSE;
	pBtdm->bRfRxLpfShrink = _FALSE;
	pBtdm->bRejectAggrePkt= _FALSE;

	pBtdm->bTdmaOn = _FALSE;
	pBtdm->tdmaAnt = TDMA_2ANT;
	pBtdm->tdmaNav = TDMA_NAV_OFF;
	pBtdm->tdmaDacSwing = TDMA_DAC_SWING_OFF;
	pBtdm->fwDacSwingLvl = 0x20;

	pBtdm->bTraTdmaOn = _FALSE;
	pBtdm->traTdmaAnt = TDMA_2ANT;
	pBtdm->traTdmaNav = TDMA_NAV_OFF;
	pBtdm->bIgnoreWlanAct = _FALSE;

	pBtdm->bPsTdmaOn = _FALSE;
	pBtdm->psTdmaByte[0] = 0x0;
	pBtdm->psTdmaByte[1] = 0x0;
	pBtdm->psTdmaByte[2] = 0x0;
	pBtdm->psTdmaByte[3] = 0x8;

	pBtdm->bPtaOn = _TRUE;
	pBtdm->val0x6c0 = 0x5a5aaaaa;
	pBtdm->val0x6c8 = 0xcc;
	pBtdm->val0x6cc = 0x3;

	pBtdm->bSwDacSwingOn = _FALSE;
	pBtdm->swDacSwingLvl = 0xc0;
	pBtdm->wlanActHi = 0x20;
	pBtdm->wlanActLo = 0x10;
	pBtdm->btRetryIndex = 2;

	pBtdm->bDecBtPwr = _FALSE;
}

void
btdm_BtdmStrctureReloadAllOff(
	PADAPTER			padapter,
	PBTDM_8723A_2ANT		pBtdm
	)
{
	btdm_BtdmStrctureReload(padapter, pBtdm);
	pBtdm->bAllOff = _TRUE;
	pBtdm->bPtaOn = _FALSE;
	pBtdm->wlanActHi = 0x10;
}

u8 btdm_Is2Ant8723ACommonAction(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	BTDM_8723A_2ANT	btdm8723;
	u8			bCommon = _FALSE;

	btdm_BtdmStrctureReload(padapter, &btdm8723);
	if (btdm_IsBadIsolation(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("Bad isolation, bt coex mechanism always off!!\n"));
		btdm_BtdmStrctureReloadAllOff(padapter, &btdm8723);
		bCommon = _TRUE;
	}
	else if (!BTDM_IsWifiBusy(padapter) && !BTDM_IsBTBusy(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("Wifi idle + Bt idle, bt coex mechanism always off!!\n"));
		btdm_BtdmStrctureReloadAllOff(padapter, &btdm8723);
		bCommon = _TRUE;
	}
	else if (BTDM_IsWifiBusy(padapter) && !BTDM_IsBTBusy(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("Wifi non-idle + Bt disabled/idle!!\n"));
		btdm8723.bLowPenaltyRateAdaptive = _TRUE;
		btdm8723.bRfRxLpfShrink = _FALSE;
		btdm8723.bRejectAggrePkt = _FALSE;

		// sw mechanism
		btdm8723.bAgcTableEn = _FALSE;
		btdm8723.bAdcBackOffOn = _FALSE;
		btdm8723.bSwDacSwingOn = _FALSE;

		btdm8723.bPtaOn = _TRUE;
		btdm8723.val0x6c0 = 0x5a5aaaaa;
		btdm8723.val0x6c8 = 0xcccc;
		btdm8723.val0x6cc = 0x3;

		btdm8723.bTdmaOn = _FALSE;
		btdm8723.tdmaDacSwing = TDMA_DAC_SWING_OFF;
		btdm8723.b2AntHidEn = _FALSE;

		bCommon = _TRUE;
	}
	else if (BTDM_IsBTBusy(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("Bt non-idle!!\n"));
		if (BTDM_IsWifiConnectionExist(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi connection exists!!\n"));
			bCommon = _FALSE;
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("No wifi connection!!\n"));

