acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
			btdm8723.bRfRxLpfShrink = _TRUE;
			btdm8723.bLowPenaltyRateAdaptive = _FALSE;
			btdm8723.bRejectAggrePkt = _FALSE;

			// sw mechanism
			btdm8723.bAgcTableEn = _FALSE;
			btdm8723.bAdcBackOffOn = _FALSE;
			btdm8723.bSwDacSwingOn = _FALSE;

			btdm8723.bPtaOn = _TRUE;
			btdm8723.val0x6c0 = 0xaaaaaaaa;
			btdm8723.val0x6c8 = 0xff000000;
			btdm8723.val0x6cc = 0x3;

			btdm8723.bTdmaOn = _FALSE;
			btdm8723.tdmaDacSwing = TDMA_DAC_SWING_OFF;
			btdm8723.b2AntHidEn = _FALSE;

			bCommon = _TRUE;
		}
	}

	if (btdm_NeedToDecBtPwr(padapter))
	{
		btdm8723.bDecBtPwr = _TRUE;
	}
	if (pHalData->bt_coexist.halCoex8723.btInqPageStartTime)
	{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT btInqPageStartTime = 0x%"i64fmt"x,\n",
			pHalData->bt_coexist.halCoex8723.btInqPageStartTime));
			btdm8723.bIgnoreWlanAct = _TRUE;

	}

	if (bCommon && BTDM_IsCoexistStateChanged(padapter))
	{
		btdm_SetBtdm(padapter, &btdm8723);
	}
	return bCommon;
}

void
btdm_SetSwFullTimeDacSwing(
	PADAPTER	padapter,
	u8		bSwDacSwingOn,
	u32		swDacSwingLvl
	)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (bSwDacSwingOn)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], SwDacSwing = 0x%x\n", swDacSwingLvl));
		PHY_SetBBReg(padapter, 0x880, 0xff000000, swDacSwingLvl);
		pHalData->bt_coexist.bSWCoexistAllOff = _FALSE;
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], SwDacSwing Off!\n"));
		PHY_SetBBReg(padapter, 0x880, 0xff000000, 0xc0);
	}
}

void
btdm_SetFw2AntHID(
	PADAPTER	padapter,
	u8		bEnable,
	u8		bDACSwingOn
	)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8			H2C_Parameter[1] = {0};

	H2C_Parameter[0] = 0;

	if (bEnable)
	{
		H2C_Parameter[0] |= BIT(0);
		pHalData->bt_coexist.bFWCoexistAllOff = _FALSE;
	}
	if (bDACSwingOn)
	{
		H2C_Parameter[0] |= BIT(1);// Dac Swing default enable
	}
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], turn 2-Ant+HID mode %s, DACSwing:%s, write 0x15=0x%x\n",
		(bEnable ? "ON!!":"OFF!!"), (bDACSwingOn ? "ON":"OFF"), H2C_Parameter[0]));

	FillH2CCmd(padapter, BT_2ANT_HID_EID, 1, H2C_Parameter);
}

void
btdm_SetFwTdmaCtrl(
	PADAPTER	padapter,
	u8		bEnable,
	u8		antNum,
	u8		navEn,
	u8		dacSwingEn)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8			H2C_Parameter[1] = {0};
	u8			H2C_Parameter1[1] = {0};

	H2C_Parameter[0] = 0;
	H2C_Parameter1[0] = 0;

	if (bEnable)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], set BT PTA update manager to trigger update!!\n"));
		H2C_Parameter1[0] |= BIT(0);

		RTPRINT(FBT, BT_TRACE, ("[BTCoex], turn TDMA mode ON!!\n"));
		H2C_Parameter[0] |= BIT(0);		// function enable
		if (TDMA_1ANT == antNum)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], TDMA_1ANT\n"));
			H2C_Parameter[0] |= BIT(1);
		}
		else if (TDMA_2ANT == antNum)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], TDMA_2ANT\n"));
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], Unknown Ant\n"));
		}

		if (TDMA_NAV_OFF == navEn)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], TDMA_NAV_OFF\n"));
		}
		else if (TDMA_NAV_ON == navEn)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], TDMA_NAV_ON\n"));
			H2C_Parameter[0] |= BIT(2);
		}

		if (TDMA_DAC_SWING_OFF == dacSwingEn)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], TDMA_DAC_SWING_OFF\n"));
		}
		else if (TDMA_DAC_SWING_ON == dacSwingEn)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], TDMA_DAC_SWING_ON\n"));
			H2C_Parameter[0] |= BIT(4);
		}
		pHalData->bt_coexist.bFWCoexistAllOff = _FALSE;
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], set BT PTA update manager to no update!!\n"));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], turn TDMA mode OFF!!\n"));
	}

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], FW2AntTDMA, write 0x26=0x%x\n",
		H2C_Parameter1[0]));
	FillH2CCmd(padapter, BT_PTA_MANAGER_UPDATE_ENABLE_EID, 1, H2C_Parameter1);

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], FW2AntTDMA, write 0x14=0x%x\n",
		H2C_Parameter[0]));
	FillH2CCmd(padapter, BT_ANT_TDMA_EID, 1, H2C_Parameter);

	if (!bEnable)
	{
		//rtw_mdelay_os(2);
		//rtw_write8(padapter, 0x778, 0x1);
	}
}

void
btdm_SetFwTraTdmaCtrl(
	PADAPTER	padapter,
	u8		bEnable,
	u8		antNum,
	u8		navEn
	)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8			H2C_Parameter[2] = {0};

	// Only 8723 B cut should do this
	if (IS_8723A_A_CUT(pHalData->VersionID))
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], not 8723B cut, don't set Traditional TDMA!!\n"));
		return;
	}

	if (bEnable)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], turn TTDMA mode ON!!\n"));
		H2C_Parameter[0] |= BIT(0);		// function enable
		if (TDMA_1ANT == antNum)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], TTDMA_1ANT\n"));
			H2C_Parameter[0] |= BIT(1);
		}
		else if (TDMA_2ANT == antNum)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], TTDMA_2ANT\n"));
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], Unknown Ant\n"));
		}

		if (TDMA_NAV_OFF == navEn)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], TTDMA_NAV_OFF\n"));
		}
		else if (TDMA_NAV_ON == navEn)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], TTDMA_NAV_ON\n"));
			H2C_Parameter[1] |= BIT(0);
		}

		pHalData->bt_coexist.bFWCoexistAllOff = _FALSE;
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], turn TTDMA mode OFF!!\n"));
	}

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], FW Traditional TDMA, write 0x33=0x%x\n",
		H2C_Parameter[0]<<8|H2C_Parameter[1]));

	FillH2CCmd(padapter, TRADITIONAL_TDMA_EN_EID, 2, H2C_Parameter);
}

void btdm_SetFwDacSwingLevel(PADAPTER padapter, u8 dacSwingLvl)
{
	u8			H2C_Parameter[1] = {0};

	H2C_Parameter[0] = dacSwingLvl;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], Set Dac Swing Level=0x%x\n", dacSwingLvl));
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], write 0x29=0x%x\n", H2C_Parameter[0]));

	FillH2CCmd(padapter, DAC_SWING_VALUE_EID, 1, H2C_Parameter);
}

void btdm_SetFwBtHidInfo(PADAPTER padapter, u8 bEnable)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8			H2C_Parameter[1] = {0};

	H2C_Parameter[0] = 0;

	if (bEnable)
	{
		H2C_Parameter[0] |= BIT(0);
		pHalData->bt_coexist.bFWCoexistAllOff = _FALSE;
	}
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], Set BT HID information=0x%x\n", bEnable));
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], write 0x24=0x%x\n", H2C_Parameter[0]));

