acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
	FillH2CCmd(padapter, HID_PROFILE_ENABLE_EID, 1, H2C_Parameter);
}

void btdm_SetFwBtRetryIndex(PADAPTER padapter, u8 retryIndex)
{
	u8			H2C_Parameter[1] = {0};

	H2C_Parameter[0] = retryIndex;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], Set BT Retry Index=%d\n", retryIndex));
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], write 0x23=0x%x\n", H2C_Parameter[0]));

	FillH2CCmd(padapter, SET_BT_TX_RETRY_INDEX_EID, 1, H2C_Parameter);
}


void
btdm_SetFwWlanAct(
	PADAPTER	padapter,
	u8		wlanActHi,
	u8		wlanActLo
	)
{
	u8			H2C_ParameterHi[1] = {0};
	u8			H2C_ParameterLo[1] = {0};

	H2C_ParameterHi[0] = wlanActHi;
	H2C_ParameterLo[0] = wlanActLo;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], Set WLAN_ACT Hi:Lo=0x%x/0x%x\n", wlanActHi, wlanActLo));
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], write 0x22=0x%x\n", H2C_ParameterHi[0]));
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], write 0x11=0x%x\n", H2C_ParameterLo[0]));

	FillH2CCmd(padapter, SET_TDMA_WLAN_ACT_TIME_EID, 1, H2C_ParameterHi);	// WLAN_ACT = High duration, unit:ms
	FillH2CCmd(padapter, BT_QUEUE_PKT_EID, 1, H2C_ParameterLo);	// WLAN_ACT = Low duration, unit:3*625us
}

void
btdm_SetBtdm(
	PADAPTER			padapter,
	PBTDM_8723A_2ANT		pBtdm
	)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_2ANT	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm2Ant;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	u8 i;
	//
	// check new setting is different with the old one,
	// if all the same, don't do the setting again.
	//
	if (_rtw_memcmp(pBtdm8723, pBtdm, sizeof(BTDM_8723A_2ANT)) == _TRUE)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], the same coexist setting, return!!\n"));
		return;
	}
	else
	{	//save the new coexist setting
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], save new coexist setting and execute!!\n"));

		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new bAllOff=0x%x/ 0x%x \n", pBtdm8723->bAllOff, pBtdm->bAllOff));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new bAgcTableEn=0x%x/ 0x%x \n", pBtdm8723->bAgcTableEn, pBtdm->bAgcTableEn));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new bAdcBackOffOn=0x%x/ 0x%x \n", pBtdm8723->bAdcBackOffOn, pBtdm->bAdcBackOffOn));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new b2AntHidEn=0x%x/ 0x%x \n", pBtdm8723->b2AntHidEn, pBtdm->b2AntHidEn));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new bLowPenaltyRateAdaptive = 0x%x/ 0x%x \n", pBtdm8723->bLowPenaltyRateAdaptive, pBtdm->bLowPenaltyRateAdaptive));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new bRfRxLpfShrink=0x%x/ 0x%x \n", pBtdm8723->bRfRxLpfShrink, pBtdm->bRfRxLpfShrink));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new bRejectAggrePkt=0x%x/ 0x%x \n", pBtdm8723->bRejectAggrePkt, pBtdm->bRejectAggrePkt));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new bTdmaOn=0x%x/ 0x%x \n", pBtdm8723->bTdmaOn, pBtdm->bTdmaOn));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new tdmaAnt=0x%x/ 0x%x \n", pBtdm8723->tdmaAnt, pBtdm->tdmaAnt));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new tdmaNav=0x%x/ 0x%x \n", pBtdm8723->tdmaNav, pBtdm->tdmaNav));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new tdmaDacSwing=0x%x/ 0x%x \n", pBtdm8723->tdmaDacSwing, pBtdm->tdmaDacSwing));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new fwDacSwingLvl=0x%x/ 0x%x \n", pBtdm8723->fwDacSwingLvl, pBtdm->fwDacSwingLvl));

		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new bTraTdmaOn=0x%x/ 0x%x \n", pBtdm8723->bTraTdmaOn, pBtdm->bTraTdmaOn));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new traTdmaAnt=0x%x/ 0x%x \n", pBtdm8723->traTdmaAnt, pBtdm->traTdmaAnt));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new traTdmaNav=0x%x/ 0x%x \n", pBtdm8723->traTdmaNav, pBtdm->traTdmaNav));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new bPsTdmaOn=0x%x/ 0x%x \n", pBtdm8723->bPsTdmaOn, pBtdm->bPsTdmaOn));
		for(i=0; i<5; i++)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new psTdmaByte[i]=0x%x/ 0x%x \n", pBtdm8723->psTdmaByte[i], pBtdm->psTdmaByte[i]));
		}
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new bIgnoreWlanAct=0x%x/ 0x%x \n", pBtdm8723->bIgnoreWlanAct, pBtdm->bIgnoreWlanAct));

		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new bPtaOn=0x%x/ 0x%x \n", pBtdm8723->bPtaOn, pBtdm->bPtaOn));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new val0x6c0=0x%x/ 0x%x \n", pBtdm8723->val0x6c0, pBtdm->val0x6c0));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new val0x6c8=0x%x/ 0x%x \n", pBtdm8723->val0x6c8, pBtdm->val0x6c8));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new val0x6cc=0x%x/ 0x%x \n", pBtdm8723->val0x6cc, pBtdm->val0x6cc));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new bSwDacSwingOn=0x%x/ 0x%x \n", pBtdm8723->bSwDacSwingOn, pBtdm->bSwDacSwingOn));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new swDacSwingLvl=0x%x/ 0x%x \n", pBtdm8723->swDacSwingLvl, pBtdm->swDacSwingLvl));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new wlanActHi=0x%x/ 0x%x \n", pBtdm8723->wlanActHi, pBtdm->wlanActHi));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new wlanActLo=0x%x/ 0x%x \n", pBtdm8723->wlanActLo, pBtdm->wlanActLo));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new btRetryIndex=0x%x/ 0x%x \n", pBtdm8723->btRetryIndex, pBtdm->btRetryIndex));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new bDecBtPwr=0x%x/ 0x%x \n", pBtdm8723->bDecBtPwr, pBtdm->bDecBtPwr));
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], original/new bInqCnt=0x%x/ 0x%x \n", pBtdm8723->bInqCnt, pBtdm->bInqCnt));

		pBtdm->bInqCnt = pBtdm8723->bInqCnt;
		_rtw_memcpy(pBtdm8723, pBtdm, sizeof(BTDM_8723A_2ANT));
	}

	//
	// Here we only consider when Bt Operation
	// inquiry/paging/pairing is ON
	// we only need to turn off TDMA
	//
	if (pBtMgnt->ExtConfig.bHoldForBtOperation)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], set to ignore wlanAct for BT OP!!\n"));
		btdm_SetFwIgnoreWlanAct(padapter, _TRUE);
		return;
	}

	if (pBtdm->bAllOff)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], disable all coexist mechanism !!\n"));
		BTDM_CoexAllOff(padapter);
		return;
	}

	BTDM_RejectAPAggregatedPacket(padapter, pBtdm->bRejectAggrePkt);

	if (pBtdm->bLowPenaltyRateAdaptive)
		BTDM_SetSwPenaltyTxRateAdaptive(padapter, BT_TX_RATE_ADAPTIVE_LOW_PENALTY);
	else
		BTDM_SetSwPenaltyTxRateAdaptive(padapter, BT_TX_RATE_ADAPTIVE_NORMAL);

	if (pBtdm->bRfRxLpfShrink)
		BTDM_SetSwRfRxLpfCorner(padapter, BT_RF_RX_LPF_CORNER_SHRINK);
	else
		BTDM_SetSwRfRxLpfCorner(padapter, BT_RF_RX_LPF_CORNER_RESUME);

	if (pBtdm->bAgcTableEn)
		BTDM_AGCTable(padapter, BT_AGCTABLE_ON);
	else
		BTDM_AGCTable(padapter, BT_AGCTABLE_OFF);

