acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
	if (pBtdm->bAdcBackOffOn)
		BTDM_BBBackOffLevel(padapter, BT_BB_BACKOFF_ON);
	else
		BTDM_BBBackOffLevel(padapter, BT_BB_BACKOFF_OFF);

	btdm_SetFwBtRetryIndex(padapter, pBtdm->btRetryIndex);

	btdm_SetFwDacSwingLevel(padapter, pBtdm->fwDacSwingLvl);
	btdm_SetFwWlanAct(padapter, pBtdm->wlanActHi, pBtdm->wlanActLo);

	btdm_SetCoexTable(padapter, pBtdm->val0x6c0, pBtdm->val0x6c8, pBtdm->val0x6cc);
	btdm_SetHwPtaMode(padapter, pBtdm->bPtaOn);

	// NOTE1: Only one of the following mechanism can be Turn ON!!!
	// 1)PsTDMA 2)old TDMA 3)2AntHid
	// NOTE2: When turn on, should turn off other mechanisms.
	//

#if 1
	if (pBtdm->b2AntHidEn)
	{
		// turn off tdma
		btdm_SetFwTraTdmaCtrl(padapter, pBtdm->bTraTdmaOn, pBtdm->traTdmaAnt, pBtdm->traTdmaNav);
		btdm_SetFwTdmaCtrl(padapter, _FALSE, pBtdm->tdmaAnt, pBtdm->tdmaNav, pBtdm->tdmaDacSwing);

		// turn off Pstdma
		btdm_SetFwIgnoreWlanAct(padapter, pBtdm->bIgnoreWlanAct);
		BTDM_SetFw3a(padapter, 0x0, 0x0, 0x0, 0x8, 0x0); 	// Antenna control by PTA, 0x870 = 0x300.

		// turn on 2AntHid
		btdm_SetFwBtHidInfo(padapter, _TRUE);
		btdm_SetFw2AntHID(padapter, _TRUE, _TRUE);
	}
	else if (pBtdm->bTdmaOn)
	{
		// turn off 2AntHid
		btdm_SetFwBtHidInfo(padapter, _FALSE);
		btdm_SetFw2AntHID(padapter, _FALSE, _FALSE);

		// turn off pstdma
		btdm_SetFwIgnoreWlanAct(padapter, pBtdm->bIgnoreWlanAct);
		BTDM_SetFw3a(padapter, 0x0, 0x0, 0x0, 0x8, 0x0); 	// Antenna control by PTA, 0x870 = 0x300.

		// turn on tdma
		btdm_SetFwTraTdmaCtrl(padapter, pBtdm->bTraTdmaOn, pBtdm->traTdmaAnt, pBtdm->traTdmaNav);
		btdm_SetFwTdmaCtrl(padapter, _TRUE, pBtdm->tdmaAnt, pBtdm->tdmaNav, pBtdm->tdmaDacSwing);
	}
	else if(pBtdm->bPsTdmaOn)
	{
		// turn off 2AntHid
		btdm_SetFwBtHidInfo(padapter, _FALSE);
		btdm_SetFw2AntHID(padapter, _FALSE, _FALSE);

		// turn off tdma
		btdm_SetFwTraTdmaCtrl(padapter, pBtdm->bTraTdmaOn, pBtdm->traTdmaAnt, pBtdm->traTdmaNav);
		btdm_SetFwTdmaCtrl(padapter, _FALSE, pBtdm->tdmaAnt, pBtdm->tdmaNav, pBtdm->tdmaDacSwing);

		// turn on pstdma
		btdm_SetFwIgnoreWlanAct(padapter, pBtdm->bIgnoreWlanAct);
		BTDM_SetFw3a(padapter,
			pBtdm->psTdmaByte[0],
			pBtdm->psTdmaByte[1],
			pBtdm->psTdmaByte[2],
			pBtdm->psTdmaByte[3],
			pBtdm->psTdmaByte[4]);
	}
	else
	{
		// turn off 2AntHid
		btdm_SetFwBtHidInfo(padapter, _FALSE);
		btdm_SetFw2AntHID(padapter, _FALSE, _FALSE);

		// turn off tdma
		btdm_SetFwTraTdmaCtrl(padapter, pBtdm->bTraTdmaOn, pBtdm->traTdmaAnt, pBtdm->traTdmaNav);
		btdm_SetFwTdmaCtrl(padapter, _FALSE, pBtdm->tdmaAnt, pBtdm->tdmaNav, pBtdm->tdmaDacSwing);

		// turn off pstdma
		btdm_SetFwIgnoreWlanAct(padapter, pBtdm->bIgnoreWlanAct);
		BTDM_SetFw3a(padapter, 0x0, 0x0, 0x0, 0x8, 0x0); 	// Antenna control by PTA, 0x870 = 0x300.
	}
#else
	if (pBtdm->bTdmaOn)
	{
		if (pBtdm->bPsTdmaOn)
		{
			// we should not reach this case
			//DbgPrint("cosa error case, PsTDMA CANNOT ON when turn old TDMA ON!!!\n");
		}
		else
		{
			// NOTE: When turn on old TDMA, we should turn OFF PsTDMA first
			BTDM_SetFwIgnoreWlanAct(padapter, pBtdm->bIgnoreWlanAct);
			BTDM_SetFw3a(padapter, 0x0, 0x0, 0x0, 0x8, 0x0); 	// Antenna control by PTA, 0x870 = 0x300.
		}

		// Turn off 2AntHID first then turn tdma ON
		btdm_SetFwBtHidInfo(padapter, _FALSE);
		btdm_SetFw2AntHID(padapter, _FALSE, _FALSE);
		btdm_SetFwTraTdmaCtrl(padapter, pBtdm->bTraTdmaOn, pBtdm->traTdmaAnt, pBtdm->traTdmaNav);
		btdm_SetFwTdmaCtrl(padapter, _TRUE, pBtdm->tdmaAnt, pBtdm->tdmaNav, pBtdm->tdmaDacSwing);
	}
	else
	{
		// Turn off tdma first then turn 2AntHID ON if need
		btdm_SetFwTraTdmaCtrl(padapter, pBtdm->bTraTdmaOn, pBtdm->traTdmaAnt, pBtdm->traTdmaNav);
		btdm_SetFwTdmaCtrl(padapter, _FALSE, pBtdm->tdmaAnt, pBtdm->tdmaNav, pBtdm->tdmaDacSwing);
		if (pBtdm->b2AntHidEn)
		{
			btdm_SetFwBtHidInfo(padapter, _TRUE);
			btdm_SetFw2AntHID(padapter, _TRUE, _TRUE);
		}
		else
		{
			btdm_SetFwBtHidInfo(padapter, _FALSE);
			btdm_SetFw2AntHID(padapter, _FALSE, _FALSE);
		}

		// NOTE: When turn on PsTDMA, we should turn OFF old TDMA first
		if (pBtdm->bPsTdmaOn)
		{
			BTDM_SetFwIgnoreWlanAct(padapter, pBtdm->bIgnoreWlanAct);
			BTDM_SetFw3a(padapter,
				pBtdm->psTdmaByte[0],
				pBtdm->psTdmaByte[1],
				pBtdm->psTdmaByte[2],
				pBtdm->psTdmaByte[3],
				pBtdm->psTdmaByte[4]);
		}
		else
		{
			BTDM_SetFwIgnoreWlanAct(padapter, pBtdm->bIgnoreWlanAct);
			BTDM_SetFw3a(padapter, 0x0, 0x0, 0x0, 0x8, 0x0); 	// Antenna control by PTA, 0x870 = 0x300.
		}
	}
#endif
	//
	// Note:
	// We should add delay for making sure sw DacSwing can be set sucessfully.
	// because of that btdm_SetFw2AntHID() and btdm_SetFwTdmaCtrl()
	// will overwrite the reg 0x880.
	//
	rtw_mdelay_os(5);
	btdm_SetSwFullTimeDacSwing(padapter, pBtdm->bSwDacSwingOn, pBtdm->swDacSwingLvl);

	BTDM_SetFwDecBtPwr(padapter, pBtdm->bDecBtPwr);
}

void btdm_BtTrafficCheck(PADAPTER padapter)
{
	PBT30Info		pBTInfo;
	PBT_MGNT		pBtMgnt;
	PHAL_DATA_TYPE	pHalData;


	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;

	// Check if BT PAN (under BT 2.1) is uplink or downlink
	pHalData->bt_coexist.BT21TrafficStatistics.bTxBusyTraffic = _FALSE;
	pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic = _FALSE;

	if (0)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], Now we always force BT as Uplink!!\n"));
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_UPLINK;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_DOWNLINK;
		pHalData->bt_coexist.BT21TrafficStatistics.bTxBusyTraffic = _TRUE;
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], Now we always force BT as Downlink!!\n"));
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_UPLINK;
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_DOWNLINK;
		pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic = _TRUE;
	}
}

void btdm_BtStateUpdate2Ant8723ASco(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT_MGNT		pBtMgnt = &pHalData->BtInfo.BtMgnt;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO busy!!\n"));
	pBtMgnt->ExtConfig.bBTBusy = _TRUE;
	pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_IDLE;
}

void btdm_BtStateUpdate2Ant8723AHid(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT_MGNT		pBtMgnt = &pHalData->BtInfo.BtMgnt;

