acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID busy!!\n"));
	pBtMgnt->ExtConfig.bBTBusy = _TRUE;
	pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_IDLE;
}

void btdm_BtStateUpdate2Ant8723AA2dp(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT_MGNT		pBtMgnt = &pHalData->BtInfo.BtMgnt;

	if (pHalData->bt_coexist.halCoex8723.lowPriorityTx > 10 ||
		pHalData->bt_coexist.halCoex8723.lowPriorityRx > 10)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP busy!!\n"));
		pBtMgnt->ExtConfig.bBTBusy = _TRUE;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_IDLE;
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP idle!!\n"));
	}
}

void btdm_BtStateUpdate2Ant8723APan(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT_MGNT		pBtMgnt = &pHalData->BtInfo.BtMgnt;
	u8			bIdle = _FALSE;

	// note: pay attension that don'e divide by zero.
	if (pHalData->bt_coexist.halCoex8723.lowPriorityTx >=
		pHalData->bt_coexist.halCoex8723.lowPriorityRx)
	{
		if (pHalData->bt_coexist.halCoex8723.lowPriorityRx == 0)
		{
			if (pHalData->bt_coexist.halCoex8723.lowPriorityTx > 10)
				bIdle = _TRUE;
		}
		else
		{
			if ((pHalData->bt_coexist.halCoex8723.lowPriorityTx/
				pHalData->bt_coexist.halCoex8723.lowPriorityRx) > 10)
			{
				bIdle = _TRUE;
			}
		}
	}
	else
	{
		if (pHalData->bt_coexist.halCoex8723.lowPriorityTx == 0)
		{
			if (pHalData->bt_coexist.halCoex8723.lowPriorityRx > 10)
				bIdle = _TRUE;
		}
		else
		{
			if ((pHalData->bt_coexist.halCoex8723.lowPriorityRx/
				pHalData->bt_coexist.halCoex8723.lowPriorityTx) > 10)
			{
				bIdle = _TRUE;
			}
		}
	}

	if (!bIdle)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN busy!!\n"));
		pBtMgnt->ExtConfig.bBTBusy = _TRUE;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_IDLE;
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN idle!!\n"));
	}
}

void btdm_BtStateUpdate2Ant8723AHidA2dp(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT_MGNT		pBtMgnt = &pHalData->BtInfo.BtMgnt;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID+A2DP busy!!\n"));
	pBtMgnt->ExtConfig.bBTBusy = _TRUE;
	pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_IDLE;
}

void btdm_BtStateUpdate2Ant8723AHidPan(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT_MGNT		pBtMgnt = &pHalData->BtInfo.BtMgnt;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID+PAN busy!!\n"));
	pBtMgnt->ExtConfig.bBTBusy = _TRUE;
	pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_IDLE;
}

void btdm_BtStateUpdate2Ant8723APanA2dp(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT_MGNT		pBtMgnt = &pHalData->BtInfo.BtMgnt;

	if (pHalData->bt_coexist.halCoex8723.lowPriorityTx > 10 ||
		pHalData->bt_coexist.halCoex8723.lowPriorityRx > 10)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN+A2DP busy!!\n"));
		pBtMgnt->ExtConfig.bBTBusy = _TRUE;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_IDLE;
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN+A2DP idle!!\n"));
	}
}

u8 btdm_BtTxRxCounterLevel(PADAPTER	padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u32	btTxRxCnt=0;
	u8	btTxRxCntLvl=0;

	btTxRxCnt = BTDM_BtTxRxCounterH(padapter)+BTDM_BtTxRxCounterL(padapter);
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT TxRx Counters = %d\n", btTxRxCnt));

	pHalData->bt_coexist.CurrentState &= ~\
		(BT_COEX_STATE_BT_CNT_LEVEL_0|BT_COEX_STATE_BT_CNT_LEVEL_1|
		BT_COEX_STATE_BT_CNT_LEVEL_2);

	if(btTxRxCnt >= BT_TXRX_CNT_THRES_3)
	{
		btTxRxCntLvl = BT_TXRX_CNT_LEVEL_3;
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_CNT_LEVEL_3;
	}
	else if(btTxRxCnt >= BT_TXRX_CNT_THRES_2)
	{
		btTxRxCntLvl = BT_TXRX_CNT_LEVEL_2;
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_CNT_LEVEL_2;
	}
	else if(btTxRxCnt >= BT_TXRX_CNT_THRES_1)
	{
		btTxRxCntLvl = BT_TXRX_CNT_LEVEL_1;
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_CNT_LEVEL_1;
	}
	else
	{
		btTxRxCntLvl = BT_TXRX_CNT_LEVEL_0;
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_CNT_LEVEL_0;
	}
	return btTxRxCntLvl;
}

void btdm_BtCommonStateUpdate2Ant8723A(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT_MGNT		pBtMgnt = &pHalData->BtInfo.BtMgnt;

	// Bt uplink/downlink
	btdm_BtTrafficCheck(padapter);

	// Default set bt as idle state, we will define busy in each case
	pBtMgnt->ExtConfig.bBTBusy = _FALSE;
	pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_IDLE;
}

void btdm_2Ant8723ASCOAction(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	BTDM_8723A_2ANT	btdm8723;
	u8			btRssiState;

	btdm_BtdmStrctureReload(padapter, &btdm8723);

	btdm8723.bRfRxLpfShrink = _TRUE;
	btdm8723.bLowPenaltyRateAdaptive = _TRUE;
	btdm8723.bRejectAggrePkt = _FALSE;

	if (BTDM_IsHT40(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("HT40\n"));
		// coex table
		btdm8723.val0x6c0 = 0x5a5aaaaa;
		btdm8723.val0x6c8 = 0xcc;
		btdm8723.val0x6cc = 0x3;
		btdm8723.bIgnoreWlanAct = _TRUE;
		// sw mechanism
		btdm8723.bAgcTableEn = _FALSE;
		btdm8723.bAdcBackOffOn = _TRUE;
		btdm8723.bSwDacSwingOn = _FALSE;
		// fw mechanism
		btdm8723.bPsTdmaOn = _FALSE;
		btdm8723.bTraTdmaOn = _FALSE;
		btdm8723.bTdmaOn = _FALSE;
		btdm8723.tdmaDacSwing = TDMA_DAC_SWING_OFF;
		btdm8723.b2AntHidEn = _FALSE;
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_47, 0);

		// coex table
		btdm8723.val0x6c0 = 0x5a5aaaaa;
		btdm8723.val0x6c8 = 0xcc;
		btdm8723.val0x6cc = 0x3;
		btdm8723.bIgnoreWlanAct = _TRUE;
		// sw mechanism
		if ((btRssiState == BT_RSSI_STATE_HIGH) ||
			(btRssiState == BT_RSSI_STATE_STAY_HIGH))
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
			btdm8723.bAgcTableEn = _TRUE;
			btdm8723.bAdcBackOffOn = _TRUE;
			btdm8723.bSwDacSwingOn = _FALSE;
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
			btdm8723.bAgcTableEn = _FALSE;
			btdm8723.bAdcBackOffOn = _FALSE;
			btdm8723.bSwDacSwingOn = _FALSE;
		}
		// fw mechanism
		btdm8723.bPsTdmaOn = _FALSE;
		btdm8723.bTraTdmaOn = _FALSE;
		btdm8723.bTdmaOn = _FALSE;
		btdm8723.tdmaDacSwing = TDMA_DAC_SWING_OFF;
		btdm8723.b2AntHidEn = _FALSE;
	}

	if (btdm_NeedToDecBtPwr(padapter))
	{
		btdm8723.bDecBtPwr = _TRUE;
	}

