acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
	if (BTDM_IsCoexistStateChanged(padapter))
	{
		btdm_SetBtdm(padapter, &btdm8723);
	}
}

void btdm_2Ant8723AHIDAction(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	BTDM_8723A_2ANT	btdm8723;
	u8	btRssiState;

	btdm_BtdmStrctureReload(padapter, &btdm8723);

	btdm8723.bRfRxLpfShrink = _TRUE;
	btdm8723.bLowPenaltyRateAdaptive = _TRUE;
	btdm8723.bRejectAggrePkt = _FALSE;

//	btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_50, 0);

	// coex table
	btdm8723.val0x6c0 = 0x55555555;
	btdm8723.val0x6c8 = 0xffff;
	btdm8723.val0x6cc = 0x3;
	btdm8723.bIgnoreWlanAct = _TRUE;

	if (BTDM_IsHT40(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("HT40\n"));
		// sw mechanism
		btdm8723.bAgcTableEn = _FALSE;
		btdm8723.bAdcBackOffOn = _FALSE;
		btdm8723.bSwDacSwingOn = _FALSE;

		// fw mechanism
		btdm8723.bPsTdmaOn = _TRUE;
		btdm8723.psTdmaByte[0] = 0xa3;
		btdm8723.psTdmaByte[1] = 0xf;
		btdm8723.psTdmaByte[2] = 0xf;
		btdm8723.psTdmaByte[3] = 0x0;
		btdm8723.psTdmaByte[4] = 0x80;

		btdm8723.bTraTdmaOn = _FALSE;
		btdm8723.bTdmaOn = _FALSE;
		btdm8723.tdmaDacSwing = TDMA_DAC_SWING_OFF;
		btdm8723.b2AntHidEn = _FALSE;
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 47, 0);

		if ((btRssiState == BT_RSSI_STATE_HIGH) ||
			(btRssiState == BT_RSSI_STATE_STAY_HIGH))
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
			// sw mechanism
			btdm8723.bAgcTableEn = _FALSE;
			btdm8723.bAdcBackOffOn = _FALSE;
			btdm8723.bSwDacSwingOn = _TRUE;
			btdm8723.swDacSwingLvl = 0x20;

			// fw mechanism
			btdm8723.bPsTdmaOn = _FALSE;
			btdm8723.bTdmaOn = _FALSE;
			btdm8723.tdmaDacSwing = TDMA_DAC_SWING_OFF;
			btdm8723.b2AntHidEn = _FALSE;
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
			// sw mechanism
			btdm8723.bAgcTableEn = _FALSE;
			btdm8723.bAdcBackOffOn = _FALSE;
			btdm8723.bSwDacSwingOn = _FALSE;

			// fw mechanism
			btdm8723.bPsTdmaOn = _FALSE;
			btdm8723.bTdmaOn = _FALSE;
			btdm8723.tdmaDacSwing = TDMA_DAC_SWING_OFF;
			btdm8723.b2AntHidEn = _TRUE;
			btdm8723.fwDacSwingLvl = 0x20;
		}
	}

	if (btdm_NeedToDecBtPwr(padapter))
	{
		btdm8723.bDecBtPwr = _TRUE;
	}

	if (BTDM_IsCoexistStateChanged(padapter))
	{
		btdm_SetBtdm(padapter, &btdm8723);
	}
}

void btdm_2Ant8723AA2DPAction(PADAPTER padapter)
{
	BTDM_8723A_2ANT		btdm8723;
	u8	btRssiState, btSpec;

	btdm_BtdmStrctureReload(padapter, &btdm8723);

	btdm8723.bRfRxLpfShrink = _TRUE;
	btdm8723.bLowPenaltyRateAdaptive = _TRUE;
	btdm8723.bRejectAggrePkt = _FALSE;

	if (BTDM_IsHT40(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("HT40\n"));
		if (BTDM_IsWifiUplink(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi Uplink\n"));
			// coex table
			btdm8723.val0x6c0 = 0x5a5a5a5a;
			btdm8723.val0x6c8 = 0xcc;
			btdm8723.val0x6cc = 0x3;
			// sw mechanism
			btdm8723.bAgcTableEn = _FALSE;
			btdm8723.bAdcBackOffOn = _TRUE;
			btdm8723.bSwDacSwingOn = _FALSE;
			// fw mechanism
			btdm8723.bTdmaOn = _TRUE;
			btdm8723.tdmaDacSwing = TDMA_DAC_SWING_ON;
			btSpec = BTHCI_GetBTCoreSpecByProf(padapter, BT_PROFILE_A2DP);
			if (btSpec >= BT_SPEC_2_1_EDR)
			{
				btdm8723.wlanActHi = 0x20;
				btdm8723.wlanActLo = 0x18;
			}
			else
			{
				btdm8723.wlanActHi = 0x20;
				btdm8723.wlanActLo = 0x20;
			}
			btdm8723.btRetryIndex = 2;
			btdm8723.fwDacSwingLvl = 0x20;
		}
		else
		{
			RTPRINT (FBT, BT_TRACE, ("Wifi Downlink\n"));
			// coex table
			btdm8723.val0x6c0 = 0x5a5a5a5a;
			btdm8723.val0x6c8 = 0xcc;
			btdm8723.val0x6cc = 0x3;
			// sw mechanism
			btdm8723.bAgcTableEn = _FALSE;
			btdm8723.bAdcBackOffOn = _TRUE;
			btdm8723.bSwDacSwingOn = _FALSE;
			// fw mechanism
			btdm8723.bTdmaOn = _TRUE;
			btdm8723.tdmaDacSwing = TDMA_DAC_SWING_ON;
			btSpec = BTHCI_GetBTCoreSpecByProf(padapter, BT_PROFILE_A2DP);
			if (btSpec >= BT_SPEC_2_1_EDR)
			{
				btdm8723.wlanActHi = 0x20;
				btdm8723.wlanActLo = 0x18;
			}
			else
			{
				btdm8723.wlanActHi = 0x20;
				btdm8723.wlanActLo = 0x20;
			}
			btdm8723.btRetryIndex = 2;
			btdm8723.fwDacSwingLvl = 0xc0;
		}
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_47, 0);

		if (BTDM_IsWifiUplink(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi Uplink\n"));
			// coex table
			btdm8723.val0x6c0 = 0x5a5a5a5a;
			btdm8723.val0x6c8 = 0xcc;
			btdm8723.val0x6cc = 0x3;
			// sw mechanism
			if ((btRssiState == BT_RSSI_STATE_HIGH) ||
				(btRssiState == BT_RSSI_STATE_STAY_HIGH))
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
				btdm8723.bAgcTableEn = _TRUE;
				btdm8723.bAdcBackOffOn = _TRUE;
				btdm8723.bSwDacSwingOn = _FALSE;
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
				btdm8723.bAgcTableEn = _FALSE;
				btdm8723.bAdcBackOffOn = _FALSE;
				btdm8723.bSwDacSwingOn = _FALSE;
			}
			// fw mechanism
			btdm8723.bTdmaOn = _TRUE;
			btdm8723.tdmaDacSwing = TDMA_DAC_SWING_ON;
			btSpec = BTHCI_GetBTCoreSpecByProf(padapter, BT_PROFILE_A2DP);
			if (btSpec >= BT_SPEC_2_1_EDR)
			{
				btdm8723.wlanActHi = 0x20;
				btdm8723.wlanActLo = 0x18;
			}
			else
			{
				btdm8723.wlanActHi = 0x20;
				btdm8723.wlanActLo = 0x20;
			}
			btdm8723.btRetryIndex = 2;
			btdm8723.fwDacSwingLvl = 0x20;
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi Downlink\n"));
			// coex table
			btdm8723.val0x6c0 = 0x5a5a5a5a;
			btdm8723.val0x6c8 = 0xcc;
			btdm8723.val0x6cc = 0x3;
			// sw mechanism
			if ((btRssiState == BT_RSSI_STATE_HIGH) ||
				(btRssiState == BT_RSSI_STATE_STAY_HIGH))
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
				btdm8723.bAgcTableEn = _TRUE;
				btdm8723.bAdcBackOffOn = _TRUE;
				btdm8723.bSwDacSwingOn = _FALSE;
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
				btdm8723.bAgcTableEn = _FALSE;
				btdm8723.bAdcBackOffOn = _FALSE;
				btdm8723.bSwDacSwingOn = _FALSE;
			}
			// fw mechanism
			btdm8723.bTdmaOn = _TRUE;
			btdm8723.tdmaDacSwing = TDMA_DAC_SWING_ON;
			btSpec = BTHCI_GetBTCoreSpecByProf(padapter, BT_PROFILE_A2DP);
			if (btSpec >= BT_SPEC_2_1_EDR)
			{
				btdm8723.wlanActHi = 0x20;
				btdm8723.wlanActLo = 0x18;
			}
			else
			{
				btdm8723.wlanActHi = 0x20;
				btdm8723.wlanActLo = 0x20;
			}
			btdm8723.btRetryIndex = 2;
			btdm8723.fwDacSwingLvl = 0xc0;
		}
	}

	if (btdm_NeedToDecBtPwr(padapter))
	{
		btdm8723.bDecBtPwr = _TRUE;
	}

