acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
	if (BTDM_IsCoexistStateChanged(padapter))
	{
		btdm_SetBtdm(padapter, &btdm8723);
	}
}

void btdm_2Ant8723AAclOnlyBusy(PADAPTER padapter)
{
	BTDM_8723A_2ANT		btdm8723;
	u8	btRssiState, btRssiState1, btSpec;


	btdm_BtdmStrctureReload(padapter, &btdm8723);

	btdm8723.bRfRxLpfShrink = _TRUE;
	btdm8723.bLowPenaltyRateAdaptive = _TRUE;
	btdm8723.bRejectAggrePkt = _FALSE;

	if (BTDM_IsHT40(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("HT40\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 37, 0);

		// coex table
		btdm8723.val0x6c0 = 0x55555555;
		btdm8723.val0x6c8 = 0xffff;
		btdm8723.val0x6cc = 0x3;
		btdm8723.bIgnoreWlanAct = _FALSE;
		// sw mechanism
		btdm8723.bAgcTableEn = _FALSE;
		btdm8723.bAdcBackOffOn = _TRUE;
		btdm8723.bSwDacSwingOn = _FALSE;
		// fw mechanism
		if ((btRssiState == BT_RSSI_STATE_HIGH) ||
			(btRssiState == BT_RSSI_STATE_STAY_HIGH))
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi high\n"));
			// only rssi high we need to do this,
			// when rssi low, the value will modified by fw
			rtw_write8(padapter, 0x883, 0x40);

			btdm8723.bPsTdmaOn = _TRUE;
			btdm8723.psTdmaByte[0] = 0xa3;
			btdm8723.psTdmaByte[1] = 0xf;
			btdm8723.psTdmaByte[2] = 0xf;
			btdm8723.psTdmaByte[3] = 0x81;
			btdm8723.psTdmaByte[4] = 0x80;

			btdm8723.bTraTdmaOn = _FALSE;
			btdm8723.bTdmaOn = _FALSE;
			btdm8723.tdmaDacSwing = TDMA_DAC_SWING_OFF;
			btdm8723.b2AntHidEn = _FALSE;
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
			btdm8723.bPsTdmaOn = _TRUE;
			btdm8723.psTdmaByte[0] = 0xa3;
			btdm8723.psTdmaByte[1] = 0xf;
			btdm8723.psTdmaByte[2] = 0xf;
			btdm8723.psTdmaByte[3] = 0x0;
			btdm8723.psTdmaByte[4] = 0x80;

			btdm8723.bTraTdmaOn = _FALSE;
			btdm8723.bTdmaOn = _FALSE;
			btdm8723.tdmaDacSwing = TDMA_DAC_SWING_OFF;
			btdm8723.b2AntHidEn = _FALSE;
		}
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 47, 0);
		btRssiState1 = BTDM_CheckCoexRSSIState1(padapter, 2, 27, 0);

		// coex table
		btdm8723.val0x6c0 = 0x55555555;
		btdm8723.val0x6c8 = 0xffff;
		btdm8723.val0x6cc = 0x3;
		btdm8723.bIgnoreWlanAct = _FALSE;
		// sw mechanism
		if ((btRssiState == BT_RSSI_STATE_HIGH) ||
			(btRssiState == BT_RSSI_STATE_STAY_HIGH))
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi-1 high \n"));
			btdm8723.bAgcTableEn = _TRUE;
			btdm8723.bAdcBackOffOn = _TRUE;
			btdm8723.bSwDacSwingOn = _FALSE;
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi-1 low \n"));
			btdm8723.bAgcTableEn = _FALSE;
			btdm8723.bAdcBackOffOn = _FALSE;
			btdm8723.bSwDacSwingOn = _FALSE;
		}
		// fw mechanism
		if ((btRssiState == BT_RSSI_STATE_HIGH) ||
			(btRssiState == BT_RSSI_STATE_STAY_HIGH))
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
			// only rssi high we need to do this,
			// when rssi low, the value will modified by fw
			rtw_write8(padapter, 0x883, 0x40);

			btdm8723.bPsTdmaOn = _TRUE;
			btdm8723.psTdmaByte[0] = 0xa3;
			btdm8723.psTdmaByte[1] = 0xf;
			btdm8723.psTdmaByte[2] = 0xf;
			btdm8723.psTdmaByte[3] = 0x81;
			btdm8723.psTdmaByte[4] = 0x80;

			btdm8723.bTraTdmaOn = _FALSE;
			btdm8723.bTdmaOn = _FALSE;
			btdm8723.tdmaDacSwing = TDMA_DAC_SWING_OFF;
			btdm8723.b2AntHidEn = _FALSE;
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
			btdm8723.bPsTdmaOn = _TRUE;
			btdm8723.psTdmaByte[0] = 0xa3;
			btdm8723.psTdmaByte[1] = 0xf;
			btdm8723.psTdmaByte[2] = 0xf;
			btdm8723.psTdmaByte[3] = 0x0;
			btdm8723.psTdmaByte[4] = 0x80;

			btdm8723.bTraTdmaOn = _FALSE;
			btdm8723.bTdmaOn = _FALSE;
			btdm8723.tdmaDacSwing = TDMA_DAC_SWING_OFF;
			btdm8723.b2AntHidEn = _FALSE;
		}
	}

	if (btdm_NeedToDecBtPwr(padapter))
	{
		btdm8723.bDecBtPwr = _TRUE;
	}

	if (BTDM_IsCoexistStateChanged(padapter))
	{
		btdm_SetBtdm(padapter, &btdm8723);
	}
}

void btdm_2Ant8723AA2dpSinkActionNoProfile(PADAPTER padapter)
{
	BTDM_8723A_2ANT		btdm8723;
	u8	btRssiState, btSpec;


	btdm_BtdmStrctureReload(padapter, &btdm8723);

	btdm8723.bRfRxLpfShrink = _TRUE;
	btdm8723.bLowPenaltyRateAdaptive = _TRUE;
	btdm8723.bRejectAggrePkt = _FALSE;

	if (BTDM_IsHT40(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("HT40\n"));
		if (BTDM_IsWifiUplink(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi Uplink\n"));
			// coex table
			btdm8723.val0x6c0 = 0x5a5a5a5a;
			btdm8723.val0x6c8 = 0xcccc;
			btdm8723.val0x6cc = 0x3;
			// sw mechanism
			btdm8723.bAgcTableEn = _FALSE;
			btdm8723.bAdcBackOffOn = _TRUE;
			btdm8723.bSwDacSwingOn = _FALSE;
			// fw mechanism
			btdm8723.bTraTdmaOn = _FALSE;
			btdm8723.bTdmaOn = _FALSE;
			btdm8723.tdmaDacSwing = TDMA_DAC_SWING_OFF;
			btdm8723.b2AntHidEn = _FALSE;

			btdm8723.bPsTdmaOn = _TRUE;
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi Downlink\n"));
			// coex table
			btdm8723.val0x6c0 = 0x5a5a5a5a;
			btdm8723.val0x6c8 = 0xcc;
			btdm8723.val0x6cc = 0x3;
			// sw mechanism
			btdm8723.bAgcTableEn = _FALSE;
			btdm8723.bAdcBackOffOn = _TRUE;
			btdm8723.bSwDacSwingOn = _FALSE;
			// fw mechanism
			btdm8723.bTraTdmaOn = _FALSE;
			btdm8723.bTdmaOn = _FALSE;
			btdm8723.tdmaDacSwing = TDMA_DAC_SWING_OFF;
			btdm8723.b2AntHidEn = _FALSE;

			btdm8723.bPsTdmaOn = _TRUE;
		}
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, BT_FW_COEX_THRESH_47, 0);

		if (BTDM_IsWifiUplink(padapter))
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi Uplink\n"));
			// coex table
			btdm8723.val0x6c0 = 0x5a5a5a5a;
			btdm8723.val0x6c8 = 0xcccc;
			btdm8723.val0x6cc = 0x3;
			// sw mechanism
			if ((btRssiState == BT_RSSI_STATE_HIGH) ||
				(btRssiState == BT_RSSI_STATE_STAY_HIGH))
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
				btdm8723.bAgcTableEn = _TRUE;
				btdm8723.bAdcBackOffOn = _TRUE;
				btdm8723.bSwDacSwingOn = _FALSE;
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
				btdm8723.bAgcTableEn = _FALSE;
				btdm8723.bAdcBackOffOn = _FALSE;
				btdm8723.bSwDacSwingOn = _FALSE;
			}
			// fw mechanism
			btdm8723.bTraTdmaOn = _FALSE;
			btdm8723.bTdmaOn = _FALSE;
			btdm8723.tdmaDacSwing = TDMA_DAC_SWING_OFF;
			btdm8723.b2AntHidEn = _FALSE;

			btdm8723.bPsTdmaOn = _TRUE;
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi Downlink\n"));
			// coex table
			btdm8723.val0x6c0 = 0x5a5a5a5a;
			btdm8723.val0x6c8 = 0xcc;
			btdm8723.val0x6cc = 0x3;
			// sw mechanism
			if ((btRssiState == BT_RSSI_STATE_HIGH) ||
				(btRssiState == BT_RSSI_STATE_STAY_HIGH))
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
				btdm8723.bAgcTableEn = _TRUE;
				btdm8723.bAdcBackOffOn = _TRUE;
				btdm8723.bSwDacSwingOn = _FALSE;
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
				btdm8723.bAgcTableEn = _FALSE;
				btdm8723.bAdcBackOffOn = _FALSE;
				btdm8723.bSwDacSwingOn = _FALSE;
			}
			// fw mechanism
			btdm8723.bTraTdmaOn = _FALSE;
			btdm8723.bTdmaOn = _FALSE;
			btdm8723.tdmaDacSwing = TDMA_DAC_SWING_OFF;
			btdm8723.b2AntHidEn = _FALSE;

			btdm8723.bPsTdmaOn = _TRUE;
		}
	}

	if (btdm_NeedToDecBtPwr(padapter))
	{
		btdm8723.bDecBtPwr = _TRUE;
	}

