acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT btInqPageStartTime = 0x%"i64fmt"x, btTxRxCntLvl = %d\n",
			pHalData->bt_coexist.halCoex8723.btInqPageStartTime, btTxRxCntLvl));
	if( (pHalData->bt_coexist.halCoex8723.btInqPageStartTime) ||
		(BT_TXRX_CNT_LEVEL_3 == btTxRxCntLvl) )
	{
		btdm8723.bPsTdmaOn = _TRUE;
		btdm8723.psTdmaByte[0] = 0xa3;
		btdm8723.psTdmaByte[1] = 0x5;
		btdm8723.psTdmaByte[2] = 0x5;
		btdm8723.psTdmaByte[3] = 0x2;
		btdm8723.psTdmaByte[4] = 0x80;
		btdm8723.bIgnoreWlanAct = _TRUE;

	}

	if(BTDM_IsCoexistStateChanged(padapter))
	{
		btdm_SetBtdm(padapter, &btdm8723);
	}
}
void btdm_2Ant8723AFtpA2dp(	PADAPTER	padapter	)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	BTDM_8723A_2ANT		btdm8723;
	u1Byte			btSpec, btRssiState, btRssiState1;
	u1Byte			btTxRxCntLvl=0;

	btdm_BtdmStrctureReload(padapter, &btdm8723);

	btdm8723.bRfRxLpfShrink = _TRUE;
	btdm8723.bLowPenaltyRateAdaptive = _TRUE;
	btdm8723.bRejectAggrePkt = _FALSE;

	btTxRxCntLvl = btdm_BtTxRxCounterLevel(padapter);

	if(BTDM_IsHT40(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("HT40\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 37, 0);

		// coex table
		btdm8723.val0x6c0 = 0x55555555;
		btdm8723.val0x6c8 = 0xffff;
		btdm8723.val0x6cc = 0x3;

		// sw mechanism
		btdm8723.bAgcTableEn = _FALSE;
		btdm8723.bAdcBackOffOn = _TRUE;
		btdm8723.bSwDacSwingOn = _FALSE;

		// fw mechanism
		btdm8723.bPsTdmaOn = _TRUE;
		if( (btRssiState == BT_RSSI_STATE_HIGH) ||
			(btRssiState == BT_RSSI_STATE_STAY_HIGH) )
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
			if(BT_TXRX_CNT_LEVEL_2 == btTxRxCntLvl)
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT TxRx Counters >= 1400\n"));
				btdm8723.psTdmaByte[0] = 0xa3;
				btdm8723.psTdmaByte[1] = 0x5;
				btdm8723.psTdmaByte[2] = 0x5;
				btdm8723.psTdmaByte[3] = 0x81;
				btdm8723.psTdmaByte[4] = 0x80;
			}
			else if(BT_TXRX_CNT_LEVEL_1 == btTxRxCntLvl)
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT TxRx Counters >= 1200 && < 1400\n"));
				btdm8723.psTdmaByte[0] = 0xa3;
				btdm8723.psTdmaByte[1] = 0xa;
				btdm8723.psTdmaByte[2] = 0xa;
				btdm8723.psTdmaByte[3] = 0x81;
				btdm8723.psTdmaByte[4] = 0x80;
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT TxRx Counters < 1200\n"));
				btdm8723.psTdmaByte[0] = 0xa3;
				btdm8723.psTdmaByte[1] = 0xf;
				btdm8723.psTdmaByte[2] = 0xf;
				btdm8723.psTdmaByte[3] = 0x81;
				btdm8723.psTdmaByte[4] = 0x80;
			}
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
			if(BT_TXRX_CNT_LEVEL_2 == btTxRxCntLvl)
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT TxRx Counters >= 1400\n"));
				btdm8723.psTdmaByte[0] = 0xa3;
				btdm8723.psTdmaByte[1] = 0x5;
				btdm8723.psTdmaByte[2] = 0x5;
				btdm8723.psTdmaByte[3] = 0x0;
				btdm8723.psTdmaByte[4] = 0x80;
			}
			else if(BT_TXRX_CNT_LEVEL_1 == btTxRxCntLvl)
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT TxRx Counters >= 1200 && < 1400\n"));
				btdm8723.psTdmaByte[0] = 0xa3;
				btdm8723.psTdmaByte[1] = 0xa;
				btdm8723.psTdmaByte[2] = 0xa;
				btdm8723.psTdmaByte[3] = 0x0;
				btdm8723.psTdmaByte[4] = 0x80;
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT TxRx Counters < 1200\n"));
				btdm8723.psTdmaByte[0] = 0xa3;
				btdm8723.psTdmaByte[1] = 0xf;
				btdm8723.psTdmaByte[2] = 0xf;
				btdm8723.psTdmaByte[3] = 0x0;
				btdm8723.psTdmaByte[4] = 0x80;
			}
		}
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 47, 0);
		btRssiState1 = BTDM_CheckCoexRSSIState1(padapter, 2, 27, 0);

		// coex table
		btdm8723.val0x6c0 = 0x55555555;
		btdm8723.val0x6c8 = 0xffff;
		btdm8723.val0x6cc = 0x3;

		// sw mechanism
		if( (btRssiState == BT_RSSI_STATE_HIGH) ||
			(btRssiState == BT_RSSI_STATE_STAY_HIGH) )
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
			btdm8723.bAgcTableEn = _TRUE;
			btdm8723.bAdcBackOffOn = _TRUE;
			btdm8723.bSwDacSwingOn = _FALSE;
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
			btdm8723.bAgcTableEn = _FALSE;
			btdm8723.bAdcBackOffOn = _FALSE;
			btdm8723.bSwDacSwingOn = _FALSE;
		}

		// fw mechanism
		btdm8723.bPsTdmaOn = _TRUE;
		if( (btRssiState1 == BT_RSSI_STATE_HIGH) ||
			(btRssiState1 == BT_RSSI_STATE_STAY_HIGH) )
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi-1 high \n"));
			// only rssi high we need to do this,
			// when rssi low, the value will modified by fw
			rtw_write8(padapter, 0x883, 0x40);
			if(BT_TXRX_CNT_LEVEL_2 == btTxRxCntLvl)
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT TxRx Counters >= 1400\n"));
				btdm8723.psTdmaByte[0] = 0xa3;
				btdm8723.psTdmaByte[1] = 0x5;
				btdm8723.psTdmaByte[2] = 0x5;
				btdm8723.psTdmaByte[3] = 0x81;
				btdm8723.psTdmaByte[4] = 0x80;
			}
			else if(BT_TXRX_CNT_LEVEL_1 == btTxRxCntLvl)
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT TxRx Counters >= 1200 && < 1400\n"));
				btdm8723.psTdmaByte[0] = 0xa3;
				btdm8723.psTdmaByte[1] = 0xa;
				btdm8723.psTdmaByte[2] = 0xa;
				btdm8723.psTdmaByte[3] = 0x81;
				btdm8723.psTdmaByte[4] = 0x80;
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT TxRx Counters < 1200\n"));
				btdm8723.psTdmaByte[0] = 0xa3;
				btdm8723.psTdmaByte[1] = 0xf;
				btdm8723.psTdmaByte[2] = 0xf;
				btdm8723.psTdmaByte[3] = 0x81;
				btdm8723.psTdmaByte[4] = 0x80;
			}
		}
		else
		{
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi-1 low \n"));
			if(BT_TXRX_CNT_LEVEL_2 == btTxRxCntLvl)
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT TxRx Counters >= 1400\n"));
				btdm8723.psTdmaByte[0] = 0xa3;
				btdm8723.psTdmaByte[1] = 0x5;
				btdm8723.psTdmaByte[2] = 0x5;
				btdm8723.psTdmaByte[3] = 0x0;
				btdm8723.psTdmaByte[4] = 0x80;
			}
			else if(BT_TXRX_CNT_LEVEL_1 == btTxRxCntLvl)
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT TxRx Counters >= 1200 && < 1400\n"));
				btdm8723.psTdmaByte[0] = 0xa3;
				btdm8723.psTdmaByte[1] = 0xa;
				btdm8723.psTdmaByte[2] = 0xa;
				btdm8723.psTdmaByte[3] = 0x0;
				btdm8723.psTdmaByte[4] = 0x80;
			}
			else
			{
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT TxRx Counters < 1200\n"));
				btdm8723.psTdmaByte[0] = 0xa3;
				btdm8723.psTdmaByte[1] = 0xf;
				btdm8723.psTdmaByte[2] = 0xf;
				btdm8723.psTdmaByte[3] = 0x0;
				btdm8723.psTdmaByte[4] = 0x80;
			}
		}
	}

	if(btdm_NeedToDecBtPwr(padapter))
	{
		btdm8723.bDecBtPwr = _TRUE;
	}

