acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT btInqPageStartTime = 0x%"i64fmt"x, btTxRxCntLvl = %d\n",
			pHalData->bt_coexist.halCoex8723.btInqPageStartTime, btTxRxCntLvl));
	if( (pHalData->bt_coexist.halCoex8723.btInqPageStartTime) ||
		(BT_TXRX_CNT_LEVEL_3 == btTxRxCntLvl) )
	{
		btdm8723.bPsTdmaOn = _TRUE;
		btdm8723.psTdmaByte[0] = 0xa3;
		btdm8723.psTdmaByte[1] = 0x5;
		btdm8723.psTdmaByte[2] = 0x5;
		btdm8723.psTdmaByte[3] = 0x83;
		btdm8723.psTdmaByte[4] = 0x80;
		btdm8723.bIgnoreWlanAct = _TRUE;
	}

	if(BTDM_IsCoexistStateChanged(padapter))
	{
		btdm_SetBtdm(padapter, &btdm8723);
	}
}


//============================================================
// extern function start with BTDM_
//============================================================
void BTDM_ForceA2dpSink(PADAPTER padapter, u8 type)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	pHalData->bt_coexist.halCoex8723.bForceA2dpSink = (u8)type;

	DbgPrint("cosa force bt A2dp sink = %d\n",
		pHalData->bt_coexist.halCoex8723.bForceA2dpSink);
}

void BTDM_2AntParaInit(PADAPTER padapter)
{
	// Enable counter statistics
	rtw_write8(padapter, 0x76e, 0x4);
	rtw_write8(padapter, 0x778, 0x3);
	rtw_write8(padapter, 0x40, 0x20);
	rtw_write32(padapter, 0x6c0, 0x55555555);
	rtw_write16(padapter, 0x6c8, 0xffff);
	rtw_write8(padapter, 0x6cc, 0x3);
}

void BTDM_2AntHwCoexAllOff8723A(PADAPTER padapter)
{
	btdm_SetCoexTable(padapter, 0x5a5aaaaa, 0xcc, 0x3);
	btdm_SetHwPtaMode(padapter, _FALSE);
}

void BTDM_2AntFwCoexAllOff8723A(PADAPTER padapter)
{
	BTDM_SetFw3a(padapter, 0x0, 0x0, 0x0, 0x8, 0x0); 	// Antenna control by PTA, 0x870 = 0x300.
	btdm_SetFw2AntHID(padapter, _FALSE, _FALSE);
	btdm_SetFwTraTdmaCtrl(padapter, _FALSE, TDMA_2ANT, TDMA_NAV_OFF);
	btdm_SetFwTdmaCtrl(padapter, _FALSE, TDMA_2ANT, TDMA_NAV_OFF, TDMA_DAC_SWING_OFF);
	btdm_SetFwDacSwingLevel(padapter, BT_DACSWING_OFF);
	btdm_SetFwBtHidInfo(padapter, _FALSE);
	btdm_SetFwBtRetryIndex(padapter, 2);
	btdm_SetFwWlanAct(padapter, 0x10, 0x10);
	BTDM_SetFwDecBtPwr(padapter, _FALSE);
}

void BTDM_2AntSwCoexAllOff8723A(PADAPTER padapter)
{
	BTDM_AGCTable(padapter, BT_AGCTABLE_OFF);
	BTDM_BBBackOffLevel(padapter, BT_BB_BACKOFF_OFF);
	BTDM_RejectAPAggregatedPacket(padapter, _FALSE);

	BTDM_SetSwPenaltyTxRateAdaptive(padapter, BT_TX_RATE_ADAPTIVE_NORMAL);
	BTDM_SetSwRfRxLpfCorner(padapter, BT_RF_RX_LPF_CORNER_RESUME);
	btdm_SetSwFullTimeDacSwing(padapter, _FALSE, 0xc0);
}

void BTDM_2AntAdjustForBtOperation8723(PADAPTER padapter)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(padapter);
	PBTDM_8723A_2ANT	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm2Ant;
	BTDM_8723A_2ANT	btdmAdjust;

	_rtw_memcpy(&btdmAdjust, pBtdm8723, sizeof(BTDM_8723A_2ANT));
	switch (pBtMgnt->ExtConfig.btOperationCode)
	{
		case HCI_BT_OP_NONE:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for operation None!!\n"));
			break;
		case HCI_BT_OP_INQUIRY_START:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for Inquiry start!!\n"));
			pBtMgnt->ExtConfig.bHoldForBtOperation = _TRUE;
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_INQ_PAGE;
			if(!pBtdm8723->bIgnoreWlanAct)
			{
				RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : need to ignore wlanAct!!\n"));
				btdmAdjust.bIgnoreWlanAct = _TRUE;
				btdm_SetBtdm(padapter, &btdmAdjust);
			}
			break;
		case HCI_BT_OP_INQUIRY_FINISH:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for Inquiry finished!!\n"));
			pBtMgnt->ExtConfig.bHoldForBtOperation = _FALSE;
			pHalData->bt_coexist.CurrentState &=~ BT_COEX_STATE_BT_INQ_PAGE;
			break;
		case HCI_BT_OP_PAGING_START:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for paging start!!\n"));
			pBtMgnt->ExtConfig.bHoldForBtOperation = _TRUE;
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_INQ_PAGE;
			if(!pBtdm8723->bIgnoreWlanAct)
			{
				RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : need to ignore wlanAct!!\n"));
				btdmAdjust.bIgnoreWlanAct = _TRUE;
				btdm_SetBtdm(padapter, &btdmAdjust);
			}
			break;
		case HCI_BT_OP_PAGING_SUCCESS:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for paging successfully!!\n"));
			pBtMgnt->ExtConfig.bHoldForBtOperation = _FALSE;
			pHalData->bt_coexist.CurrentState &=~ BT_COEX_STATE_BT_INQ_PAGE;
			break;
		case HCI_BT_OP_PAGING_UNSUCCESS:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for paging unsuccessfully!!\n"));
			pBtMgnt->ExtConfig.bHoldForBtOperation = _FALSE;
			pHalData->bt_coexist.CurrentState &=~ BT_COEX_STATE_BT_INQ_PAGE;
			break;
		case HCI_BT_OP_PAIRING_START:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for Pairing start!!\n"));
			pBtMgnt->ExtConfig.bHoldForBtOperation = _TRUE;
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_INQ_PAGE;
			if(!pBtdm8723->bIgnoreWlanAct)
			{
				RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : need to ignore wlanAct!!\n"));
				btdmAdjust.bIgnoreWlanAct = _TRUE;
				btdm_SetBtdm(padapter, &btdmAdjust);
			}
			break;
		case HCI_BT_OP_PAIRING_FINISH:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for Pairing finished!!\n"));
			pBtMgnt->ExtConfig.bHoldForBtOperation = _FALSE;
			pHalData->bt_coexist.CurrentState &=~ BT_COEX_STATE_BT_INQ_PAGE;
			break;

		case HCI_BT_OP_BT_DEV_ENABLE:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for BT Device enable!!\n"));
			break;
		case HCI_BT_OP_BT_DEV_DISABLE:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for BT Device disable!!\n"));
			break;
		default:
			RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("[BT OP] : Adjust for Unknown, error!!\n"));
			break;
	}
}


VOID
BTDM_2AntFwC2hBtInfo8723A(
	PADAPTER	padapter
	)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u1Byte	btInfo=0;

	btInfo = pHalData->bt_coexist.halCoex8723.c2hBtInfoOriginal;

	// check BIT2 first ==> check if bt is under inquiry or page scan
	if(btInfo & BIT(2))
	{
		pHalData->bt_coexist.halCoex8723.bC2hBtInquiryPage = _TRUE;
	}
	else
	{
		pHalData->bt_coexist.halCoex8723.bC2hBtInquiryPage = _FALSE;
	}

	if(btInfo&BTINFO_B_CONNECTION)
	{
		RTPRINT(FBT, BT_TRACE, ("[BTC2H], BTInfo: bConnect=TRUE\n"));
		pBtMgnt->ExtConfig.bBTBusy = _TRUE;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_IDLE;
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[BTC2H], BTInfo: bConnect=FALSE\n"));
		pBtMgnt->ExtConfig.bBTBusy = _FALSE;
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_IDLE;
	}
//From
	BTDM_CheckWiFiState(padapter);
	if(pBtMgnt->ExtConfig.bManualControl)
	{
		RTPRINT(FBT, BT_TRACE, ("Action Manual control, won't execute bt coexist mechanism!!\n"));
		return;
	}
}


void BTDM_2AntBtCoexist8723A(PADAPTER padapter)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PBT_DBG 		pBtDbg = &pBTInfo->BtDbg;
	u8				BtState = 0, btInfoOriginal=0, btRetryCnt=0;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (BTDM_BtProfileSupport(padapter))
	{
		BTHCI_GetProfileNameMoto(padapter);
		btdm_BtCommonStateUpdate2Ant8723A(padapter);
		BTDM_CheckWiFiState(padapter);
		if (pBtMgnt->ExtConfig.bHoldForBtOperation)
		{
			RTPRINT(FBT, BT_TRACE, ("Action for BT Operation adjust!!\n"));
			return;
		}
		if (pBtDbg->dbgCtrl)
		{
			RTPRINT(FBT, BT_TRACE, ("[Dbg control], "));
		}

