acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
		BTDM_ResetActionProfileState(padapter);
		if (BTDM_IsActionSCO(padapter))
		{
			pBtMgnt->ExtConfig.btProfileCase = BT_COEX_MECH_SCO;
			btdm_BtStateUpdate2Ant8723ASco(padapter);
			if (btdm_Is2Ant8723ACommonAction(padapter))
			{
				pBtMgnt->ExtConfig.btProfileAction = BT_COEX_MECH_COMMON;
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant common.\n"));
			}
			else
			{
				pBtMgnt->ExtConfig.btProfileAction = BT_COEX_MECH_SCO;
				RTPRINT(FBT, BT_TRACE, ("Action SCO\n"));
				btdm_2Ant8723ASCOAction(padapter);
			}
		}
		else if (BTDM_IsActionHID(padapter))
		{
			pBtMgnt->ExtConfig.btProfileCase = BT_COEX_MECH_HID;
			btdm_BtStateUpdate2Ant8723AHid(padapter);
			pBtMgnt->ExtConfig.btProfileAction = BT_COEX_MECH_HID;
			RTPRINT(FBT, BT_TRACE, ("Action HID\n"));
			btdm_2Ant8723AHIDAction(padapter);
		}
		else if (BTDM_IsActionA2DP(padapter))
		{
			pBtMgnt->ExtConfig.btProfileCase = BT_COEX_MECH_A2DP;
			btdm_BtStateUpdate2Ant8723AA2dp(padapter);
			if (btdm_Is2Ant8723ACommonAction(padapter))
			{
				pBtMgnt->ExtConfig.btProfileAction = BT_COEX_MECH_COMMON;
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant common.\n"));
			}
			else
			{
				pBtMgnt->ExtConfig.btProfileAction = BT_COEX_MECH_A2DP;
				RTPRINT(FBT, BT_TRACE, ("Action A2DP for ACL only busy\n"));
//				btdm_2Ant8723AA2DPAction(padapter);
				btdm_2Ant8723AAclOnlyBusy(padapter);
			}
		}
		else if (BTDM_IsActionPAN(padapter))
		{
			pBtMgnt->ExtConfig.btProfileCase = BT_COEX_MECH_PAN;
			btdm_BtStateUpdate2Ant8723APan(padapter);
			if (btdm_Is2Ant8723ACommonAction(padapter))
			{
				pBtMgnt->ExtConfig.btProfileAction = BT_COEX_MECH_COMMON;
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant common.\n"));
			}
			else
			{
				pBtMgnt->ExtConfig.btProfileAction = BT_COEX_MECH_PAN;
				RTPRINT(FBT, BT_TRACE, ("Action PAN\n"));
				btdm_2Ant8723APANAction(padapter);
			}
		}
		else if (BTDM_IsActionHIDA2DP(padapter))
		{
			pBtMgnt->ExtConfig.btProfileCase = BT_COEX_MECH_HID_A2DP;
			btdm_BtStateUpdate2Ant8723AHidA2dp(padapter);
			RTPRINT(FBT, BT_TRACE, ("Action HID_A2DP\n"));
			pBtMgnt->ExtConfig.btProfileAction = BT_COEX_MECH_HID_A2DP;
			btdm_2Ant8723AHIDA2DPAction(padapter);
		}
		else if (BTDM_IsActionHIDPAN(padapter))
		{
			pBtMgnt->ExtConfig.btProfileCase = BT_COEX_MECH_HID_PAN;
			btdm_BtStateUpdate2Ant8723AHidPan(padapter);
			pBtMgnt->ExtConfig.btProfileAction = BT_COEX_MECH_HID_PAN;
			RTPRINT(FBT, BT_TRACE, ("Action HID_PAN\n"));
			btdm_2Ant8723AHIDPANAction(padapter);
		}
		else if (BTDM_IsActionPANA2DP(padapter))
		{
			pBtMgnt->ExtConfig.btProfileCase = BT_COEX_MECH_PAN_A2DP;
			btdm_BtStateUpdate2Ant8723APanA2dp(padapter);
			if (btdm_Is2Ant8723ACommonAction(padapter))
			{
				pBtMgnt->ExtConfig.btProfileAction = BT_COEX_MECH_COMMON;
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant common.\n"));
			}
			else
			{
				pBtMgnt->ExtConfig.btProfileAction = BT_COEX_MECH_PAN_A2DP;
				RTPRINT(FBT, BT_TRACE, ("Action PAN_A2DP\n"));
				btdm_2Ant8723APANA2DPAction(padapter);
			}
		}
		else
		{
			pBtMgnt->ExtConfig.btProfileCase = BT_COEX_MECH_NONE;
			RTPRINT(FBT, BT_TRACE, ("No Action Matched \n"));
			btdm_Is2Ant8723ACommonAction(padapter);
			pBtMgnt->ExtConfig.btProfileAction = BT_COEX_MECH_COMMON;
			RTPRINT(FBT, BT_TRACE, ("Action 2-Ant common.\n"));
		}
	}
	else
	{
		#if 1
		RTPRINT(FBT, BT_TRACE, ("[BTCoex] Get bt info by fw!!\n"));
		//msg shows c2h rsp for bt_info is received or not.
		if (pHalData->bt_coexist.halCoex8723.bC2hBtInfoReqSent)
		{
			RTPRINT(FBT, BT_TRACE, ("[BTCoex] c2h for btInfo not rcvd yet!!\n"));
		}

		btRetryCnt = pHalData->bt_coexist.halCoex8723.btRetryCnt;
		btInfoOriginal = pHalData->bt_coexist.halCoex8723.c2hBtInfoOriginal;

		// when bt inquiry or page scan, we have to set h2c 0x25
		// ignore wlanact for continuous 4x2secs
		btdm_BtInqPageMonitor(padapter);
		BTDM_ResetActionProfileState(padapter);

				if (btdm_Is2Ant8723ACommonAction(padapter))
				{
			pBtMgnt->ExtConfig.btProfileCase = BT_COEX_MECH_COMMON;
					pBtMgnt->ExtConfig.btProfileAction = BT_COEX_MECH_COMMON;
					RTPRINT(FBT, BT_TRACE, ("Action 2-Ant common.\n"));
				}
				else
				{
			if( (btInfoOriginal&BTINFO_B_HID) ||
				(btInfoOriginal&BTINFO_B_SCO_BUSY) ||
				(btInfoOriginal&BTINFO_B_SCO_ESCO) )
					{
				pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BTINFO_B_HID_SCOESCO;
				pBtMgnt->ExtConfig.btProfileCase = BT_COEX_MECH_HID_SCO_ESCO;
				pBtMgnt->ExtConfig.btProfileAction = BT_COEX_MECH_HID_SCO_ESCO;
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BTInfo: bHid|bSCOBusy|bSCOeSCO\n"));
				btdm_2Ant8723AHidScoEsco(padapter);
				}
			else if( (btInfoOriginal&BTINFO_B_FTP) ||
				(btInfoOriginal&BTINFO_B_A2DP) )
				{
				pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BTINFO_B_FTP_A2DP;
				pBtMgnt->ExtConfig.btProfileCase = BT_COEX_MECH_FTP_A2DP;
				pBtMgnt->ExtConfig.btProfileAction = BT_COEX_MECH_FTP_A2DP;
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BTInfo: bFTP|bA2DP\n"));
				btdm_2Ant8723AFtpA2dp(padapter);
				}
				else
				{
				pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BTINFO_B_HID_SCOESCO;
				pBtMgnt->ExtConfig.btProfileCase = BT_COEX_MECH_NONE;
				pBtMgnt->ExtConfig.btProfileAction = BT_COEX_MECH_NONE;
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BTInfo: undefined case!!!!\n"));
				btdm_2Ant8723AHidScoEsco(padapter);
				}
		}
	#endif
	}
}

// ===== End of sync from SD7 driver HAL/BTCoexist/HalBtc87232Ant.c =====
#endif

#ifdef __HALBTC8723_C__ // HAL/BTCoexist/HalBtc8723.c
// ===== Below this line is sync from SD7 driver HAL/BTCoexist/HalBtc8723.c =====

static u8 btCoexDbgBuf[BT_TMP_BUF_SIZE];
const char *const BtProfileString[]={
	"NONE",
	"A2DP",
	"PAN",
	"HID",
	"SCO",
};
const char *const BtSpecString[]={
	"1.0b",
	"1.1",
	"1.2",
	"2.0+EDR",
	"2.1+EDR",
	"3.0+HS",
	"4.0",
};
const char *const BtLinkRoleString[]={
	"Master",
	"Slave",
};

u8 btdm_BtWifiAntNum(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	PBT_COEXIST_8723A	pBtCoex = &pHalData->bt_coexist.halCoex8723;

//	RTPRINT(FBT, BT_TRACE, ("%s pHalData->bt_coexist.BluetoothCoexist =%x pHalData->EEPROMBluetoothCoexist=%x \n",
//		__func__,pHalData->bt_coexist.BluetoothCoexist,pHalData->EEPROMBluetoothCoexist));
//	RTPRINT(FBT, BT_TRACE, ("%s pHalData->bt_coexist.BT_Ant_Num =%x pHalData->EEPROMBluetoothAntNum=%x \n",
//		__func__,pHalData->bt_coexist.BT_Ant_Num,pHalData->EEPROMBluetoothAntNum));
	if (Ant_x2 == pHalData->bt_coexist.BT_Ant_Num)
	{
		if (Ant_x2 == pBtCoex->TotalAntNum)
			return Ant_x2;
		else
			return Ant_x1;
	}
	else
	{
		return Ant_x1;
	}

