acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
	rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s = %d", "Bt is under inquiry/page/pair", \
		((pBtMgnt->ExtConfig.bHoldForBtOperation)? 1:0));
	DCMD_Printf(btCoexDbgBuf);

	if (pBtMgnt->ExtConfig.bManualControl)
	{
		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s", "Action Manual control!!");
		DCMD_Printf(btCoexDbgBuf);
	}
	else
	{
		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s = %d", "BT hci extension version", \
			pBtMgnt->ExtConfig.HCIExtensionVer);
		DCMD_Printf(btCoexDbgBuf);
		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s = %d / %d", "NumberOfHandle / NumberOfSCO", \
			pBtMgnt->ExtConfig.NumberOfHandle, pBtMgnt->ExtConfig.NumberOfSCO);
		DCMD_Printf(btCoexDbgBuf);
	}

	if (!pBtMgnt->ExtConfig.bManualControl)
	{
		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s = %s / %s ", "WIfi state", \
			((pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_LEGACY)? "Legacy": \
			(((pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_HT20)? "HT20":"HT40"))),
			((pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_IDLE)? "Idle":\
			((pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_UPLINK)? "Uplink":"Downlink")));
		DCMD_Printf(btCoexDbgBuf);
		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s = %s / %s", "Bt state", \
			((BTDM_IsBTBusy(padapter))? "Busy": "Idle"), ((BTDM_IsBTUplink(padapter))? "Uplink":"Downlink"));
		DCMD_Printf(btCoexDbgBuf);

		if (pBtDbg->dbgCtrl)
		{
			rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s =", "[Dbg control]");
			DCMD_Printf(btCoexDbgBuf);
		}

		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s =", "Profile case/Mechanism type");
		DCMD_Printf(btCoexDbgBuf);
		switch (pBtMgnt->ExtConfig.btProfileCase)
		{
			case BT_COEX_MECH_NONE:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " NONE");
				break;
			case BT_COEX_MECH_SCO:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " SCO");
				break;
			case BT_COEX_MECH_HID:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " HID");
				break;
			case BT_COEX_MECH_A2DP:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " A2DP");
				break;
			case BT_COEX_MECH_PAN:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " PAN");
				break;
			case BT_COEX_MECH_HID_A2DP:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " HID+A2DP");
				break;
			case BT_COEX_MECH_HID_PAN:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " HID+PAN");
				break;
			case BT_COEX_MECH_PAN_A2DP:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " PAN+A2DP");
				break;
			default:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " Undefined");
				break;
		}
		DCMD_Printf(btCoexDbgBuf);
		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " / ");
		DCMD_Printf(btCoexDbgBuf);
		switch (pBtMgnt->ExtConfig.btProfileAction)
		{
			case BT_COEX_MECH_NONE:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " NONE");
				break;
			case BT_COEX_MECH_SCO:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " SCO");
				break;
			case BT_COEX_MECH_HID:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " HID");
				break;
			case BT_COEX_MECH_A2DP:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " A2DP");
				break;
			case BT_COEX_MECH_PAN:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " PAN");
				break;
			case BT_COEX_MECH_HID_A2DP:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " HID+A2DP");
				break;
			case BT_COEX_MECH_HID_PAN:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " HID+PAN");
				break;
			case BT_COEX_MECH_PAN_A2DP:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " PAN+A2DP");
				break;
			case BT_COEX_MECH_COMMON:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " COMMON");
				break;
			default:
				rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, " Undefined");
				break;
		}
		DCMD_Printf(btCoexDbgBuf);

		if (!pBtMgnt->ExtConfig.bManualControl)
		{
			for (i=0; i<pBtMgnt->ExtConfig.NumberOfHandle; i++)
			{
				if (pBtMgnt->ExtConfig.HCIExtensionVer >= 1)
				{
					rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s = %s/ %s/ %s", "Bt link type/spec/role", \
						BtProfileString[pBtMgnt->ExtConfig.linkInfo[i].BTProfile],
						BtSpecString[pBtMgnt->ExtConfig.linkInfo[i].BTCoreSpec],
						BtLinkRoleString[pBtMgnt->ExtConfig.linkInfo[i].linkRole]);
					DCMD_Printf(btCoexDbgBuf);
				}
				else
				{
					rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s = %s/ %s", "Bt link type/spec", \
						BtProfileString[pBtMgnt->ExtConfig.linkInfo[i].BTProfile],
						BtSpecString[pBtMgnt->ExtConfig.linkInfo[i].BTCoreSpec]);
					DCMD_Printf(btCoexDbgBuf);
				}
			}
		}
	}

	// Sw mechanism
	if (!pBtMgnt->ExtConfig.bManualControl)
	{
		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s", "============[Sw BT Coex mechanism]============");
		DCMD_Printf(btCoexDbgBuf);
		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s = %d ", "Coex All off", \
			pBtCoex->btdm2Ant.bAllOff);
		DCMD_Printf(btCoexDbgBuf);
		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s = %d ", "Reject Aggre packet", \
			pBtCoex->btdm2Ant.bRejectAggrePkt);
		DCMD_Printf(btCoexDbgBuf);
		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s = %d ", "AGC Table", \
			pBtCoex->btdm2Ant.bAgcTableEn);
		DCMD_Printf(btCoexDbgBuf);
		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s = %d ", "ADC Backoff", \
			pBtCoex->btdm2Ant.bAdcBackOffOn);
		DCMD_Printf(btCoexDbgBuf);
		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s = %d ", "Low penalty RA", \
			pBtCoex->btdm2Ant.bLowPenaltyRateAdaptive);
		DCMD_Printf(btCoexDbgBuf);
		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s = %d ", "RF Rx LPF Shrink", \
			pBtCoex->btdm2Ant.bRfRxLpfShrink);
		DCMD_Printf(btCoexDbgBuf);
	}
	u4Tmp = PHY_QueryRFReg(padapter, PathA, 0x1e, 0xff0);
	rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s = 0x%x/ 0x%x", "RF-A, 0x1e[11:4]/original val", \
		u4Tmp, pHalData->bt_coexist.BtRfRegOrigin1E);
	DCMD_Printf(btCoexDbgBuf);

	// Fw mechanism
	if (!pBtMgnt->ExtConfig.bManualControl)
	{
		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s", "============[Fw BT Coex mechanism]============");
		DCMD_Printf(btCoexDbgBuf);
	}
	if (!pBtMgnt->ExtConfig.bManualControl)
	{
		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s = %d ", "2Ant+HID mode", \
		pBtCoex->btdm2Ant.b2AntHidEn);
		DCMD_Printf(btCoexDbgBuf);

		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s = 0x%x / 0x%x", "WLan Act Hi/Lo", \
			pBtCoex->btdm2Ant.wlanActHi, pBtCoex->btdm2Ant.wlanActLo);
		DCMD_Printf(btCoexDbgBuf);

		rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n %-35s = %d ", "BT retry index", \
			pBtCoex->btdm2Ant.btRetryIndex);
		DCMD_Printf(btCoexDbgBuf);

