acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
	// 8723 1Ant doesn't need to turn off bt coexist mechanism.
	if (BTDM_1Ant8723A(padapter))
		return;

	if (IS_HARDWARE_TYPE_8192C(padapter) ||
		IS_HARDWARE_TYPE_8192D(padapter) ||
		IS_HARDWARE_TYPE_8723A(padapter))
	{
		//
		// Before enter LPS, turn off FW BT Co-exist mechanism
		//
		if (ppwrctrl->bLeisurePs)
		{
			RTPRINT(FBT, BT_TRACE, ("[BT][DM], Before enter LPS, turn off all Coexist DM\n"));
			btdm_ResetFWCoexState(padapter);
			BTDM_CoexAllOff(padapter);
			BTDM_SetAntenna(padapter, BTDM_ANT_BT);
		}
	}
}

void BTDM_TurnOffBtCoexistBeforeEnterIPS(PADAPTER padapter)
{
//	PMGNT_INFO		pMgntInfo = &padapter->MgntInfo;
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
//	PRT_POWER_SAVE_CONTROL	pPSC = GET_POWER_SAVE_CONTROL(pMgntInfo);
	struct pwrctrl_priv *ppwrctrl = &padapter->pwrctrlpriv;

	if (!pHalData->bt_coexist.BluetoothCoexist)
		return;

	// 8723 1Ant doesn't need to turn off bt coexist mechanism.
	if (BTDM_1Ant8723A(padapter))
		return;

	if (IS_HARDWARE_TYPE_8192C(padapter) ||
		IS_HARDWARE_TYPE_8192D(padapter) ||
		IS_HARDWARE_TYPE_8723A(padapter))
	{
		//
		// Before enter IPS, turn off FW BT Co-exist mechanism
		//
//		if (pPSC->bInactivePs)
		if (ppwrctrl->reg_rfoff == rf_on)
		{
			RTPRINT(FBT, BT_TRACE, ("[BT][DM], Before enter IPS, turn off all Coexist DM\n"));
			btdm_ResetFWCoexState(padapter);
			BTDM_CoexAllOff(padapter);
			BTDM_SetAntenna(padapter, BTDM_ANT_BT);
		}
	}
}

void BTDM_Coexist(PADAPTER padapter)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);

	if (!pHalData->bt_coexist.BluetoothCoexist)
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], BT not exists!!\n"));
		return;
	}

	if (!pHalData->bt_coexist.bInitlized)
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], btdm_InitBtCoexistDM()\n"));
		btdm_InitBtCoexistDM(padapter);
	}

	RTPRINT(FBT, BT_TRACE, ("\n\n[DM][BT], BTDM start!!\n"));

	BTDM_PWDBMonitor(padapter);

	if (IS_HARDWARE_TYPE_8723A(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], HW type is 8723\n"));
		BTDM_BTCoexist8723A(padapter);
	}
#if 0
	else if (IS_HARDWARE_TYPE_8192C(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], HW type is 88C\n"));
		btdm_BTCoexist8192C(padapter);
	}
	else if (IS_HARDWARE_TYPE_8192D(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], HW type is 92D\n"));
		btdm_BTCoexist8192D(padapter);
	}
#endif
	RTPRINT(FBT, BT_TRACE, ("[DM][BT], BTDM end!!\n\n"));
}

void BTDM_UpdateCoexState(PADAPTER padapter)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);

	if (!BTDM_IsSameCoexistState(padapter))
	{
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], Coexist State[bitMap] change from 0x%"i64fmt"x to 0x%"i64fmt"x,  changeBits=0x%"i64fmt"x\n",
			pHalData->bt_coexist.PreviousState,
			pHalData->bt_coexist.CurrentState,
			(pHalData->bt_coexist.PreviousState^pHalData->bt_coexist.CurrentState)));
		pHalData->bt_coexist.PreviousState = pHalData->bt_coexist.CurrentState;
	}
}

u8 BTDM_IsSameCoexistState(PADAPTER padapter)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);

	if (pHalData->bt_coexist.PreviousState == pHalData->bt_coexist.CurrentState)
	{
		return _TRUE;
	}
	else
	{
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], Coexist state changed!!\n"));
		return _FALSE;
	}
}

void BTDM_PWDBMonitor(PADAPTER padapter)
{
//	PMGNT_INFO 		pMgntInfo = &(GetDefaultAdapter(padapter)->MgntInfo);
	PBT30Info		pBTInfo = GET_BT_INFO(GetDefaultAdapter(padapter));
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8			H2C_Parameter[3] = {0};
	s32			tmpBTEntryMaxPWDB=0, tmpBTEntryMinPWDB=0xff;
	u8			i;

	if (pBtMgnt->BtOperationOn)
	{
		for (i = 0; i < MAX_BT_ASOC_ENTRY_NUM; i++)
		{
			if (pBTInfo->BtAsocEntry[i].bUsed)
			{
				if (pBTInfo->BtAsocEntry[i].UndecoratedSmoothedPWDB < tmpBTEntryMinPWDB)
					tmpBTEntryMinPWDB = pBTInfo->BtAsocEntry[i].UndecoratedSmoothedPWDB;
				if (pBTInfo->BtAsocEntry[i].UndecoratedSmoothedPWDB > tmpBTEntryMaxPWDB)
					tmpBTEntryMaxPWDB = pBTInfo->BtAsocEntry[i].UndecoratedSmoothedPWDB;

				//
				// Report every BT connection (HS mode) RSSI to FW
				//
				H2C_Parameter[2] = (u8)(pBTInfo->BtAsocEntry[i].UndecoratedSmoothedPWDB & 0xFF);
				H2C_Parameter[0] = (MAX_FW_SUPPORT_MACID_NUM-1-i);
				RTPRINT(FDM, DM_BT30, ("RSSI report for BT[%d], H2C_Par = 0x%x\n", i, H2C_Parameter[0]));
				FillH2CCmd(padapter, RSSI_SETTING_EID, 3, H2C_Parameter);
				RTPRINT_ADDR(FDM, (DM_PWDB|DM_BT30), ("BT_Entry Mac :"), pBTInfo->BtAsocEntry[i].BTRemoteMACAddr)
				RTPRINT(FDM, (DM_PWDB|DM_BT30), ("BT rx pwdb[%d] = 0x%x(%d)\n", i, pBTInfo->BtAsocEntry[i].UndecoratedSmoothedPWDB,
					pBTInfo->BtAsocEntry[i].UndecoratedSmoothedPWDB));
			}
		}
		if (tmpBTEntryMaxPWDB != 0)	// If associated entry is found
		{
			pHalData->dmpriv.BT_EntryMaxUndecoratedSmoothedPWDB = tmpBTEntryMaxPWDB;
			RTPRINT(FDM, (DM_PWDB|DM_BT30), ("BT_EntryMaxPWDB = 0x%x(%d)\n",
				tmpBTEntryMaxPWDB, tmpBTEntryMaxPWDB));
		}
		else
		{
			pHalData->dmpriv.BT_EntryMaxUndecoratedSmoothedPWDB = 0;
		}
		if (tmpBTEntryMinPWDB != 0xff) // If associated entry is found
		{
			pHalData->dmpriv.BT_EntryMinUndecoratedSmoothedPWDB = tmpBTEntryMinPWDB;
			RTPRINT(FDM, (DM_PWDB|DM_BT30), ("BT_EntryMinPWDB = 0x%x(%d)\n",
				tmpBTEntryMinPWDB, tmpBTEntryMinPWDB));
		}
		else
		{
			pHalData->dmpriv.BT_EntryMinUndecoratedSmoothedPWDB = 0;
		}
	}
}

u8 BTDM_DigByBtRssi(PADAPTER padapter)
{
//	PMGNT_INFO 		pMgntInfo = &(GetDefaultAdapter(padapter)->MgntInfo);
	PBT30Info		pBTInfo = GET_BT_INFO(GetDefaultAdapter(padapter));
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);
	u8				bRet = _FALSE;
	PDM_ODM_T		pDM_OutSrc = &pHalData->odmpriv;
	u8				digForBtHs=0, cckCcaThres=0;


	//
	// When running under HS mode, use bt related Dig and cck threshold.
	//
	if (pBtMgnt->BtOperationOn)
	{
		if (pBtMgnt->bBTConnectInProgress)
		{
			if (IS_HARDWARE_TYPE_8723A(padapter))
				digForBtHs = 0x28;
			else
				digForBtHs = 0x22;
		}
		else
		{
			//
			// Decide DIG value by BT RSSI.
			//
			digForBtHs = (u8)pHalData->dmpriv.BT_EntryMinUndecoratedSmoothedPWDB;

			if (IS_HARDWARE_TYPE_8723A(padapter))
				digForBtHs += 0x04;

			if (digForBtHs > DM_DIG_MAX_NIC)
				digForBtHs = DM_DIG_MAX_NIC;
			if (digForBtHs < DM_DIG_MIN_NIC)
				digForBtHs = DM_DIG_MIN_NIC;

			RTPRINT(FDM, DM_BT30, ("BTDM_DigByBtRssi(), digForBtHs=0x%x\n",
					digForBtHs));
		}
		ODM_Write_DIG(pDM_OutSrc, digForBtHs);

		//
		// Decide cck packet threshold
		//
		cckCcaThres = 0xcd;
		ODM_Write_CCK_CCA_Thres(pDM_OutSrc, cckCcaThres);

