acuster/FirefoxOS-Flatfish-kernel/drivers/net/wireless/rtl8723as/hal/rtl8723a/rtl8723a_bt-coexist_0.c
		bRet = _TRUE;
	}

	return bRet;
}

u8 BTDM_IsBTBusy(PADAPTER padapter)
{
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

	if (pBtMgnt->ExtConfig.bBTBusy)
		return _TRUE;
	else
		return _FALSE;
}

u8 BTDM_IsWifiBusy(PADAPTER padapter)
{
//	PMGNT_INFO 		pMgntInfo = &(GetDefaultAdapter(padapter)->MgntInfo);
	struct mlme_priv *pmlmepriv = &(GetDefaultAdapter(padapter)->mlmepriv);
	PBT30Info		pBTInfo = GET_BT_INFO(padapter);
	PBT_TRAFFIC 	pBtTraffic = &pBTInfo->BtTraffic;


	if (pmlmepriv->LinkDetectInfo.bBusyTraffic ||
		pBtTraffic->Bt30TrafficStatistics.bTxBusyTraffic ||
		pBtTraffic->Bt30TrafficStatistics.bRxBusyTraffic)
		return _TRUE;
	else
		return _FALSE;
}

u8 BTDM_IsCoexistStateChanged(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (pHalData->bt_coexist.PreviousState == pHalData->bt_coexist.CurrentState)
		return _FALSE;
	else
		return _TRUE;
}

u8 BTDM_IsWifiUplink(PADAPTER padapter)
{
//	PMGNT_INFO 		pMgntInfo = &(GetDefaultAdapter(padapter)->MgntInfo);
	struct mlme_priv *pmlmepriv;
	PBT30Info		pBTInfo;
	PBT_TRAFFIC		pBtTraffic;


	pmlmepriv = &padapter->mlmepriv;
	pBTInfo = GET_BT_INFO(padapter);
	pBtTraffic = &pBTInfo->BtTraffic;

	if ((pmlmepriv->LinkDetectInfo.bTxBusyTraffic) ||
		(pBtTraffic->Bt30TrafficStatistics.bTxBusyTraffic))
		return _TRUE;
	else
		return _FALSE;
}

u8 BTDM_IsWifiDownlink(PADAPTER padapter)
{
//	PMGNT_INFO 		pMgntInfo = &(GetDefaultAdapter(padapter)->MgntInfo);
	struct mlme_priv *pmlmepriv;
	PBT30Info		pBTInfo;
	PBT_TRAFFIC		pBtTraffic;


	pmlmepriv = &padapter->mlmepriv;
	pBTInfo = GET_BT_INFO(padapter);
	pBtTraffic = &pBTInfo->BtTraffic;

	if ((pmlmepriv->LinkDetectInfo.bRxBusyTraffic) ||
		(pBtTraffic->Bt30TrafficStatistics.bRxBusyTraffic))
		return _TRUE;
	else
		return _FALSE;
}

u8 BTDM_IsBTHSMode(PADAPTER padapter)
{
//	PMGNT_INFO 		pMgntInfo = &(GetDefaultAdapter(padapter)->MgntInfo);
	PHAL_DATA_TYPE	pHalData;
	PBT_MGNT		pBtMgnt;


	pHalData = GET_HAL_DATA(padapter);
	pBtMgnt = &pHalData->BtInfo.BtMgnt;

	if (pBtMgnt->BtOperationOn)
		return _TRUE;
	else
		return _FALSE;
}

u8 BTDM_IsBTUplink(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (pHalData->bt_coexist.BT21TrafficStatistics.bTxBusyTraffic)
		return _TRUE;
	else
		return _FALSE;
}

u8 BTDM_IsBTDownlink(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic)
		return _TRUE;
	else
		return _FALSE;
}

void BTDM_AdjustForBtOperation(PADAPTER padapter)
{
	RTPRINT(FBT, BT_TRACE, ("[BT][DM], BTDM_AdjustForBtOperation()\n"));
	if (IS_HARDWARE_TYPE_8723A(padapter))
	{
		BTDM_AdjustForBtOperation8723A(padapter);
	}
}

u8 BTDM_AdjustRssiForAgcTableOn(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (!IS_HARDWARE_TYPE_8192D(padapter) &&
		!IS_HARDWARE_TYPE_8723A(padapter))
		return 0;

	if (pHalData->bt_coexist.b92DAgcTableOn)
		return 12;

	if (pHalData->bt_coexist.b8723aAgcTableOn)
		return 6;

	return 0;
}

void BTDM_SetBtCoexCurrAntNum(PADAPTER padapter, u8 antNum)
{
	if (IS_HARDWARE_TYPE_8723A(padapter))
		BTDM_Set8723ABtCoexCurrAntNum(padapter, antNum);
}

void BTDM_ForHalt(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (!pHalData->bt_coexist.BluetoothCoexist)
	{
		return;
	}

	if (IS_HARDWARE_TYPE_8723A(padapter))
	{
		BTDM_ForHalt8723A(padapter);
		GET_HAL_DATA(padapter)->bt_coexist.bInitlized = _FALSE;
	}
}

void BTDM_WifiScanNotify(PADAPTER padapter, u8 scanType)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (!pHalData->bt_coexist.BluetoothCoexist)
	{
		return;
	}

	if (IS_HARDWARE_TYPE_8723A(padapter))
		BTDM_WifiScanNotify8723A(padapter, scanType);
}

void BTDM_WifiAssociateNotify(PADAPTER padapter, u8 action)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (!pHalData->bt_coexist.BluetoothCoexist)
	{
		return;
	}

	if (IS_HARDWARE_TYPE_8723A(padapter))
		BTDM_WifiAssociateNotify8723A(padapter, action);
}

void BTDM_MediaStatusNotify(PADAPTER padapter, RT_MEDIA_STATUS mstatus)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (!pHalData->bt_coexist.BluetoothCoexist)
	{
		return;
	}

	if (IS_HARDWARE_TYPE_8723A(padapter))
		BTDM_MediaStatusNotify8723A(padapter, mstatus);
}

void BTDM_ForDhcp(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	if (!pHalData->bt_coexist.BluetoothCoexist)
	{
		return;
	}

	if (IS_HARDWARE_TYPE_8723A(padapter))
		BTDM_ForDhcp8723A(padapter);
}

void BTDM_ResetActionProfileState(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(padapter);

	pHalData->bt_coexist.CurrentState &= ~\
		(BT_COEX_STATE_PROFILE_HID|BT_COEX_STATE_PROFILE_A2DP|
		BT_COEX_STATE_PROFILE_PAN|BT_COEX_STATE_PROFILE_SCO);
}

u8 BTDM_IsActionSCO(PADAPTER padapter)
{
	PHAL_DATA_TYPE	pHalData;
	PBT30Info		pBTInfo;
	PBT_MGNT		pBtMgnt;
	PBT_DBG			pBtDbg;
	u8			bRet;


	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;
	pBtDbg = &pBTInfo->BtDbg;
	bRet = _FALSE;

	if (pBtDbg->dbgCtrl == _TRUE)
	{
		if (pBtDbg->dbgProfile == BT_DBG_PROFILE_SCO)
		{
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_SCO;
			bRet = _TRUE;
		}
	}
	else
	{
		if (pBtMgnt->ExtConfig.NumberOfSCO > 0)
		{
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_SCO;
			bRet = _TRUE;
		}
	}
	return bRet;
}

u8 BTDM_IsActionHID(PADAPTER padapter)
{
	PBT30Info		pBTInfo;
	PHAL_DATA_TYPE	pHalData;
	PBT_MGNT		pBtMgnt;
	PBT_DBG			pBtDbg;
	u8			bRet;


	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;
	pBtDbg = &pBTInfo->BtDbg;
	bRet = _FALSE;

	if (pBtDbg->dbgCtrl == _TRUE )
	{
		if (pBtDbg->dbgProfile == BT_DBG_PROFILE_HID)
		{
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_HID;
			bRet = _TRUE;
		}
	}
	else
	{
		if (BTHCI_CheckProfileExist(padapter,BT_PROFILE_HID) && pBtMgnt->ExtConfig.NumberOfHandle==1)
		{
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_HID;
			bRet = _TRUE;
		}
	}
	return bRet;
}

